{
  "id": "char_4163_rosesa",
  "meta_info": {
    "name": "Rose Salt",
    "appellation": " ",
    "voiceActor": {
      "en": "Andrea Alzuri Barro",
      "jp": "Miria Takagishi",
      "kr": "Mi-so",
      "cn": "Nan Zhao"
    },
    "rarity": 5,
    "profession": "Medic",
    "subProfessionId": "Multi-target Medic",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "Healing",
      "Support"
    ],
    "nationId": "Iberia",
    "isNotObtainable": false,
    "itemObtainApproach": "Event Reward",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Rose Salt\n[Gender] Female\n[Thieving Experience] 5 Years\n[Place of Birth] Iberia\n[Date of Birth] Mar 30\n[Race] Phidia\n[Height] 146cm\n[Infection Status]\nOriginium crystals distributed across surface of body, confirmed Infected by medical examination.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Normal\n[Mobility] Standard\n[Physical Resilience] Standard\n[Tactical Acumen] Standard\n[Combat Skill] Standard\n[Originium Arts Assimilation] Normal",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Rose Salt, an herbalist who wanders Iberia. She boasts many local connections of every class and creed, and currently provides Rhodes Island with intelligence on Iberia and preliminary research.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests show the indistinct outlines of internal organs, obscured by abnormal shadows. Originium granules detected in the circulatory system. The subject is confirmed to be infected with Oripathy.\n\n[Cell-Originium Assimilation] 12%\nSome Originium crystals are visible on Operator Rose Salt's left arm.\n\n[Blood Originium-Crystal Density] 0.15u/L\n'I'm not sure why Rose Salt is so health-conscious at her young age. The moment she heard that new hires get a free medical examination, she requested Medical to pull out all the stops for hers. She even got a screening for hereditary diseases. She's also extremely cooperative with her Oripathy treatment. The other day, someone spotted her poring over a copy of 'A Hundred Habits of the Long-Lived.' I guess she's planning to live forever!'",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Barely a day had passed before the operators coming and going from Rhodes Island were aware of a newly-arrived, sweet little girl. She would greet people with honey-glazed 'señor's and 'señora's, and if she ever spotted anyone unwell, she would approach to ask if they needed help. She would even give herself all sorts of cutesy nicknames for others to call her. Her petite build and elegant yet yellowed and old-fashioned clothing also contributed to the image of a young girl going through hard times, yet still keeping herself tidy while doing what she could to help others with her herbs (despite the full suite of medical facilities aboard Rhodes Island). She had successfully lodged herself in the hearts of the operators, making them all the fonder of this new hire.\nBut this situation would soon deteriorate, as her old habits reared their head and she found herself palming another operator's beautiful bracelet.\nAs a thief and pickpocket who had long operated in remote regions of Iberia, Rose Salt was completely unaware of 'Closure's Handmade High-Grade Security System' when she did the deed, and her crime was recorded in high definition by the surveillance cameras. To teach her a lesson, Closure had her do honest work by weaving three hundred identical bracelets and selling them. At first, Rose Salt assumed she would be paid a portion of whatever she earned, but to give her the experience of having her things taken by others, Closure put all the money towards security system maintenance.\nAfter this harsh punishment, Rose Salt was a pitiful sight, slumped against the wall of the dormitory. Yet she never expected to be approached by the operator she stole from, carrying one of the bracelets she had made for Closure. The operator gave her her bracelet and said to the young girl: 'If you liked it that much, you could have just told me. We could have woven them together, and I'd have given one to you.'\nRose Salt's face was blank as she received it, but she quickly broke into a sincere smile. Since that day, she rarely falls back into her cloying, honeyed greetings. Perhaps she has learned there is no need for her to pretend while aboard Rhodes Island, and that if she is true to others, they will be true to her.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "For a drifter, the title of 'herbalist' is a useful one. People are always ready to trust a doctor, and will not question what is inside her bag even as it bulges at the seams. While she does make use of this identity to approach her targets, it is not a false one. She really does have medical skills, and is able to treat minor scrapes and illnesses with ease. She is even famous as a wandering medic in some regions of Iberia.\nAccording to her, her medical knowledge stems mostly from observing which herbs wild beasts would eat when poisoned or ill, or noting what herbs other doctors had used to treat her. She would then gather these herbs and dig them out of her bag the next time she ran into similar circumstances, either for herself or others. She claims the results speak for themselves, and that she's never run into any issues with this method. However, we have also asked Operator Thorns his opinion, as he has received her treatment before.\nDuring a serious bout of motion sickness while traversing the Salt Flat, he drank an herbal soup offered by Rose Salt. As soon as it went down his throat, he found himself gripped by some indescribable force restoring his vitality, allowing him to walk the shuddering saltship like it was dry land. His limbs also felt like they had minds of their own, and it took a while before he felt in control of them again. He only later learned the cause of this: Rose Salt had given him an anti-nausea dosage appropriate for a healthy adult mangler beast. While it did cure his motion sickness for good, he does not recommend taking her prescriptions lightly.\nWhile she does stock life-saving herbs (though given the aforementioned incident, 'life-saving' is debateable), the majority of Rose Salt's herb collection is instead for inducing dizziness. While she claims this is for self-defense, after seeing her knock out a raging tuskbeast with ease during a mission, most people no longer believe a word she says.\nHowever, Aak has displayed a keen interest in his new coworker. After all, the censer she carries is effective in distributing all sorts of smoke and vapors. The two of them have been secretly collaborating in the development of 'miracle cures'. We can only hope that we have not found ourselves yet another laboratory explosion extraordinaire.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Before coming to Rhodes Island, Rose Salt made a living working for Iberians of every social class. She is well-acquainted with mayoral aides, the Inquisition, and the wealthy in general, but also familiar with street-level thieves and traders. Most of the time, she would act as a naive little girl, enthusiastically helping others while showing a deep interest in the lives of the rich. Once she had discreetly learned when they would not be home, she would sneak in and rob them. When not buttering someone up, she would show her true self, loitering in the marketplace and trading loot and favors until she had what she wanted.\nAfter joining Rhodes Island, we taught her the knowledge and etiquette appropriate for her age, and how to hold a steady job like the other operators, essentially changing her lifestyle to one where she earned a fair wage. To our astonishment, she was not wholly unfamiliar with our lessons. In fact, not only was she already experienced with dining etiquette and formal speech, unlike most she even had some knowledge of subjects like formal letter writing, classical music, and painting. It seems she had received a robust education fit for nobility. But for whatever reason, she did not continue with her education, leaving her knowledge of etiquette at the level of a seven or eight year old. Now, she leans towards another extreme: in order to obtain what she wants, she will happily pretend to be a young maiden of whichever archetype she wishes, easily deceiving those who would lower their guard towards a little girl.\nTo live the 'good life' she envisions, Rose Salt has begrudgingly heeded our instructions and joined a classroom of seven and eight-year-olds in their lessons. However, she has repeatedly emphasized that we are not to mention she is going to class in front of the Iberians who call her Señora Pascuala, or to give her a really bad noogie!",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "There is a phrase Rose Salt is fond of saying: 'I'm going to live the good life!' And true enough, she came aboard Rhodes Island one day with a large sum of money.\nApparently, it was a reward for remarkable performance during a mission. With it, she bought herself fine clothes, shiny jewelry, and all sorts of things she did not need in the slightest: a small bedside couch made with silk, a hand mirror inlaid with miniature diamonds, and a gorgeous gown with a hem trailing along the floor, etc.\nYet she still dresses in her usual clothes, having set aside such finery after only wearing it once or twice. She is simply unused to these refined luxuries. She piles the silk couch full of things she needs for her missions, the diamond-studded mirror is wedged beneath her luggage to balance it out, the gorgeous gown is draped over the bed to form a sheet, and everything else is stuffed into whatever free space there is in the small dorm we assigned to her. The glinting and glimmering coming from random corners of her room is proof enough that they exist. It seems this is the 'good life' she always dreamed of.\nMoreover, the moment she has her wages for the month, she always tops up her meal card before spending the rest as soon as she can, buying all sorts of beautiful baubles she needs (or does not need), filling her dorm more and more. Rarely does she ever actually wear any of them, though. We are not sure why, but compared to others with such lavish tastes, who delight in decorating themselves, Rose Salt seems to prefer the act of spending money itself, as well as simply owning these sparkling treasures.\nMany items in her collection are things she has owned for a very long time. While they no longer shine like they used to, she still takes good care of them. One time, she lost one of her baubles. She tracked it all the way to the trash storage, digging the once-beautiful object from its depths. It is as if what she cares about is not their appearance, but simply possessing them.\nYet it seems this is still not the 'good life' she longs for.\nAs the days passed, Rose Salt tried the life of an ordinary, rule-abiding operator, doing ordinary fieldwork and earning an ordinary wage. She has also tried returning to the life of a drifter in Iberia, assisting Rhodes Island by discreetly gathering intelligence, and occasionally earning a big wad of cash for her troubles. But after asking around, she has begun to show a keen interest in developed nations such as Columbia or Kazimierz. It is apparent that in her eyes, these two countries are lands of endless wealth. We are unsure where she picked up such notions, but she is convinced she will strike it rich there. To her, she is destined to join the upper echelons of moneyed society as a hyper-rich magnate of some sort, and finally live the true 'good life' of her dreams.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "When she first arrived on Rhodes Island, Rose Salt introduced herself with a bevy of cloyingly cute nicknames in order to maintain her cutesy persona. These sickly-sweet names include, but are not limited to, 'Peludita', 'Little Pascy', 'Beautiful Lil' Viper', etc. Many operators, taken in by her charm, starting actually calling her by these names, satisfying her need for cuteness. But after more time together, nearly every operator has learned her true nature, and to get back at her for lying, they started breaking out these cloying nicknames whenever she exposes her true colors, such as when she tries to assert authority over her underlings—\n'Peludita~'\n'Little Pascy~'\n'Beau~ti~ful~ Lil'~ Vi~per~'\n'GAHHH! STOP CALLING ME THAT!'",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1323,
      "atk": 264,
      "def": 125,
      "magicResistance": 0,
      "blockCnt": 1,
      "baseAttackTime": 2.85,
      "respawnTime": 80,
      "cost": 19
    }
  },
  "skins": [
    {
      "skinId": "char_4163_rosesa#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_4163_rosesa",
      "portraitId": "char_4163_rosesa_1",
      "illustId": "illust_char_4163_rosesa_1",
      "modelName": "Rose Salt",
      "drawerList": [
        "二开"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_4163_rosesa#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_4163_rosesa_2",
      "portraitId": "char_4163_rosesa_2",
      "illustId": "illust_char_4163_rosesa_2",
      "modelName": "Rose Salt",
      "drawerList": [
        "二开"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "y-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 782,
            "atk": 120,
            "def": 72,
            "magicResistance": 0,
            "cost": 17,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.85,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1058,
            "atk": 195,
            "def": 96,
            "magicResistance": 0,
            "cost": 17,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.85,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 70,
      "rangeId": "y-2",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1058,
            "atk": 195,
            "def": 96,
            "magicResistance": 0,
            "cost": 19,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.85,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 1323,
            "atk": 264,
            "def": 125,
            "magicResistance": 0,
            "cost": 19,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.85,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3261",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30042",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30022",
          "count": 3,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 80,
      "rangeId": "y-2",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1323,
            "atk": 264,
            "def": 125,
            "magicResistance": 0,
            "cost": 19,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.85,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1675,
            "atk": 330,
            "def": 151,
            "magicResistance": 0,
            "cost": 19,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.85,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3263",
          "count": 3,
          "type": "MATERIAL"
        },
        {
          "id": "31034",
          "count": 7,
          "type": "MATERIAL"
        },
        {
          "id": "31053",
          "count": 11,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_rosesa_1",
      "skillName": "Top-Notch Emergency Meds!",
      "desc": "The next heal is increased to <@ba.vup>{heal_scale:0%}</> ATK\n<@ba.rem>Can store {ct} charge(s)</>",
      "iconId": "skchr_rosesa_1",
      "spCost": 8,
      "initSp": 0,
      "duration": 0,
      "blackboard": [
        {
          "key": "heal_scale",
          "value": 1.9
        },
        {
          "key": "ct",
          "value": 2
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30013",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31064",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31074",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30155",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 1,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_rosesa_2",
      "skillName": "Super-Fine Slow-Release Meds!",
      "desc": "Attack interval <@ba.vup>reduces</>, <@ba.vup>{damage_reduce_scale_display:0%}</> of Physical and Arts damage received by allied Operators within range becomes HP loss over <@ba.vup>{attack@final_duration}</>s",
      "iconId": "skchr_rosesa_2",
      "spCost": 36,
      "initSp": 27,
      "duration": 27,
      "blackboard": [
        {
          "key": "attack@interval",
          "value": 1
        },
        {
          "key": "attack@final_duration",
          "value": 5
        },
        {
          "key": "base_attack_time",
          "value": -1.35
        },
        {
          "key": "attack@damage_scale",
          "value": 0.5
        },
        {
          "key": "damage_reduce_scale_display",
          "value": 0.5
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30093",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 1,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_rosesa",
      "moduleName": "Rose Salt's Badge",
      "desc": "Operator Rose Salt has demonstrated a remarkable aptitude for healing several teammates in a short period of time.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Medic Operator during field operations to exercise Multi-target Medic responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_rosesa",
      "moduleName": "Colorful Life in the Salt Flat",
      "desc": "The old prison guard hands Pascuala a bowl of soup. She puts her hand in and fishes out a scrap of saltfin leather with writing scrawled on it: 'Boss, we plan to blow up the maximum security cell block with saltfin poop explosives. We'll rescue you while causing maximum chaos to scare the hell out of these people. That's how we'll keep them under our thumbs and make a fortune!' She nods her head in satisfaction, listening to the guard hum a tune as she waits for tomorrow's jailbreak.\nWait. Something's not right here! Pascuala's eyes widen as she looks at the drafty walls of her cell and the frail old guard with his back turned, humming his tune. This isn't a maximum security cell! She looks out the window. Her crew has already finished planting the explosives, and their shadows are retreating in the moonlight.\nPascuala slams down her soup bowl, 'Hey! You locked me up in the frigging wrong cell!'\nThe old guard straightens up, shakily, 'What? There's a fire in your cell?'\n'No! You put me in the wrong cell! I committed a capital offense. I should be in the supermax.\n'Huh? Soup? I just gave you your soup. No need to worry, child. This here's the county jail. I'm sure someone will bail you out tomorrow.'\n'No! I'm going to the gallows tomorrow! Look! My wanted posters are all over the walls. I should be in maximum security!'\nThe old guard squints at the wanted poster. 'No. I'm afraid you're mistaken. This looks nothing like you. She's a fearsome demon, and you're just a frightened little girl.'\n'Finshit!' Pascuala jumps three feet in the air. 'I robbed the mayor's house, kidnapped his precious pet musbeast, drained his wine cellar, sold off all his jewels, and threw a wild party in his mansion. The old geezer got so mad he passed out for three whole days! I deserve to be in maximum security!'\n'Oh—' The old guard gives her a knowing glance. 'I get it now.'\nPascuala's face glows with joy. Finally, they would transfer her to the right prison cell. Then, tomorrow, when the explosives go off, she would shock the whole town into submission! She would make her fortune with this, and even become the town mayor just for the heck of it!\nThe old guard pats her on the forehead. 'You poor girl. You must be delirious from your fever. We've got to get you to the medical office, straightaway.'\nHe rushes her off to see his good friend, the town doctor. 'You poor girl,' the doctor murmurs. 'You've been wrongly arrested and developed a fever from the shock.' He gives her medication to stop the fever, combined with a sedative. He then places her in a warm bed with heart-print sheets. By the time Pascuala drifts off to sleep, she is surrounded by plush toys, with a lollipop in her mouth.\nThe next day, Pascuala's crew, armed to the teeth with explosives, stand in grim silence around the hospital bed. The doctor places the girl in their arms. He looks them over and yells, 'You must be her family! The girl is so sick! Why didn't you bring her here earlier?!' The crew stares at their 'fearsome' leader, bundled up like a flower bouquet. A collective horrified scream rings through the room. In a panic, they dump Pascuala back onto the bed, turn tail, and bolt into the night, never to return.\n—And so, according to legend, the greatest bandit gang in Salt Town history crumbled overnight… at the hands of one old prison guard."
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "Come on, Doctor, I <i>just</i> got back from fieldwork. My arms ache, my legs are sore… Can't we leave this stuff for tomorrow? Pretty please? No? Tsk, stupid hood-head… My Rhodes Island pass is ready...? Ahaha! Just kidding. Right away, boss!",
      "voiceAsset": "char_4163_rosesa/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Hey, you awake? C'mon, c'mon, snap out of it! And what's with that dopey look on your face? You said you were dead tired and didn't wanna work, so I told HR you passed out and got you some sick leave. Oh, that smell in the air? Dizzyleaf smoke. Isidro tried some before, and he slept like a log.",
      "voiceAsset": "char_4163_rosesa/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Who made this finshit class schedule?! Why do I have to sit in an etiquette class with those stupid little brats? And what in the saltdamned seas is this supposed to be? 'List of banned profanity: salty bastard, inquisition gilipollas…' Hmph, honestly, how is—Ow! Why'd you hit me...?",
      "voiceAsset": "char_4163_rosesa/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Doctor! It's been two weeks since I applied for field missions. I was wondering if—What the hell? <i>Three</i> years with a clean record at Rhodes Island first?! Ahem, I mean, come on, can't you bend the rules just a little. Doing bad things in Rhodes Island's name? I would never! So... Please, my most esteemed boss. Help me, O Supreme and Invincible Commander. Oh, I beg you, the Great Doctor!",
      "voiceAsset": "char_4163_rosesa/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "So much stuff in my room? Not really. Only a bunch of pretty dresses, yummy snacks, and shiny gems. Hey, don't look at me like that! I <i>paid</i> for all this! I just wanna be surrounded by the things I've always wanted. Snuggling up to them helps me sleep at night.",
      "voiceAsset": "char_4163_rosesa/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "I've slept on beds softer than this one, as well as out in the Salt Flat, and on a ship's deck. I'll never forget how it feels, just like I'll never return to a life on the run. You know what, Doctor? One day, I'll have a nice, big, comfy bed all my own, and that's how I'll know I'm living the good life.",
      "voiceAsset": "char_4163_rosesa/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Listen, Doctor. Those Bastards at the Inquisition are nothing more than a school of starving saltfins. The moment they smell blood, they'll lock their dead finny eyes on you and mark you for death. Disgusting! Vermin! Stay clear at all costs! Wait, what...? The little bird I was just dancing with was an <i>Inquisitor</i>?!",
      "voiceAsset": "char_4163_rosesa/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Any towns in Iberia I don't know? Pfft! I could show you where all their mayors hide their doblones. So what's this about? Ohh... You need intel but can't dig it up yourselves? And now you're... begging me for help? Hee hee hee hee. Well then, first of all… Address me properly, as Señora Pascuala.",
      "voiceAsset": "char_4163_rosesa/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "Oye, Doctor, you think I could earn more in Columbia or Kazimierz? I hear those two places have loads of people who'll throw money at anything. The streets are a treasure trove of opportunity! Oh, don't worry, if I do get a big haul, I'll need you there to help reel it in.",
      "voiceAsset": "char_4163_rosesa/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "*Sigh* Imagine having a whole office to yourself… I wish I had one too…",
      "voiceAsset": "char_4163_rosesa/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Hola, everyone, pleased to meet you! I'm your newest operator! Señores Elysium and Weedy recommended this place to me. I hope we can all get along—Hey, Pelirrojito! What's with the pretend puking? You got a problem with me?!",
      "voiceAsset": "char_4163_rosesa/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "See? Didn't I say I'm pretty good at this sort of thing?",
      "voiceAsset": "char_4163_rosesa/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "A raise? Excellent! Oh Doctor, you are truly my guiding light, and Rhodes Island is the best company ever. I'll work here until the day I die! So, when's the next raise?",
      "voiceAsset": "char_4163_rosesa/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "This is just one small step. I'll take another, then another, till one day, everything I ever wanted will be within reach.",
      "voiceAsset": "char_4163_rosesa/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Yahoo, I'm here and ready for another day's work!",
      "voiceAsset": "char_4163_rosesa/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Hello everyone, I'm your captain for today, so please listen up and listen well!",
      "voiceAsset": "char_4163_rosesa/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Careful out there—I'm not <i>that</i> good a medic.",
      "voiceAsset": "char_4163_rosesa/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Uwaah! My gosh… Please keep me safe, everyone!",
      "voiceAsset": "char_4163_rosesa/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "What? Worried I'm not healing them right?",
      "voiceAsset": "char_4163_rosesa/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Relax, your operators have been good to me. I still have a conscience, you know.",
      "voiceAsset": "char_4163_rosesa/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "This here is a good spot. They can't see me.",
      "voiceAsset": "char_4163_rosesa/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Check again, it's dizzyleaf smoke. If we can't take 'em down, this'll take 'em out…",
      "voiceAsset": "char_4163_rosesa/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Remember to stand <i>inside</i> the smoke, okay?",
      "voiceAsset": "char_4163_rosesa/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "The smoke won't chase you like a hungry saltfin, so stay put already!",
      "voiceAsset": "char_4163_rosesa/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "If anyone's severely injured, just let me know and I'll add more herbs to the censer!",
      "voiceAsset": "char_4163_rosesa/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Is my smoke toxic?! More herbs won't kill you, so stop whining already!",
      "voiceAsset": "char_4163_rosesa/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Wow, it's a privilege to be working with you all!",
      "voiceAsset": "char_4163_rosesa/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Not bad. If I hired one of you as a bodyguard, I'd never have to worry about danger again… What? I'm showing my true colors? Oh, you must've misunderstood. What I meant is, I couldn't bear to be apart from you all.",
      "voiceAsset": "char_4163_rosesa/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Frigging heartless bastards… You better remember this! I'll be back for my pound of flesh one day!",
      "voiceAsset": "char_4163_rosesa/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Didn't expect you to be so loyal, waiting for me like that! Now move it, or we're dying together!",
      "voiceAsset": "char_4163_rosesa/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Hmm, this place isn't half bad.",
      "voiceAsset": "char_4163_rosesa/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Hey hey hey, ever heard of personal space?!",
      "voiceAsset": "char_4163_rosesa/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Oh, it's you, Doctor. Want some water? A snack? Just call me whenever and I'll be there to help.",
      "voiceAsset": "char_4163_rosesa/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_4163_rosesa/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "I don't really get what this holiday's about. What's there to celebrate about time simply passing by? If you ask me, people should celebrate when they get what they want. For me, I'll look back at all the hardships I went through, and cherish how they've become precious things I can hold in my hand.",
      "voiceAsset": "char_4163_rosesa/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Hello, Doctor! If you need any help, just give me a shout!",
      "voiceAsset": "char_4163_rosesa/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Of course I remembered your birthday! Though I gotta admit, I only memorized it to get on your good side at first, but then... You turned out to be a real great boss, and a true friend too. Here, some rum I nabbed from the salt ship. For you.",
      "voiceAsset": "char_4163_rosesa/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "Doctor, I hope you and all the friends I made aboard the landship can live the lives you truly want. Heehee, who knows? Next time we meet, I might be rich and famous, coming to sponsor Rhodes Island!",
      "voiceAsset": "char_4163_rosesa/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "trade_ord_limit&trade&lv[001]",
      "buffName": "Time Is Money",
      "desc": "When this Operator is assigned to a Trading Post, <@cc.vup>+1</> order limit for every level of that Trading Post",
      "skillIcon": "bskill_tra_limit&trade2",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "trade_ord_spd[1001]",
      "buffName": "Order Distribution β",
      "desc": "When this Operator is assigned to a Trading Post, order acquisition efficiency <@cc.vup>+30%</>",
      "skillIcon": "bskill_tra_spd2",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}