{
  "id": "char_1026_gvial2",
  "meta_info": {
    "name": "Gavial the Invincible",
    "appellation": " ",
    "voiceActor": {
      "en": "Natalie Winter",
      "jp": "Ayaka Suwa",
      "kr": "Kim You-lim",
      "cn": "Emma Chen"
    },
    "rarity": 6,
    "profession": "Guard",
    "subProfessionId": "Centurion",
    "position": "MELEE",
    "team": "",
    "tagList": [
      "Nuker",
      "DPS",
      "Survival"
    ],
    "nationId": "Rhodes Island",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Gavial\n[Gender] Female\n[Combat Experience] 11 Years\n[Place of Birth] Sargon\n[Date of Birth] May 1\n[Race] Archosauria\n[Height] 163cm\n[Infection Status]\nOriginium crystals are visible on the skin. Infection confirmed by medical examination.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Excellent\n[Mobility] Standard\n[Physical Resilience] Excellent\n[Tactical Acumen] Standard\n[Combat Skills] Excellent\n[Originium Arts Assimilation] Standard",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Gavial remains a member of the Rhodes Island Medical Department, but whenever Rhodes Island needs her combat prowess instead of her medical knowledge, she won't hesitate to pick up her battleaxe and charge toward her enemies.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests show the indistinct outlines of internal organs, obscured by abnormal shadows. Originium granules detected in the circulatory system. The subject is confirmed to be infected with Oripathy.\n\n[Cell-Originium Assimilation] 15.3%\nThis hasn't changed much since I joined Rhodes Island. Nothing to worry about.\n\n[Blood Originium-Crystal Density] 0.27u/L\nI know my own body better than anyone, but it's thanks to all the other operators at Medical that I've been able to keep my Oripathy under control so well. Maybe I should invite everyone to Acahualla for a vacation one of these days.\n—Gavial",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Most Operators have remarked that Gavial made a very strong impression with her outfit when she returned from Acahualla. At first, there were rumors that it was the equipment she inherited from her tribe before her decision to study medicine. Soon, though, the rumors got out of hand. In the end, people were gossiping that 'Gavial once used the axe to cut open a waterfall at the highest cliff in Acahualla, creating a new landmark there.' Although the origins of such absurd rumors cannot be ascertained, Operator Tomimi seemed to really take a liking to them, and added her own fuel to the fire as the story mutated.\nTomimi's personal interests aside, the fact is that it was Operator Eunectes who forged Gavial's new equipment. When the two of them received Tomimi's message that Acahualla could be facing a disaster, Gavial made the request for new gear. Eunectes then quickly fabricated the entire set, from the weapons and armor to even the accessories, out of the finest materials, yet it is the imposing yet easy-to-wield battleaxe that Gavial instantly took a liking to.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Although the disaster that Tomimi said in her letter would affect all of Acahualla was more or less fabricated by Stitch Canvas (now Rhodes Island Operator Minimalist), the Durin city beneath Acahualla, Zeruertza, was indeed facing a calamity. Fortunately, thanks to the combined efforts of the local residents and the Rhodes Island Operators present, the Zeruertza citizens were all able to evacuate to the surface before it was too late, and no lives were lost during the incident.\nIt's worth mentioning that Gavial played a pivotal leadership role during the handling of the crisis. She was the first to propose having the Durins evacuate to the surface, persuaded the plan's opponents, was one of the last to evacuate, and even maintained order when the Durins built their settlement on the surface, ensuring that the construction would be completed on time. Operators not involved with the incident have all expressed disbelief upon hearing that it was Gavial who talked her opponents over, but to those who experienced the events personally, her identity as both a warrior and a doctor had come together, and it all seemed to happen perfectly naturally, with nothing feeling strange about it whatsoever.\n'What were we supposed to do? She's Gavial.'",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "That said, our Medical Department personnel nonetheless noticed a subtle change in Gavial. Not that she's become more melancholic or moody or anything like that, but she's now more confident and talkative than ever, and enjoys talking about her homeland more.\nTo be clear, she's never had anything against talking about her hometown, even back when she first joined Rhodes Island. However, she simply viewed it as the place she was from, and nothing more. She had no reason to avoid the topic, but also no reason to bring it up, so if Rhodes Island wasn't going to dig any deeper, she would naturally have no reason to ever discuss Acahualla.\nYet ever since her bizarre rainforest vacation, Rhodes Island has started to see more and more Acahuallan Operators join its ranks, and Gavial has started to open up about her home more as well, which has led to us learning more about the region by the day. This was a forest that was once considered no man's land, but is home to all sorts of tribes, big and small—such as the battle-obsessed Tiacauh. However, it has also been slowly and irreversibly industrializing... and has now seen several hundred thousand Durins pouring in from underground. With all these factors coming together, even the planner with the greatest foresight in the world would find themselves struck with a headache when trying to imagine Acahualla's future.\nBut Gavial doesn't think so at all.\nIn her eyes, she, Tomimi, Zumama, Inam, and all the valiant Tiacauh will be able to overcome any challenges that Acahualla might face. She has her friends' complete, unreserved trust, and she too wholeheartedly trusts her friends. No matter how difficult the path forward is, even if she must really break open a waterfall at the tallest cliff in Acahualla, that wouldn't be entirely unrealistic with her friends' full support. And so, why not take pride in her homeland?\nOf course, there's little she can do about the fact that her friends trusts her fists far more than her medical acumen. Perhaps that's a good worry to have, though.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Classified Log]\nIn the short term, the Durins' move to the surface does not seem to have had much of an apparent effect on Acahualla. Thanks to their ingenious camouflage, they have thus far been able to hide Acahualla's industrialization from the agents of Sargon's rulers, even causing them to return to the court prior to the arrival of the first wave of Durins. This has led to Inam successfully receiving recognition as Acahualla's lord ameer, earning her equal standing with the other lords ameer who thirst for territory, population, and production capacity, and thus ensuring Acahualla's laws and principles remain intact, all while keeping Sargon's highest ranks oblivious to the changes that the territory has seen.\nIf both the surface Tiacauh and the underground Durins are able to live alongside each other peacefully, the status quo should last for a very long time. However, there is no going back to Zeruertza. The sudden surge in population will undoubtedly exhaust Acahualla's resources at a dramatic pace, and Eunectes's tribe has already benefited greatly from Durin technologies. In the long term, there is no way the changes that have occurred in Acahualla can stay hidden forever. There will come a day when they must confront these external pressures.\nIt's hard to say just how much thought Gavial had given the idea before she suggested the Durins evacuate to the surface, but she evidently understood the gravity and responsibility that the decision entailed. Otherwise, considering how rarely she does so, she would not have hesitated like she did when the Acahualla lord ameer candidacy was being decided. She is, after all, a member of Rhodes Island's Medical Department. She would be in quite a difficult position if she had to choose between her ideal of treating her patients and the future of Acahualla.\nIn her time of need, her friends stepped up and helped her out of her predicament, but that doesn't mean Gavial gave up on balancing the scales. She simply chose the most comfortable and suitable solution for both herself and Acahualla.\nIf anyone has any doubts about this conclusion, they can very well pay Acahualla a visit themselves and listen to its people sing Gavial's praises, gaze upon the monument in the center of Acahualla that's growing both larger and further from completion every day, and get a feel for themselves just how much unity Gavial's name can bring to Acahualla. And that's not even counting her own personal strength.\nIf Acahualla ever finds itself facing some kind of nigh insurmountable threat, Gavial will undoubtedly drop everything to return to her homeland and forge a new path, with her fists and battleaxe.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Urgent]\nTo Inam:\nI really think we should be building something more practical than monuments and statues with the stones we have, but you said the Tiacauh are clamoring too loudly for them, and I can understand. I wouldn't want to go against them either, if that's what they want.\nYou also said the Tiacauh held a vote, like the Durin, over the finer details, like how many people they are making statues for, what poses they would take, and whatnot. And even though they ended up brawling over everything anyway, that's still a step in the right direction.\nThat said!\nNo way will I accept them giving my statue a thick tail!\nI'll say this again. Even if those thick-tailers get their way in both the vote and the fight afterward, I am <i>not</i> signing off on a thick tail! This is a huge decision. You guys gotta at least take my feelings about being immortalized with a thick tail into account.\nMake sure you include the final decision over the statue's tail with the next letter. If the thick-tailers are still in the lead, I'm gonna have to take a vacation to come <i>persuade</i> everyone back in Acahualla!\nGavial",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 2179,
      "atk": 582,
      "def": 320,
      "magicResistance": 0,
      "blockCnt": 3,
      "baseAttackTime": 1.2,
      "respawnTime": 70,
      "cost": 24
    }
  },
  "skins": [
    {
      "skinId": "char_1026_gvial2#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_1026_gvial2",
      "portraitId": "char_1026_gvial2_1",
      "illustId": "illust_char_1026_gvial2_1",
      "modelName": "Gavial the Invincible",
      "drawerList": [
        "LLC"
      ],
      "description": "Worn by Gavial when she entered Zeruertza.\nThe medic's staff she carries, designed for combat, gets to be used in the role it was built for.",
      "rarity": -50
    },
    {
      "skinId": "char_1026_gvial2#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_1026_gvial2_2",
      "portraitId": "char_1026_gvial2_2",
      "illustId": "illust_char_1026_gvial2_2",
      "modelName": "Gavial the Invincible",
      "drawerList": [
        "LLC"
      ],
      "description": "She looks just like a wastelander!\nBut this is who Gavial truly is: wild and invincible.",
      "rarity": -10
    },
    {
      "skinId": "char_1026_gvial2@summer#12",
      "skinName": "Holiday HD26",
      "skinGroupName": "Coral Coast/XII",
      "skinGroupId": "2023#summer#2",
      "avatarId": "char_1026_gvial2_summer#12",
      "portraitId": "char_1026_gvial2_summer#12",
      "illustId": "illust_char_1026_gvial2_summer#12",
      "modelName": "Gavial the Invincible",
      "drawerList": [
        "SculLhunter"
      ],
      "description": "<color name=#000000>MARTHE [Coral Coast] Casual Vacation Series HD26. Comfortable, relaxed, breathable, and lightweight. Allows you to enjoy a perfect beach experience in absolute relaxation.</color>",
      "rarity": 90
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1325,
            "atk": 309,
            "def": 165,
            "magicResistance": 0,
            "cost": 20,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1699,
            "atk": 430,
            "def": 236,
            "magicResistance": 0,
            "cost": 20,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1699,
            "atk": 430,
            "def": 236,
            "magicResistance": 0,
            "cost": 22,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 2179,
            "atk": 582,
            "def": 320,
            "magicResistance": 0,
            "cost": 22,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3221",
          "count": 5,
          "type": "MATERIAL"
        },
        {
          "id": "30012",
          "count": 12,
          "type": "MATERIAL"
        },
        {
          "id": "30052",
          "count": 4,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 2179,
            "atk": 582,
            "def": 320,
            "magicResistance": 0,
            "cost": 24,
            "blockCnt": 3,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 2906,
            "atk": 766,
            "def": 391,
            "magicResistance": 0,
            "cost": 24,
            "blockCnt": 3,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3223",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30125",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "31014",
          "count": 6,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_gvial2_1",
      "skillName": "Precise Thrashing",
      "desc": "ATK <@ba.vup>+{atk:0%}</>, each attack restores HP to this unit equal to <@ba.vup>{heal_scale:0%}</> of the damage dealt",
      "iconId": "skchr_gvial2_1",
      "spCost": 25,
      "initSp": 10,
      "duration": 25,
      "blackboard": [
        {
          "key": "atk",
          "value": 0.8
        },
        {
          "key": "heal_scale",
          "value": 0.4
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31043",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 9,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_gvial2_2",
      "skillName": "Chainsaw Assault",
      "desc": "Attack Range <@ba.vup>expands</>, ATK <@ba.vup>+{atk:0%}</>, DEF <@ba.vup>+{def:0%}</>; When attacking unblocked enemies, pulls them towards this unit <@ba.vup>moderately</>",
      "iconId": "skchr_gvial2_2",
      "spCost": 35,
      "initSp": 25,
      "duration": 40,
      "blackboard": [
        {
          "key": "atk",
          "value": 1.8
        },
        {
          "key": "def",
          "value": 0.5
        },
        {
          "key": "block_cnt",
          "value": 0
        },
        {
          "key": "attack@force",
          "value": 1
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31013",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 9,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_gvial2_3",
      "skillName": "Soul of the Jungle",
      "desc": "ATK <@ba.vup>+{atk:0%}</>, ASPD <@ba.vup>+{attack_speed}</>, Block <@ba.vup>+{block_cnt}</>; While this skill is active, this unit only takes <@ba.vup>{damage_resistance:0%}</> of incoming damage, with the remaining amount dealt as HP loss over <@ba.vup>{final_duration}</> seconds after this skill ends",
      "iconId": "skchr_gvial2_3",
      "spCost": 35,
      "initSp": 25,
      "duration": 25,
      "blackboard": [
        {
          "key": "atk",
          "value": 1.4
        },
        {
          "key": "attack_speed",
          "value": 100
        },
        {
          "key": "damage_resistance",
          "value": 0.5
        },
        {
          "key": "final_duration",
          "value": 20
        },
        {
          "key": "interval",
          "value": 0.1
        },
        {
          "key": "priority",
          "value": 1000
        },
        {
          "key": "block_cnt",
          "value": 2
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30043",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 10,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_gvial2",
      "moduleName": "Gavial the Invincible's Badge",
      "desc": "Operator Gavial the Invincible has demonstrated a remarkable aptitude for swift and fierce enemy suppression in combat.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Guard Operator during field operations to exercise Centurion responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_gvial2",
      "moduleName": "The Binding of Gavial",
      "desc": "Torches crackle softly in the low wooden hut. A gust of wind whistles through the cracks in the boards. A few shadows gently sway.\n'Come in.'\nThe hut door is hefted open, and a mass of somewhat hasty green squeezes into the firelit space, having to get far more intimate with the doorframe than doorframes typically experience.\n'Got everything?'\n'Y—You bet...' Gavial gives her head an impromptu massage.\n'Bring it out.'\nGavial hoists her tail back to bundle up the bag behind her, and takes great care to open it up on the table. Out fall a wide assortment of weapons. Those standing around the table grab one each.\n'Dagger.'\n'Cutting edge is sharp. Signs of whetstoning.'\nAnother voice makes itself known. Gavial twists her head around looking for it, only to quickly give up and pull it back.\n'Chainsaw.'\n'No junk in the chain, lubrication on drive shaft is fresh, and handle wraps have been changed before. Motor system is running well, power system is stable.'\n'Uh-huh. The axe?'\n'About the same condition as the chainsaw. The only difference is the axe has some slight rusting...'\n'Don't mind her. The metal was rusted when I made it.' Yet another voice has emerged.\n'...Didn't you tell me you used the best materials?'\n'Those <i>are</i> the best materials. Even the 'Rage Ironhide' didn't get it as good as this.'\n'Quit it a sec, you two, we're not done yet... Gavial.'\n'Here...'\n'Where's your staff?'\n'Muhh, my staff...' Gavial hangs her head low.\n'Where is your staff? Bring it out.'\nGavial realizes she's not winning this, grinds her teeth, and pulls her staff out of her boot. Well, boots.\n'Staff's... broken.'\n'How did you break it?'\n'Clobbering people out there over the last few days. I just gave it a whack once and... it snapped.'\n'How? You know I reinforced it. All you had to do was take good care of it and... Gavial, give me the inspection form. Have you filled it in properly?'\n'No duh I did!'\n'What were you doing last month on the 3rd? You were meant to give it maintenance that day, but you've written nothing here. Did you forget?'\n'Did not. I was, uh, I was busy that day with... oh! No, I got it! I was scrapping with the Durins' machines! You even gave them the blueprints for those!'\n'I do recall that, but it doesn't change the fact you wrecked your staff, so...'\nGavial sucks in a deep, deep breath. 'So like you laid out. Five days without eating meat. I'm ready for it...'\nAfter a brief silence, with the table shooting a few glances between each other, there's the sudden telltale 'pfft' of a laugh.\n'What the hell's so funny... Tomimi? Zumama? Inam! What are you guys laughing for?' Gavial asks through a frown of complete suspicion.\nInam is scratching at her head. 'Gavial, the fact that you can take proper care of your weapons is <i>impressive.</i> I wonder if we can thank the statue being erected...'\n'I literally guaranteed you guys! You didn't even believe me?!'\n'We're only finding out in the first place because people tell us you keep complaining about weapon upkeep being a hassle,' Zumama explains.\n'We wouldn't let you go without meat for five days, Gavial... that would be too scary for you,' Tomimi quietly adds.\nGavial sighs a slow sigh of relief. 'Scared the hell outta me. I seriously thought you guys were gonna have me lashed down...'\n'I'll make you another staff. Remember to care for it regularly!'\n'Yeah, you don't have to tell me... huh? Something smells good. Is that—'\n'That said, seeing how we know you, we decided we'd punish you via other means... This is a whole pot of Acahualla-sourced meat stew!' Inam unveils. 'Gavial, you have to stand over there and watch us while we eat the entire thing.'\nGavial's eyes pop out of her skull. 'You guys are torturers! ACTUAL TORTURERS!'"
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "Doctor, got any trouble for me to handle? What? Just haul these files for you?",
      "voiceAsset": "char_1026_gvial2/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "I gotta hand it to her, Doctor, this axe Zumama made for me turned out great, but I've already got this muscle memory from whacking enemies with my staff. See, still carrying it with me. I'm here to save people, after all, not beat 'em up. Gotta work that out.",
      "voiceAsset": "char_1026_gvial2/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Doctor, check it out. Getting extra weapons' kind a juggling act, so I found a solution. Trained my tail a little, and now, I can use it to hold my staff. Only downside is—I think my tail got thicker after all that exercise.",
      "voiceAsset": "char_1026_gvial2/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "How's that, Doctor? Shoulders feel much better, right? I told you, controlling my strength's a piece of cake, it's just none of you wanna believe me. I've been practicing medicine as a pro for years now. It's about time you recognized the fact, don’t you think?",
      "voiceAsset": "char_1026_gvial2/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "Oh, right, Doctor, it’s been a while since your last trip to Acahualla, right? Join me next time I visit my home, if you can spare the time. They told me it's a party there now. Even I'm wondering what my home's gonna be like when I visit again.",
      "voiceAsset": "char_1026_gvial2/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "Doctor, you know there's times you can trust your intuition. You've got all these Operators who trust you, see. Even with your eyes closed, your fists are still real strong—What? Compared to mine? Hey... I could K.O. you before you even made it out of this office, so I'm the stronger one there!",
      "voiceAsset": "char_1026_gvial2/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Zumama can build machines, Tomimi can manage people, and Inam's a damn-good lord ameer... Man, my friends rule! But my medical skills aren't bad either! Huh? What do you mean that's the one thing they’d argue?",
      "voiceAsset": "char_1026_gvial2/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Y'know, Doctor, I never understood why you made everything so complicated all the time. But now, I kinda get it, in a small sorta way. To put it in plaintalk, you're just finding ways to get bigger fists. So let me get real here, Doc. It's time you worked out with me.",
      "voiceAsset": "char_1026_gvial2/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "Zumama was right. All I gotta do is think about how to get stronger, and how to throw my fists. So I've got an extremely serious question to ask you, Doctor... If I get Zumama to build us a two-seater Raging Ironhide, do you wanna ride driver-side or passenger?",
      "voiceAsset": "char_1026_gvial2/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Alright, how should I wake the Doc up...?",
      "voiceAsset": "char_1026_gvial2/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Hold on, Doctor, I know what you wanna ask, and my files are still up in Medical. But, y'know, Dr. Kal'tsit's got a point. Doesn't reflect well on Medical to have a physician steamrolling around the front lines, so from now on, this is how I'm heading out.",
      "voiceAsset": "char_1026_gvial2/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "There... wouldn't a quick axe chop do the job?!",
      "voiceAsset": "char_1026_gvial2/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "*sigh* Just doesn't give me the same kick I get being endorsed for my medical skills...",
      "voiceAsset": "char_1026_gvial2/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "Doctor, doesn't matter if I've got an axe or staff in hand, I'm just hoping to accomplish a little something, make everyone's lives a little bit happier. I've managed to do a bunch so far, and before my body gives out on me here, I'm gonna do more.",
      "voiceAsset": "char_1026_gvial2/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Leave the front to me. The rear's all yours!",
      "voiceAsset": "char_1026_gvial2/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "You get to follow me under one condition—you all stay alive and well. Got it?",
      "voiceAsset": "char_1026_gvial2/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Let's go! Oh, speaking of which, what was our objective again?",
      "voiceAsset": "char_1026_gvial2/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Alright, guys! Let's make some noise!",
      "voiceAsset": "char_1026_gvial2/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Doctor, leave the big guys to me!",
      "voiceAsset": "char_1026_gvial2/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "I'll charge the weak spots!",
      "voiceAsset": "char_1026_gvial2/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Fear not, here I come!",
      "voiceAsset": "char_1026_gvial2/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "I'll take the lead! The rest is up to you guys!",
      "voiceAsset": "char_1026_gvial2/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Relax, it'll be over in an instant.",
      "voiceAsset": "char_1026_gvial2/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Face me!",
      "voiceAsset": "char_1026_gvial2/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Who's next?!",
      "voiceAsset": "char_1026_gvial2/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Ha! Kick ass!",
      "voiceAsset": "char_1026_gvial2/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Uh... might be kind of weird to say at this point, Doctor, but nailing down a tough mission on nothing but trust for others—that's pretty damn neat.",
      "voiceAsset": "char_1026_gvial2/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Everybody good? We've got another battle waiting for us. Pump yourselves up! We're gonna crush this mission together!",
      "voiceAsset": "char_1026_gvial2/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "No rush. Doesn't matter if we're chasing 'em down or watching for a counterattack, just leave it to me. I want anyone who needs it to rest up!",
      "voiceAsset": "char_1026_gvial2/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Doctor, hold on tight to my shoulders! Don't go blaming me if you fall off.",
      "voiceAsset": "char_1026_gvial2/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "I guess I'll drop in at Medical before the mission.",
      "voiceAsset": "char_1026_gvial2/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "What's the rush, Doc? Not like I'm gonna run away.",
      "voiceAsset": "char_1026_gvial2/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "You look pretty free to me, Doctor. Just so happens I am too. Wanna take a walk?",
      "voiceAsset": "char_1026_gvial2/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_1026_gvial2/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Happy New Year to you, Doctor. Oh yeah, you heard, right? Me and Zumama are gonna prep an Acahualla-style New Year's feast. We've done it your way, I think it's about time you saw how we Tiacauh do a festival. You're gonna come, right?",
      "voiceAsset": "char_1026_gvial2/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Doctor! ...Oops, my bad. Didn't bruise you, did I?",
      "voiceAsset": "char_1026_gvial2/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "So it's your birthday again, Doctor. Craziest day of the year aboard Rhodes Island, apart from New Year's. Seriously, Rhodes Islanders are taking some hell of a shine to you. Here, a present from me. Also, I'm watching you, same as always. You're not doing a second of work today.",
      "voiceAsset": "char_1026_gvial2/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "We don't need to exchange any sappy words here, do we, Doctor? I'm Gavial, the medic-slash-warrior of Rhodes Island. Where there's people with Oripathy, I'm there. It's that simple, isn't it?",
      "voiceAsset": "char_1026_gvial2/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "train_spd&profession2[020]",
      "buffName": "Guard Expert α",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, <@cc.kw>Guard</> Operators' Specialization training speed <@cc.vup>+30%</>",
      "skillIcon": "bskill_train_guard1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "train_spd&profession2[620]",
      "buffName": "Practical Instruction",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, <@cc.kw>Guard</> Operators' Specialization training speed <@cc.vup>+30%</>; if training this skill to Specialization Level <@cc.vup>3</>, training speed will be further increased by <@cc.vup>+65%</>",
      "skillIcon": "bskill_train3_guard2",
      "phase": "PHASE_2",
      "level": 1
    },
    {
      "buffId": "train_cost&profession[320]",
      "buffName": "Excessive Training",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, Morale consumed per hour is increased by <@cc.vdown>+1</> when training a <@cc.kw>Guard</> Operator's skill to Specialization Level <@cc.vup>3</>",
      "skillIcon": "bskill_train_gavial",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}