{
  "id": "char_4026_vulpis",
  "meta_info": {
    "name": "Vulpisfoglia",
    "appellation": " ",
    "voiceActor": {
      "en": "Chiara Preziosi",
      "jp": "Kotono Mitsuishi",
      "kr": "Jeon Hae-ri",
      "cn": "Miaoer Jin"
    },
    "rarity": 6,
    "profession": "Vanguard",
    "subProfessionId": "Pioneer",
    "position": "MELEE",
    "team": "",
    "tagList": [
      "DP-Recovery",
      "DPS"
    ],
    "nationId": "Siracusa",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Vulpisfoglia\n[Gender] Female\n[Combat Experience] 25 Years\n[Place of Birth] Siracusa\n[Date of Birth] Sep 8\n[Race] Vulpo\n[Height] 161cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Excellent\n[Mobility] Excellent\n[Physical Resilience] Standard\n[Tactical Acumen] Standard\n[Combat Skill] Outstanding\n[Originium Arts Assimilation] Standard",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Ingrid, mother of Operator Suzuran, and former core member of Famiglia Venezia—one of the Dodici Famiglie of Siracusa. A veteran assassin who excels in elimination and raid missions, she has separated herself from her famiglia for various reasons. Now works on the Rhodes Island landship as an operator under the codename Vulpisfoglia.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Vulpisfoglia shows no signs of Originium infection.\n\n[Blood Originium-Crystal Density] 0.13u/L\nOperator Vulpisfoglia rarely comes into contact with Originium, but is quite familiar with Oripathy prevention and treatment methods, and has some experience with taking care of Oripathy patients.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Over the last few years while Operator Suzuran has been receiving treatment on Rhodes Island, Ingrid and a Higashinese priest have visited the landship a few times to see her. The priest is always the one asking us how his daughter is doing, in terms of both health and studies, while Ingrid stands at the side, occasionally asking abrupt questions about the landship's defenses and how dangerous the field missions are. This has left HR with a profound, albeit limited, understanding of her, but also given them an easy job when deciding what to write on her record—'Siracusan, famiglia assassin, doesn't seem friendly.'\nThis time she has come to Rhodes Island on her own, and after she applied to stay on the landship, we began to supplement her files with more information. This went smoothly, and we discovered that 'Ingrid' is an infamous name in Siracusa: As a core member of Famiglia Venezia, she left no less than 27 separate homicide case files in the courts of every region she visited while the famiglia was expanding their territory. At least ten famiglie have offered a bounty for her head, and half of them have yet to expire even today. 'A Vulpo even more ruthless than a wolf', is how she's fearfully described among Siracusan famiglie.\nOf course, considering Siracusa's political situation and the identities of those who have died at her hands, her past is not at all incomprehensible, and will not meaningfully affect Rhodes Island. After consulting Dr. Kal'tsit, we approved her application to stay aboard the landship. The final confirmation step also went smoothly, and the operators who went looking for her came back to HR shortly after. According to them, they had brought a large file of sorted information for her, but the other party just nodded to confirm her application, and only mentioned a small request: to erase the 'Venezia' surname from her file. She even gave each HR Operator an exquisite present before she left, and said with a smile: 'As thanks for taking care of Lisa, and also for your hard work collecting those documents.'\n\n'Ingrid doesn't seem that unfriendly.'\n'Hey now. Didn't you hear the implied threat underlining her second sentence?'\n'Don't jump to conclusions. Don't you remember her smile?\n'Exactly, remember that smile...'",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "As Ingrid spent more and more time on the landship, we got to know each other better. A few interest groups invited her to their gatherings, but were surprised when she gladly accepted, only to miss almost every single one—because she was always late. She missed a few consecutive wine tasting sessions, only languidly arriving at the venue when the event was almost over, and embarrassingly pleading the organizer to extend it by one more hour. We find it truly hard to imagine how she has no sense of time while also somewhat lacking in patience.\nShe once again surpassed our understanding of her when she began participating in Rhodes Island's combat drills and field missions under the code name 'Vulpisfoglia'. Operators who were with her would nearly always mention feeling a great pressure, not because she was once a Siracusan famiglia assassin, has an unsociable personality, or uses cruel methods, but because her... impressive ability to execute every task with utmost precision left everyone somewhat dumbfounded. She always completes every objective in a mission exactly as stated, and even a placeholder objective accidentally left unrevised as 'I hope the target can be knocked over by an object thrown from up high, right as the new day comes in, for a most satisfactory result' was realized perfectly. Unlike how she acts on the landship, she seemed to have suddenly gained an almost obsessive-compulsive or perfectionist obsession with the finest of details.\nThe sharp contrast stunned everyone, but someone finally plucked the courage to ask her about this gap in behavior. She simply frowned and said: 'Did you <i>want</i> me to slack off while working?'\n\n[Supplementary Note]\nI was sorting through the operator's files when I flipped to a Siracusan court case with records of what Ingrid said when she was answering the judge as a defendant. Perhaps it can explain her 'extreme separation of work and life' and her 'OCD' tendencies in battle:\nSome die as a warning to others, while some die in a way that cannot be remembered. How should someone undeserving of death die, or someone who <i>should</i> die, go? Your Honor, technical work must always be executed with utmost care.'",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "I imposed a strict ban on curious operators discussing Operator Suzuran's family composition, until I bumped into Suzuran and Ingrid myself, chatting on the landship bridge, and they stopped to greet me at the same time. They were just so alike in appearance and stature, as if they were carved from the same mold, but their temperaments were like night and day. I confess this was somewhat rude of me, but I honestly couldn't help wondering how a Siracusan assassin and a Higashinese kannushi met and formed ties.\nMany stories quickly flashed through my mind, like a tale of a cold killer who, under orders to kill the shrine's master, traveled from Siracusa to Higashi, but her long blade shatters a bugaku mask to reveal the kannushi's clear eyes, stopping them both in their tracks as if entranced. Or another tale, of a gentle kannushi visiting the foot of a mountain for an event, but finding a Siracusan assassin leaning against a maple tree on a corner of his path, who—having fled a bloody battle and made it all the way to a foreign land—was now bleeding out, and the kannushi tenderly crouching down to check on her. By the time I came back to my senses, I realized I had already involuntarily opened my mouth to ask: 'Excuse me...'\nBe it as a colleague or an HR operator, my actions were extremely inappropriate, but surprisingly they were not angry at me. On the contrary, Suzuran generously answered my question in a simple manner. She described her father meeting her mother as purely coincidence:\nAn armed force had infiltrated the area around the shrine where Suzuran's father works, and frequently caused trouble. Her father resolved to confront them alone at their stronghold to protect the innocent masses, and was on his way to the final negotiation. At the foot of the mountain, he passed by a foreign lady with a scar on her right cheek wearing a large coat. When he arrived at their stronghold, the boss was already dead in the snow, and everyone else left had already fled. A week later, the priest had gone into the city in civilian clothes to buy some chikuwa for a certain 'god' he serves, and went to the stall he usually frequented, only to see the same woman from before buying the last two sticks. He politely asked her to sell him one, and the cruel-seeming woman turned around, and gave him a stick with a smile. He bowed and thanked her for the chikuwa stick, as well as for their second meeting... and then everything else happened as it should.\n\nIndeed, a truly normal tale. In fact, the meeting of two people from different countries, backgrounds, and personalities is precious in itself, but the choices and efforts they made afterwards—challenging the shrine taboos, ignoring the famiglia rules, and raising a child both parties have invested unfathomable emotions and expectations in—are far more worthy of respect, and have nothing to do with how strange their initial encounter may have been. I bid the two goodbye, and then Ingrid, who had been silent the whole conversation, smiled and stopped me in my tracks with this:\n'As I recall, you'll be joining us in our special resistance training drill later this afternoon, yes?'",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Special Letter Correspondence 03]\nSender: Fabrizio Venezia (verified as the current don of Siracusa's Famiglia Venezia)\nRecipient: Rhodes Island Procurement Department\nContent: My granddaughter Lisa has always been undergoing Oripathy treatment with your company, and recently her mother Ingrid has also gone to your company as well, so I hope to sponsor your research on Oripathy diagnosis and treatment in the name of Venezia Trucking Co..\nResponse: We specifically asked Ingrid about this, and based on her attitude have made the following reply:\n'Thank you for your interest in Rhodes Island, but we cannot consider your offer due to inaccurate information provided.'\n\n[Special Letter Correspondence 07]\nSender: Nuova Volsinii branch office, Penance\nRecipient: Rhodes Island Landship\nContent: Operator Penance has routinely synchronized with us on mission reports and official correspondence, which included an arrest warrant issued by the Police Department of Nuova Volsnii for Ingrid on the grounds of committing premeditated injury.\nResponse: We informed Ingrid about this, and surprisingly, unlike the usual famiglia member attitude towards the law, she acknowledged the warrant was real.\n\n[Classified Log]\nI'm not running or looking for a sanctuary, Doctor. Of course, I'm not going back either. There are too many 'laws' on this land, so why care about them all?\n...Yes, Siracusan famiglie do not need a valid reason to end someone's life. Or rather, the usual reasons not to, like 'decency' or 'hoping everyone gets a good ending'... often hold no water there, which is why I chose to leave. But I won't take off this suit, because it's comfortable to wear; I won't abandon this blade, because it's easy to wield. It's just that Lisa doesn't need me to worry over her anymore, and her papa can solve his own problems and won't need my help for the time being. So I can indeed afford a short vacation. You're right, an assassin taking a vacation isn't a bad thing. For her, or for everyone else.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'Orchid, was that Ingrid just now?'\n'Yes. She wanted to borrow and needle and some thread to repair something on her own.'\n'What was it?'\n'The omamori hanging on her waist. She said it was accidentally punctured in Nuova Volsinii... I suppose it's important to her.'\n'What's inside it? Hehe, I'm just curious...'\n'It's empty.'\n'Empty?'\n'Maybe it had something inside before, and it got lost when it was struck open. Why so surprised? Someone like her surely knows what's important or not. Her hands were clumsy, but she mended it in one go, tied off the thread and got up to leave, stylish as ever.'",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1481,
      "atk": 460,
      "def": 304,
      "magicResistance": 0,
      "blockCnt": 2,
      "baseAttackTime": 1.05,
      "respawnTime": 70,
      "cost": 14
    }
  },
  "skins": [
    {
      "skinId": "char_4026_vulpis#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_4026_vulpis",
      "portraitId": "char_4026_vulpis_1",
      "illustId": "illust_char_4026_vulpis_1",
      "modelName": "Vulpisfoglia",
      "drawerList": [
        "轟将"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_4026_vulpis#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_4026_vulpis_2",
      "portraitId": "char_4026_vulpis_2",
      "illustId": "illust_char_4026_vulpis_2",
      "modelName": "Vulpisfoglia",
      "drawerList": [
        "轟将"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 821,
            "atk": 231,
            "def": 152,
            "magicResistance": 0,
            "cost": 12,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.05,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1081,
            "atk": 335,
            "def": 224,
            "magicResistance": 0,
            "cost": 12,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.05,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1081,
            "atk": 335,
            "def": 224,
            "magicResistance": 0,
            "cost": 14,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.05,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1481,
            "atk": 460,
            "def": 304,
            "magicResistance": 0,
            "cost": 14,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.05,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3211",
          "count": 5,
          "type": "MATERIAL",
          "name": "Vanguard Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_PIO1"
        },
        {
          "id": "30032",
          "count": 10,
          "type": "MATERIAL",
          "name": "Polyester",
          "rarity": 2,
          "iconId": "MTL_SL_RUSH2"
        },
        {
          "id": "30052",
          "count": 3,
          "type": "MATERIAL",
          "name": "Polyketon",
          "rarity": 2,
          "iconId": "MTL_SL_KETONE2"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1481,
            "atk": 460,
            "def": 304,
            "magicResistance": 0,
            "cost": 14,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.05,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 2030,
            "atk": 562,
            "def": 380,
            "magicResistance": 0,
            "cost": 14,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.05,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3213",
          "count": 4,
          "type": "MATERIAL",
          "name": "Vanguard Dualchip",
          "rarity": 5,
          "iconId": "MTL_ASC_PIO3"
        },
        {
          "id": "30155",
          "count": 4,
          "type": "MATERIAL",
          "name": "Nucleic Crystal Sinter",
          "rarity": 5,
          "iconId": "MTL_SL_SHJ"
        },
        {
          "id": "31084",
          "count": 2,
          "type": "MATERIAL",
          "name": "Cyclicene Prefab",
          "rarity": 4,
          "iconId": "MTL_SL_HTT"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_vulpis_1",
      "skillName": "Discreet Discipline",
      "desc": "The next attack deals an additional <@ba.vup>{extra_damage_ratio:0%}</> ATK as Arts damage, and gains <@ba.vup>{cost}</> DP\n<@ba.rem>Can store {ct} charges</>",
      "iconId": "skchr_vulpis_1",
      "spCost": 4,
      "initSp": 8,
      "duration": 0,
      "blackboard": [
        {
          "key": "cost",
          "value": 1
        },
        {
          "key": "extra_damage_ratio",
          "value": 2.9
        },
        {
          "key": "ct",
          "value": 3
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31083",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31064",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31074",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_vulpis_2",
      "skillName": "Damoclean Interrogation",
      "desc": "Immediately gains <@ba.vup>{cost}</> DP, deals <@ba.vup>{atk_scale:0%}</> ATK as Arts damage to up to 6 surrounding enemies and <$ba.sluggish>Slows</> them for <@ba.vup>{sluggish}</>s; if an enemy is already <$ba.sluggish>Slowed</>, then <$ba.stun>Stuns</> them for <@ba.vup>{stun}</>s\n<@ba.rem>Can store {ct} charges</>",
      "iconId": "skchr_vulpis_2",
      "spCost": 20,
      "initSp": 20,
      "duration": 0,
      "blackboard": [
        {
          "key": "max_target",
          "value": 6
        },
        {
          "key": "atk_scale",
          "value": 3
        },
        {
          "key": "cost",
          "value": 7
        },
        {
          "key": "sluggish",
          "value": 5
        },
        {
          "key": "stun",
          "value": 5
        },
        {
          "key": "ct",
          "value": 2
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31084",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30083",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_vulpis_3",
      "skillName": "La Volpe Nascosta",
      "desc": "When skill is activated, gains <@ba.vup>{cost}</> DP immediately, Attack Range <@ba.vup>+1</>, ATK <@ba.vup>+{atk:0%}</>, ASPD gradually reduces from <@ba.vup>+{attack_speed}</> to +0; attacks all blocked enemies and each attack can <$ba.stun>Stun</> the enemy for <@ba.vup>{attack@stun}</>s\n<@ba.rem>If an enemy is defeated with this skill, the operator gains Camouflage when the skill ends. The Camouflage lasts until the next time this skill is activated</>",
      "iconId": "skchr_vulpis_3",
      "spCost": 18,
      "initSp": 10,
      "duration": 10,
      "blackboard": [
        {
          "key": "cost",
          "value": 9
        },
        {
          "key": "atk",
          "value": 1.1
        },
        {
          "key": "attack_speed",
          "value": 180
        },
        {
          "key": "attack@stun",
          "value": 0.2
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31073",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30155",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 2,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_vulpis",
      "moduleName": "Vulpisfoglia's Badge",
      "desc": "Operator Vulpisfoglia has demonstrated a remarkable aptitude for preemptive penetration of the battlefield situation and active offense so as to secure leeway for deployment.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall hereby be appointed a Vanguard Operator during field operations to exercise Pioneer responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_vulpis",
      "moduleName": "Patience, Mission, Vacation",
      "desc": "Ingrid observes the young man's face, blood dripping through his hair and down the nape of his neck like some wretched tattoo.\n'Help me,' he begs, as if he's forgotten that he tried to fling a dagger at this very lady just a day ago.\nIngrid's gaze shifts past his shoulders, landing on the smoking vehicle in the distance. <i>Oh,</i> she thinks, <i>so they caught up to him after all.</i>\nHis story was of failing to enact his vendetta against Ingrid, then running into his own foes on the way back for good measure. All too common a story. Revenge is a wolf snapping at its own tail.\n'Help me.' He's still asking?\nWho would help an enemy? What, just because she pardoned him once before? But those thoughts don't bother Ingrid for too long, for then she answers.\n'Sorry, I don't do this kind of thing anymore.'\nShe tosses a dagger to the ground—the very same one her personal avenger left her yesterday. It's not her concern whether he still has the strength to pick it up, or whose heart he'll elect to aim it at.\nShe turns, and steps into her Rhodes Island dorm room. The Logistics op outside reminds her that the physio appointment she booked starts in fifteen minutes. Through the porthole, she peers out into the barrens, the dagger she tossed down now six hours in the past. Who knows if that young man ever escaped the wheels of hostility after him.\nThere's an unfinished jigsaw puzzle on her dorm table. A present. Now and then, Lisa comes by to chat while casually putting a couple of pieces in place.\nShe carefully examines the part of the image that's already formed. An everyday landscape, an undulating horizon; one could imagine the outline of buildings, mountains, forests. Despite not having pieced a single row together herself, it's already complete—at least in her mind.\nIt's not for lack of patience; it's just never much excited her when the start of something can give away the full picture. As if examining herself, she picks up a jigsaw piece, and places it right in the heart of a vast swathe of blank.\n'That's where it belongs,' she says to herself. She doesn't even need to look for the pieces around it; she's more than sure, as if she's secretly completed this puzzle countless times before.\nPlacing that lone little piece at the center, she can almost picture a wolf circling it chasing its own tail, round and round and round, in endless joy.\nWith a shake of her head and a flick of her finger, she sends the piece flying off the table.\n'I shouldn't be having thoughts like these on vacation.'\nShe heads out of her dorm. Is it time for her physio appointment yet? Whatever the case, a killer on holiday can make as luxurious use of her time as she wants."
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "Have someone else handle the paperwork and filing. But if you need anyone dealt with, or protected, just give me the list of names. I'll take care of them.",
      "voiceAsset": "char_4026_vulpis/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "These are clothes and snacks for Lisa, along with gifts for her friends. As for this box of old books her papa insisted I bring, I'm not sure what they're for. I'll just let Lisa decide what to do with them.",
      "voiceAsset": "char_4026_vulpis/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Uniform? No, thanks. I don't know why you people need so many pockets. Just as I can't grasp why the Higashinese stuff planks and pillows in their waistbands, making it so terribly hard to move around… Anyway, I'm fine with this outfit, and it has nothing to do with me being Siracusan.",
      "voiceAsset": "char_4026_vulpis/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Some of the operators here have unsteady breathing. Perhaps they could try reciting a tanka or two to adjust their breaths as they strike, like: 'Solitude seeps not from autumn shade, but from the mountain pines in red sun's fall.' Or 'I bear no off'ring branch unto the hills, for rich brocades of maple sate the gods.' You think these lines evoke a particular image? Hm. Probably.",
      "voiceAsset": "char_4026_vulpis/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "No need to hide the Wolumonde story from me. Hm, you look nervous, but I'm not here to cast blame, my daughter knows the meaning of her work. <i>Suzuran</i> is no fragile flower, and I am no hidebound gardener.",
      "voiceAsset": "char_4026_vulpis/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "My return trip to Siracusa? The perpetrator is dead, so there is little else to say. The man who, in his lust for power, deprived so many of a decent life, did not deserve a decent death.",
      "voiceAsset": "char_4026_vulpis/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Lost in thought? Is something wrong? Hm, some business less suited to a so-called <i>pharmaceutical company</i>, is it? If you need my help, do speak clearly now. You see, Doctor, I have only the patience to manage this single braid.",
      "voiceAsset": "char_4026_vulpis/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "The wine tasting is already finished? I went to freshen up and hurried back as quickly as I could... Ah, sorry, but my work demands it. You see, precision is everything. I must be meticulous about which bastard die at which moment, not a second sooner. Hehe, but we don't need to pick a time for whiskey. Care to stay a while longer?",
      "voiceAsset": "char_4026_vulpis/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "So much snow on the deck, and yet the corridors are not cold. I detest inconsistent weather, so the landship has been a blessing. I only just realized how long I've been here. You're right, an assassin's vacation is a good thing, for herself, and others.",
      "voiceAsset": "char_4026_vulpis/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "I'll stay here, just call me if you need something. Hard to believe? Sometimes, I can be very patient, Doctor. Have you ever tried combing nineteen tails in one go?",
      "voiceAsset": "char_4026_vulpis/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Hello. You must be 'the incredible Doctor' Lisa always mentions in her letters. Hmm, I've been curious to know what you looked like, and here you are. Which reminds me, could you update me on Lisa's studies, if you have the time?",
      "voiceAsset": "char_4026_vulpis/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "It's not often I see recordings of myself. I fought my battles in quiet alleyways, with no witnesses.",
      "voiceAsset": "char_4026_vulpis/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "I appreciate the recognition. But this means those after the bounty on my head will come looking for Rhodes Island. You are not worried?",
      "voiceAsset": "char_4026_vulpis/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "I accept your medal, Doctor. You needn't say more. I do know the difference between this medal, and the emblems of the Siracusan family.",
      "voiceAsset": "char_4026_vulpis/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Leave the toughest one for me.",
      "voiceAsset": "char_4026_vulpis/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Just keep yourselves safe, ladies and gentlemen.",
      "voiceAsset": "char_4026_vulpis/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "My ears are sharp, so when I stop, you stop.",
      "voiceAsset": "char_4026_vulpis/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Need to parley with them? But I rarely do such things, whether I'm in Siracusa or Higashi.",
      "voiceAsset": "char_4026_vulpis/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "I'm all ears.",
      "voiceAsset": "char_4026_vulpis/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "So much negotiation and we end up talking with our blades.",
      "voiceAsset": "char_4026_vulpis/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Splendid day today.",
      "voiceAsset": "char_4026_vulpis/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Beautiful place.",
      "voiceAsset": "char_4026_vulpis/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Hate and resentment have no place, but in a burst of autumn red.",
      "voiceAsset": "char_4026_vulpis/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Flowers imbibed, the lady in suit and tie dance with her blade.",
      "voiceAsset": "char_4026_vulpis/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "At least make me lose the coat.",
      "voiceAsset": "char_4026_vulpis/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Why the rush? The road to the afterlife is crowded enough.",
      "voiceAsset": "char_4026_vulpis/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Higashinese shoji screens often run a common theme. The kami created life and land to propagate themselves… A pity they didn't care for what came after. Sorting out this mess is hard work.",
      "voiceAsset": "char_4026_vulpis/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "There's nothing to clean up. Let's go.",
      "voiceAsset": "char_4026_vulpis/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Crawling out of the swamp is hard enough, never mind doing it gracefully.",
      "voiceAsset": "char_4026_vulpis/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Leave the rest to me... it's clear why we failed, and I know how to make it even.",
      "voiceAsset": "char_4026_vulpis/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "The soundproofing of this place is excellent. Was it done for professional reasons?",
      "voiceAsset": "char_4026_vulpis/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Hehe, even Lisa has grown out of this by now.",
      "voiceAsset": "char_4026_vulpis/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "The scar on my face? I wasn't born with it... Let's just leave it at that.",
      "voiceAsset": "char_4026_vulpis/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_4026_vulpis/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Happy New Year. What a wonderful gathering. Dancing, chatting, making noise just for fun, instead of drowning out a struggle. Hmm… Lisa's making her way here, Doctor. That was sake in my cup and not a double whiskey shot, understand?",
      "voiceAsset": "char_4026_vulpis/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Hello, Doctor... Hehe, I can hear your footsteps even with my ears folded.",
      "voiceAsset": "char_4026_vulpis/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Happy Birthday, Doctor. Lisa's papa asked me to give you this omamori. He hopes to visit you in person, if given the chance. As for me, I offer a promise: my blade is yours whenever you need it.",
      "voiceAsset": "char_4026_vulpis/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "I first contacted Rhodes Island because it was the best place to treat Lisa. But now, I would send her here to learn, even if she were perfectly healthy. Do not let this landship ever stop, Doctor, not after it has been sailing for so long.",
      "voiceAsset": "char_4026_vulpis/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "meet_spd[1000]",
      "buffName": "Clue Search α",
      "desc": "When this Operator is assigned to the Reception Room, Clue search speed increases by <@cc.vup>10%</>",
      "skillIcon": "bskill_meet_spd1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "meet_spd[1010]",
      "buffName": "Clue Search β",
      "desc": "When this Operator is assigned to the Reception Room, Clue search speed increases by <@cc.vup>20%</>",
      "skillIcon": "bskill_meet_spd2",
      "phase": "PHASE_2",
      "level": 1
    },
    {
      "buffId": "meet_spd&bd[100]",
      "buffName": "Assassin's Holiday",
      "desc": "When this Operator is assigned to the Reception room together with <@cc.kw>Suzuran</>, increases Clue search speed by an additional <@cc.vup>30%</>",
      "skillIcon": "bskill_meet_spd&bd2",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}