{
  "id": "char_197_poca",
  "meta_info": {
    "name": "Rosa",
    "appellation": "Роса",
    "voiceActor": {
      "en": "Elizabeth Maxwell",
      "jp": "Reina Ueda",
      "kr": "Choi Ha-ri",
      "cn": "Zhiqiu Ye"
    },
    "rarity": 6,
    "profession": "Sniper",
    "subProfessionId": "Besieger",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "DPS",
      "Crowd-Control"
    ],
    "nationId": "Ursus",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Rosa\n[Gender] Female\n[Combat Experience] None\n[Place of Birth] Ursus\n[Date of Birth] Oct 31\n[Race] Ursus\n[Height] 174cm\n[Infection Status] \nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Standard\n[Mobility] Normal\n[Physical Resilience] Standard\n[Tactical Acumen] Excellent\n[Combat Skill] Standard\n[Originium Arts Assimilation] Standard",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Prior to the Chernobog incident, Rosa attended a middle school in Chernobog City and served as the student council president. \nShe joined Rhodes Island after the incident, and developed a very good reputation while working for the Logistics Department. She has now applied to be transferred to the front lines as a sniper operator.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected. \n\n[Cell-Originium Assimilation] 0%\nOperator Rosa has no signs of Originium infections. \n\n[Blood Originium-Crystal Density] 0.15u/L\nOperator Rosa may have had very little exposure to Originium in the past, but is likely to have had significant exposure throughout the Chernobog incident due to the state of the entire city following the Catastrophe. While no symptoms are present as of yet, this indicator is abnormally high and calls for continued follow-up observation.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "A young lady from a pure pedigree of nobles fallen from grace. \nShe quickly integrated into life at Rhodes Island, and is largely indifferent to the question of one's status. She is simply viewed as a polite young lady in the eyes of most operators. \nWhether in work or in leisure, she displays maturity well beyond her years.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "At one point, the once-great nobles could rely on their bloodline to ensure their stable prosperity. After entering the modern era, however, their status has been challenged by emerging business and political elites. \nIn some countries such as Columbia, the status of a well-known business is roughly equivalent to the entire lifeblood of another country, and a lesser noble is certainly not as wealthy as the general manager of a Columbian company. Many nobles who saw the writing on the walls have been trying to convert their land and retainers into financial capital. \nHowever, in more baroque countries such as Ursus, change has been slow and painful. At least before the Great Rebellion, the aristocratic ruling class still controlled the right to speech. Had it not been for a certain incident, Ursus's political structure might not have shifted at all. \nAccording to Rosa's description, the Rostov family she belonged to was one of the new nobility that arose after the Great Rebellion, inheriting everything from a certain Count that they had served under. \nCount Boris, the mayor of Chernobog, was also one of these upstarts. The two families quickly got on good terms, running businesses throughout Chernobog either openly or in secret. This conferred upon Rosa's family a very high status within Chernobog's elites. \nOf course, this all went to naught with the demise of Chernobog.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "After establishing mutual trust with the Doctor, Rosa spoke to the Doctor about her experiences during the Chernobog incident. \nThrough her account, what we now know is that after the Chernobog incident broke out, Mephisto gathered the students from all the schools into a nearby block, and even enlisted a group of noble children into Reunion. \nWith so many students gathered, anxiety and fear continued to ferment, brewing into a series of tragedies in which Rosa took upon a disgraceful role. \nAfter escaping from the school, they struggled to survive in the remnants of Chernobog, which by then had become a half-destroyed city, until Rhodes Island rescued them in a humanitarian relief effort that Amiya had fought hard to secure. \nHer accounts are so appalling that people doubt the authenticity of her words upon hearing them for the first time; however, there are some key points in her description:\nHer group had been trapped inside Peterheim Middle School two days after Reunion gained complete control of Chernobog. The date coincided with the time when Mephisto began to move, in the event now known as the Chernobog incident;\nAfter seizing control of the schools, Mephisto did not interfere with the students' actions within the schools, but would not permit them to leave. From the perspective of outside observers, he intended to exacerbate the brewing anxiety of the students. This ugly behavior is consistent with our perception of him;\nThe time Reunion relaxed their control over the schools corresponded with the time Amiya encountered Mephisto during the mission to rescue the Doctor. Amiya believes that Mephisto received information regarding Rhodes Island's movements and left the schools unsupervised because he had already seen what he wanted to see after setting tragedy into motion;\nThe Peterheim Middle School she described does exist in Chernobog, close to the place where they were rescued, in a block not directly struck by the Catastrophe. \netc, etc. \nAfter considering various factors, we can only conclude that what Rosa described indeed occurred within an event as tragic as the Chernobog incident. \nAs for the experiences of the other members of the Self-Governing Group during this tragedy, Rosa said that she didn't know much because she joined the group late, but she also made it clear that she was unwilling to speak on their behalf. Rosa will take the initiative to speak about her experiences. On one hand, this is a manifestation of her trust in Rhodes Island and in the Doctor; but on the other hand, she fears that among the members of the Self-Governing Group, she is the most appropriate person to 'betray' the others and break the silence. She hopes that the Doctor can do the one thing she cannot - help her fellow classmates.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Rhodes Island is home to many people from various countries and different walks of life. When Rosa joined Rhodes Island along with the other members of the Ursus Student Self-Governing Group, a number of small incidents occurred. \nBecause she was an Ursus noble of pure pedigree. \nWe must confront reality: struggles over politics, economics, land, technology, and war are timeless plagues that have always been tied together by a single thread - nobility. \nAs mentioned in the second file, the old aristocrats largely disappeared from the political arena with the development of nomadic cities; but within Ursus, they did not take their exit from the stage of history. \nOf course, this hardly concerns the average person. It is absolutely impossible for a pure-blooded Ursus aristocrat who has been nurtured at length with an elite education to simply join an organization like Rhodes Island. These nobles sit atop their ivory thrones, governing wealth and land high above the reaches of suffering. \n\nAfter Rosa officially started working with the Logistics Department, she undeniably did act like she was 'trying to seem less like an aristocrat.' One can tell that she is still not accustomed to lowering her position, but she is legitimately trying to adapt to such a life. \nWhy? Because a vast majority of people, Infected or non-Infected, harbor no love for nobles - and particularly not Ursus nobles. \nHowever, Rosa no longer pays any heed to the position she once came from. She bore the burden of contempt in silence, only occasionally smiling and shaking her head - however, she never let that get in the way of her work. \n'No person should be judged because of where they came from,' said Istina as she stood in front of Rosa, shielding her from an outraged Ursus operator. \nWe agree that nothing like that should never be allowed to happen in Rhodes Island, ever. The same is true for Amiya, and the same is true for that operator who later apologized to Rosa. \nRosa, her frankness, her self-reproach, her confusion... was certainly not a novel case when she joined Rhodes Island. \n\nToday is yet another day upon Terra.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "The weapon that Rosa uses, strictly speaking, is not even a weapon at all, at least in the sense that no person should be wielding it. \nHer weapon is actually a small-scale siege engine, frequently used to bridge the gap during inter-city warfare. A larger model of such a device could actually be used to maintain a certain distance between the two sides \nAccording to Rosa's account, they found this device after leaving the school to wandering around Chernobog in search of signs of life. Though practically useless at the time, it was still kept around as a form of self-protection through intimidation. \nIt's hard to imagine how an instrument used to lay siege to the city would end up inside its confines, but knowing its story grants a glimpse into the chaotic events in Chernobog at that time. \nHowever, at Rosa's request, Vulcan has modified this device into a long-range offensive weapon suitable for Rosa's use.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1351,
      "atk": 856,
      "def": 100,
      "magicResistance": 0,
      "blockCnt": 1,
      "baseAttackTime": 2.4,
      "respawnTime": 70,
      "cost": 24
    }
  },
  "skins": [
    {
      "skinId": "char_197_poca#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_197_poca",
      "portraitId": "char_197_poca_1",
      "illustId": "illust_char_197_poca_1",
      "modelName": "Роса",
      "drawerList": [
        "Skade"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_197_poca#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_197_poca_2",
      "portraitId": "char_197_poca_2",
      "illustId": "illust_char_197_poca_2",
      "modelName": "Роса",
      "drawerList": [
        "Skade"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_197_poca@epoque#12",
      "skinName": "Masterpiece",
      "skinGroupName": "EPOQUE/XII",
      "skinGroupId": "2021#epoque#4",
      "avatarId": "char_197_poca_epoque#12",
      "portraitId": "char_197_poca_epoque#12",
      "illustId": "illust_char_197_poca_epoque#12",
      "modelName": "Роса",
      "drawerList": [
        "Skade"
      ],
      "description": "<color name=#ffffff>EPOQUE Line [Passe] Series Selects/Masterpiece. The outfit worn by Natalya Andreyevna Rostova, student council president of Chernobog #4 Secondary School, during her commencement speech.</color>",
      "rarity": 27
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "4-4",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 800,
            "atk": 492,
            "def": 60,
            "magicResistance": 0,
            "cost": 22,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.4,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1067,
            "atk": 684,
            "def": 80,
            "magicResistance": 0,
            "cost": 22,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.4,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "4-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1067,
            "atk": 684,
            "def": 80,
            "magicResistance": 0,
            "cost": 24,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.4,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1351,
            "atk": 856,
            "def": 100,
            "magicResistance": 0,
            "cost": 24,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.4,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3241",
          "count": 5,
          "type": "MATERIAL"
        },
        {
          "id": "30022",
          "count": 8,
          "type": "MATERIAL"
        },
        {
          "id": "30032",
          "count": 5,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "4-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1351,
            "atk": 856,
            "def": 100,
            "magicResistance": 0,
            "cost": 24,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.4,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 1755,
            "atk": 1032,
            "def": 122,
            "magicResistance": 0,
            "cost": 24,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.4,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3243",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30125",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30064",
          "count": 6,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skcom_atk_up[3]",
      "skillName": "ATK Up γ",
      "desc": "ATK <@ba.vup>+{atk:0%}</>",
      "iconId": "skcom_atk_up",
      "spCost": 30,
      "initSp": 15,
      "duration": 30,
      "blackboard": [
        {
          "key": "atk",
          "value": 1
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30013",
              "count": 11,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_poca_2",
      "skillName": "Split Shot",
      "desc": "ATK <@ba.vup>+{atk:0%}</>, and attacks hit <@ba.vup>one</> additional enemy",
      "iconId": "skchr_poca_2",
      "spCost": 65,
      "initSp": 45,
      "duration": 60,
      "blackboard": [
        {
          "key": "atk",
          "value": 0.9
        },
        {
          "key": "attack@max_target",
          "value": 2
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31023",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 9,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_poca_3",
      "skillName": "Avalanche Breaker",
      "desc": "ATK <@ba.vup>+{atk:0%}</>. Immediately fires harpoons at the <@ba.vup>{max_target}</> heaviest enemies within range, <$ba.root><@ba.vup>Binding</></> them and attacking them once every second for the duration of this skill",
      "iconId": "skchr_poca_3",
      "spCost": 30,
      "initSp": 15,
      "duration": 8,
      "blackboard": [
        {
          "key": "max_target",
          "value": 4
        },
        {
          "key": "hit_interval",
          "value": 1
        },
        {
          "key": "atk",
          "value": 0.25
        },
        {
          "key": "hit_duration",
          "value": 8
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30043",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_poca",
      "moduleName": "Rosa's Badge",
      "desc": "Operator Rosa has demonstrated a remarkable aptitude for maintaining distance whilst conducting suppressive fire against enemies of heavy caliber.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Sniper Operator during field operations to exercise Besieger responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_poca",
      "moduleName": "Siege Equipment Training Device",
      "desc": "Chernobog.\nNatalya curled up her legs to cover them with the plastic sheet. She already knew how to get a little warmth while sleeping alone, and how to avoid being discovered by other refugees or the Reunion Movement. It wasn't actually time to sleep, but she was too tired. In hopes of getting Lada a little soup with flavor for her fever, Sonya grabbed half a leather belt off another group of refugees. And, of course, they didn't let her go easy. They chased Sonya all the way back to their hiding place. The commotion woke the already weak and drowsy Natalya. She used the huge weapon she had been carrying on her back for the first time.\nA few days ago, they dragged it out of a burnt-out ruin, and after inspecting the remaining parts, despair yet again cast its shadow on their hearts—it was practically unusable. Natalya describes it as a former siege weapon, now abandoned. Several eyes looked it over only to fall into silence.\nBut Natalya still found a few almost-usable cloth straps and fixed the huge device to her shoulder. Anna and Sonya said nothing, they just clutched their own handy weapons tightly and walked on in silence. Natalya followed.\nThe massive weapon now rested across the bottom of Lada's neck, covered with a layer of found fabric, making it just a little bit softer. It didn't actually fire anything that could cause any real damage in the recent scuffle, but Natalya stood in front of a few already-broken refugees, and snapped off a component of unknown function—the weapon worked strangely, a mixture of thick black smoke and flames gushed out, igniting the debris next to it. The fire drove off the refugees who were pursuing Sonya, meaning they lost their own hiding place.\nSeveral hands tugged at the plastic sheet in the corner. Anna coughed weakly, trying to muffle the sound in her throat. Sonya stared into space with her eyes wide open, not allowing herself to sleep. The flickering flames in the distance reflected on their faces. The feverish Lada suddenly clenched her fists and woke up from her sleep, muttering and grabbing the small pot next to her, preparing to rush out.\nAnna skillfully placed her hand over Lada's forehead, and Sonya pressed down the corner of the plastic sheet to prevent the wind from coming in. Through the gap in the sheet, they saw the dark night sky, glittering stars, and Natalya, still cowering alone nearby. Lada murmured and reached out to her, and after grabbing her equally pale hand, she quieted down and slowly fell back asleep.\nThe next day, Natalya felt an unfamiliar warmth beside her. When she woke up, she saw a small, yellow, dirty star-shaped plush toy hanging off her weapon, swaying back and forth. Lada wrinkled her nose and laughed.\n\nRhodes Island.\n'Please wait a moment, Sonya. I'm not ready yet.'\n'Ugh, you suck, Natalya.'\n'Listen, you're a logistics operator, and you're the one who applied for a replacement weapon. How did I end up being the one pushing <i>you</i> through the process?'\n'Because I suddenly realized that I've gotten used to it.'\n'You've never even fired the thing. The last time you tried, the pile of scrap almost exploded on you.'\n'I know how maximally utilize its functions.'\n'You told us it was a military siege weapon.'\n'Well, I like its color.'\n'Ugh, are you screwing with me? Do you wanna use it or not?'\nThe white-haired girl laughed. She fiddled with a dirty, tattered, star-shaped plush toy behind her back and remembered the night when she huddled with her companions for warmth.\n'I've changed my mind. I don't want to replace it. To me, Sonya, it's more than just a weapon.'"
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "It is an honor to serve you, Doctor.",
      "voiceAsset": "char_197_poca/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "I was once naive enough to think I could have anything I wanted. Now I know, while that may be true for most things, it is not for others. Those I can never get. Not on my own.",
      "voiceAsset": "char_197_poca/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Any work you might have, please feel free to let me try. Don't worry, after what I've have been through, the dignity of a noblewoman is the least of my concerns. Now I am just like Zima and the girls, an ordinary student under protection.",
      "voiceAsset": "char_197_poca/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Doctor, if you would like to know more about Chernobog, I may be able to provide a unique perspective. I was only a student, but you know, the Student Council President does interact with society at large, in some ways.",
      "voiceAsset": "char_197_poca/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "People like Istina, who forgo the opiate that is entertainment in pursuit of greater knowledge, are quite rare. Even at a noble school like I attended. If she had been my classmate back then... No, it's no use thinking about that now.",
      "voiceAsset": "char_197_poca/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "To hate the world on account of a tragedy is as shortsighted as loving the world over a comedy——Is it? Doctor, have you already decided how to handle all that you will soon face? And how should I? I'm still unsure.",
      "voiceAsset": "char_197_poca/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Doctor, I have a favor to ask of you. Would you please look after Zima and the girls... specifically their mental health? They look like they're adjusting well, but I know they're not. Even I, occasionally, think back to those times...",
      "voiceAsset": "char_197_poca/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Doctor, I wonder if you could ever understand? I was a victim, at times, I know. But at some point, I found myself an unconscious victimizer. And I even… 'indulged' in it... I... I can never forgive myself for that.",
      "voiceAsset": "char_197_poca/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "Doctor, is it easier to forget, when you're fully grown? When I come of age, will I be able to forgive myself? Will becoming as mature as you allow me to finally deal with the misery in my heart?",
      "voiceAsset": "char_197_poca/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "The Doctor is asleep...  Looks kind of cute.",
      "voiceAsset": "char_197_poca/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Greetings, Doctor. Allow me to once again express my gratitude to Rhodes Island for taking in me and my friends. I've had enough of a break working in Logistics, and I'd like to do as Zima and the girls do.",
      "voiceAsset": "char_197_poca/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "I too must prepare for the battlefield…",
      "voiceAsset": "char_197_poca/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "It seems my experience in student government is paying dividends in my work life. How delightful.",
      "voiceAsset": "char_197_poca/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "There is still much I don't understand about what I am doing, about my future, about myself, and about so much more. But I am young. I still have time to think. Don't I, Doctor?",
      "voiceAsset": "char_197_poca/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Let us put my training to the test.",
      "voiceAsset": "char_197_poca/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "I will do all I can.",
      "voiceAsset": "char_197_poca/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Comrades, let us move out.",
      "voiceAsset": "char_197_poca/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Comrades, let us keep to the plan.",
      "voiceAsset": "char_197_poca/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Leave it to me.",
      "voiceAsset": "char_197_poca/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Is it my turn?",
      "voiceAsset": "char_197_poca/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Stay calm, relax…",
      "voiceAsset": "char_197_poca/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "First, remember the combat manual…",
      "voiceAsset": "char_197_poca/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Ready, aim... FIRE!",
      "voiceAsset": "char_197_poca/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Huh? A misfire? Eek!",
      "voiceAsset": "char_197_poca/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Rosa, believe in yourself. You can do it!",
      "voiceAsset": "char_197_poca/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "This is nothing personal...",
      "voiceAsset": "char_197_poca/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Doctor, we did it...! Oh, um, ahem, truly a delightful victory!",
      "voiceAsset": "char_197_poca/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "I hope I've met Doctor's expectations.",
      "voiceAsset": "char_197_poca/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "My apologies, Doctor. If only I had tried harder...",
      "voiceAsset": "char_197_poca/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "We must review this carefully after we get back…",
      "voiceAsset": "char_197_poca/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "I wonder if there's anywhere quite like the salon?",
      "voiceAsset": "char_197_poca/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Oh!",
      "voiceAsset": "char_197_poca/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Another lovely day today.",
      "voiceAsset": "char_197_poca/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_197_poca/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Happy new year, Doctor. This is a busy day, but I'm glad that I can contribute towards the party. I hope everyone likes my floral arrangements and desserts. Oh, I just remembered something. The USSG and I will be hosting a small private gathering this evening. You're more than welcome to join us, Doctor.",
      "voiceAsset": "char_197_poca/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Doctor, it's great to see you.",
      "voiceAsset": "char_197_poca/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "We had to be extremely careful with our gifts at school. A slight mistake may just trigger a sizable scandal. But that's something I no longer need to worry about, and I can express myself however I wish. Happy birthday, Doctor. Gummy taught me how to bake these cookies. Thank you for taking care of us.",
      "voiceAsset": "char_197_poca/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "I may never be able to free myself from the nightmare. But since my arrival at Rhodes Island, I gradually found the courage to face it. It's all thanks to you and my friends at the USSG. You always stand by my side and lead the way... I believe one day, I will finally be able to start my life anew.",
      "voiceAsset": "char_197_poca/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "control_mp_cost&faction[020]",
      "buffName": "Student Council President",
      "desc": "When this Operator is assigned to the Control Center, each Operator from <$cc.g.ussg><@cc.kw>Ursus Student Self-Governing Group</></> increases the Morale of all Operators in the Control Center by <@cc.vup>+0.05</> per hour",
      "skillIcon": "bskill_ctrl_ussg",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "hire_spd&clue2[250]",
      "buffName": "Prestige",
      "desc": "When this Operator is assigned to the HR Office, increases HR contacting speed by <@cc.vup>+20%</>, and for every <@cc.vup>1</> contacts made, increases the likelihood of obtaining <@cc.kw>Ursus Student Self-Governing Group</> clues (working time and recruitment slots improves the likelihood)",
      "skillIcon": "bskill_hire_spd&ursus2",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}