{
  "id": "char_1020_reed2",
  "meta_info": {
    "name": "Reed the Flame Shadow",
    "appellation": " ",
    "voiceActor": {
      "en": "Martha Mackintosh",
      "jp": "Mamiko Noto",
      "kr": "Yoo Bo-ra",
      "cn": "Tracy"
    },
    "rarity": 6,
    "profession": "Medic",
    "subProfessionId": "Incantation Medic",
    "position": "RANGED",
    "team": "dublinn",
    "tagList": [
      "Healing",
      "DPS",
      "Debuff"
    ],
    "nationId": "Victoria",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Reed\n[Gender] Female\n[Combat Experience] 8 Years\n[Place of Birth] Victoria\n[Date of Birth] Oct 16\n[Race] Draco\n[Height] 172cm\n[Infection Status]\nOriginium crystals distributed across surface of body, confirmed Infected by medical examination.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Excellent\n[Mobility] Excellent\n[Physical Resilience] Standard\n[Tactical Acumen] Excellent\n[Combat Skill] Excellent\n[Originium Arts Assimilation] Outstanding",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Reed previously applied to withdraw while stationed at a Rhodes Island branch office in southern Victoria, and has only recently reestablished contact with us. Presently actively leading a small force within Victorian borders under Dublinn's name, with her primary objective being to aid those Tarans forcefully displaced.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests show the indistinct outlines of internal organs, obscured by abnormal shadows. Originium granules detected in the circulatory system. The subject is confirmed to be infected with Oripathy.\n\n[Cell-Originium Assimilation] 10%\nNo apparent proliferation in Reed's surface Originium crystals compared to before she disembarked.\n\n[Blood Originium-Crystal Density] 0.22u/L\nThe emergency treatment of Operator Reed left a deep impression on all attending Medical Department Operators. While huge challenges were posed during the procedure, her condition was nevertheless successfully stabilized.\n'Upon regaining consciousness, the first thing the patient asked me was 'Why save me?', which I had no idea how to respond to... *sigh* I wonder if she's found her answer now?'",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "In order to keep her identity concealed, Reed applied to Engineering for a new weapon when she left. Left unable to discuss it with the applicant, Engineering had to estimate her Arts characteristics and combat tics based solely on her old lance. Even so, judging by post-reboarding tests, this new weapon is an unexpectedly superior fit for Reed; or perhaps, as Reed herself says, her previous weapon simply didn't fit her at all. She seems to feel a sense of freedom now that she can lay down her old weapon, but nevertheless asked that Rhodes Island keep it appropriately stored in the warehouse.\n[Originium Arts Overview]\nReed now has precise control over her Arts, and testing them no longer requires the grounds to be cleared of personnel, nor does Reed herself express strong opposition.\nI recall an operator once permitted to observe her in combat, who was practically stunned, even frightened by the energy innate to her casting. Now, however, her Arts manifest in a completely different form. Several theoretical Casters have confirmed that her Arts, as ever, accelerate activity within organic tissue, but said acceleration has clearly become more controlled. Rejuvenation of flesh spurs rapid healing of wounds, while neuronal replacement inhibits the transmission of pain. No longer does life rapidly wither to her Arts; now it shines with fresh vitality.\nTo so significantly alter how one's Arts are cast without any long-term training is, for the caster, potently dangerous. After our repeated inquiries, Reed conceded that she endures a level of burning pain in limiting her Arts' energy and constraining their use purely to therapy, but stated that as no practical harm comes to her body, no concern is needed.\nIt goes without saying that that destructive power still lies within her blood, and in testing that, or sending her directly into combat missions, we continue to observe how the instantaneous rush of her flames can burn anything and everything to ashes. She has simply chosen to reveal the therapeutic side of her Arts to us, for that is the peace embodied by her dreams.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Reed was highly positive during her reexamination at Medical. This stems partly from her preexisting trust established with Rhodes Island, but also from having accepted her identity as a Draco, and the responsibilities that follow. These days, she does not worry about allowing Rhodes Island to get a hold of information on the Draco, nor whether her simple touch would inadvertently burn another to ashes.\nMost of the time, Reed is as calm as ever. The minority of operators who came into direct contact with her in the past all recall how often she'd wake from a stupor with a shudder, eyes filled with fear, yet not say a word to indicate what weighed on her mind. This extreme resistance to contact with others was alleviated somewhat after repeated attempts by Rhodes Island's operators and the Doctor to communicate, but the comfortable, assured way she now talks from time to time is truly gratifying to all who care for her. If raising the topics of Victoria's present theater of chaos or her own duties, she'll be extremely earnest and prudent in offering her own thoughts; meanwhile, when you touch on local lays of the land, on poetry and hopes for the future, she'll bare her own sincere bereavement and affection, without even realizing.\nAt the end of her stay at Medical, Reed was actively asking about issues relating to Oripathy treatment and protection.\nBy no means is it the first time Reed has asked a Medic Operator something of her own accord. In fact, before she last left Rhodes Island to set out, she spent several days and a huge amount of effort packing medical articles, and her luggage practically transformed into a medkit. For every way to die she could imagine, she thought of a way to resist it, which might have been a mechanical way of affirming life's value to herself at the time. Happily, her medical preparations may well have saved the day in practice, and now Reed asks for the sake of far more than her own.\nBased on her accounts, Oripathy infection rates among Tarans are relatively high owing to the majority working under conditions of inadequate protection; conversely, the relentless pace of Dublinn's battles sees casualties emerge infected one after another. She feels she has to address this somehow, perhaps because she is the Leader, or perhaps simply because she is their companion.\nBesides that, at some point prior to Operator Saileach disembarking, she and Reed had had a lengthy conversation in the library. Reed's latest return to the landship coincidentally saw her meet Saileach again, who was reboarding to report in from County Hillock. Over these past several months roaming Victorian soil, a change has been evident in the both of them. Seeing Saileach leave the reception room alone with much weighing on her, we had our reservations that, similar to her fellow former Victorian serviceman Bagpipe, Saileach would be at irreconcilable odds with Reed, who presently fights for Dublinn's cause.\nBut the next day, an operator saw the two of them together in a corner of the library. Absorbed in a novel, Saileach never so much as lifted her face to greet the operator passing by, while Reed was taking a small break—head resting in her arms in a picture of tranquility—with a half-filled sheet of letter paper laid by her side. Until Reed left the library in the afternoon to visit Medical, not a word seemed to come from that corner, only the calm rustle of pages flipping and the soft scratching of a pen.\nNot long after, we noted that a great deal of Saileach's report highlighting the full course of events at County Hillock and how the Tarans were surviving, was referenced from Reed.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "We've already had a run in with Dublinn forces in Londinium; each participating operator may well have their own understanding of what Dublinn is. Reed did not come back to Rhodes Island in her Dublinn capacity, but she does not refrain from recounting to us the Dublinn she knows—as well as the Dublinn she considers herself to lead.\nThe name of Dublinn finds its origin in the two sisters' family name, one that was hidden by wandering for years and symbolizes their Draco bloodline. That said, the vast majority of Victorians would think little upon hearing it; the leader of Dublinn may well have chosen the name to stir up that forgotten history that comprises the Kingdom of Tara.\nThe Kingdom of Tara was founded by a Draco nomad in what is currently the Taran region. Thereafter, according to Victorian historical accounts, Victoria and Tara opted to merge so as to fend off the Nightzmora's Khagan, with Victoria conferring the title of King Gaeil upon Tara's ruler. However, with the amassing of relics, data, and oral tradition from the folk sphere in recent years, more and more scholars of Taran historical texts and culture are inclined to believe that the Kingdom of Victoria subjugated the Kingdom of Tara by force, the latter coerced into having its territory annexed. Some even hold that though the ruler of the Taran region held the title of King Gaeil, it was in fact the Victorian nobles dispatched to the Taran court that held greater authority. Another view largely accepted by modern historians is that in the centuries following their violent conquest, any culture unique to the Taran region had been suppressed and even destroyed by Victoria, with the Tarans' own dignity crushed underfoot as a consequence.\nRegardless of what history may lay behind it, the present region of Tara is inarguably lagging in development, and the people subjected to extremely arduous lives. The conflict between speakers and non-speakers of Taran becomes more pronounced by the day; it is in this context that Dublinn arose. Records would indicate that Dublinn's forces have only been active across Victoria's southern regions in the last two years, but in truth, it came into conception approximately seven years ago. And from then until now, its heart has remained the same: the Draco of Tara out to rescue her people from the clutches of suffering.\nWe have observed signs of conflict between different factions within Dublinn. Some are more concerned with the Taran name, while others seek to see the Draco dynasty restored; yet another side with no ties to the first two sets its sights on Dublinn's most powerful backer, the Duke of Wellington. Reed herself recognizes that though she only wishes for the Tarans who suffer to receive fair treatment, she simply cannot avoid the issues implicated by the Draco aspect.\n[Classified Log]\nWhether Reed's statements or our own independently gathered intel, everything indicates that Dublinn has no intention of vying for the Victorian crown—at least, at present. Reed's twin sister, the Draco Caster that presently commands Dublinn's main forces, is the one and only royal successor to a considerable portion of the population; what obstacles compel her—or what, if any, considerations lead her to take her current approach? Given that all intel paints Dublinn's Leader as a political conniver at ease with contending amidst numerous powers, if she is taking a back seat then it must be in exchange for something.\nPerhaps we'll be shown the answer sooner than we think.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Knowing that the Dublinn leader we recently encountered in Londinium was Eblana herself, we can understand to a certain degree why Reed fears her twin sister so much, even having warned Rhodes Island to avoid contact with her. Fortunately, she did not react with the same intense stress as before when we raised the topic of her sister again, after receiving our intel from Londinium. Instead she recounted, quite calmly, her past experiences as her sister's 'shadow,' and filled in some information which had been hazy in our records. Through Reed, we gained an explicit understanding of how the Dublinn leader's Arts manifest, and confirmed the combat MO of a portion of Dublinn's spec ops personnel.\nLater, she informed us that she still didn't quite grasp what goal Dublinn had in entering Londinium, and so couldn't approve of said action for the time being, but would be sure to meet with Eblana directly at an appropriate time in the future.\nWe were concerned that whether out of a desire for vengeance, or to prove her sister's wrongdoings and vie for leadership of Dublinn, the now-uncurbed Reed seemed on the verge of a clash with her sister, perhaps even to the death. However, she reassured us that this was not the case. By her account, the primary Dublinn force commanded by Eblana seems to have come to an unspoken understanding about Reed, ceasing their pursuit of her, while also regarding her and her companions as comrades, one and all. At present, each side is committed to their own plan of action, existing in some kind of pseudo-harmony.\n'She knows—that I'll return to her side, even if she doesn't pursue me, that's all. What I think, what I want—none of it matters to her. She's always believed... that I'll never avoid her, or escape from her grasp.'\n'Me? ...It doesn't matter to me either. If she fights for the life the Tarans deserve, then she and I are fundamentally doing the same thing. Is it that important that I matter?'",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Before leaving Rhodes Island, I had left those knots I could not untie, could not face, in a letter to you. I remember I could not muster more than a word or two, but once I set my pen down, I felt I finally had the courage to trust in my own conscience... to trust that 'life has its value,' as Rhodes Island taught me.\nYet... if life had value, it must have been a dearly, gravely heavy one, so heavy I didn't know how I could bear it. I could not answer why Outcast saved me, the taker of countless lives, as I was dying. If I was not simply fuel for the flames, then what should I be?\nI had to emerge from this refuge, so I could answer her, answer all of you.\nAnd now, I pen a letter again, to tell you of what I found, and of my answer.\n...\nAnd so, my identity is one I cannot flee. Am I a Taran? I am; am I Dublinn? I am; am I the Draco? I am.\nAm I Dublinn's Leader? I can be.\nI want them too to see how life should be, and should that duty choose me, I will flee no longer.\nDoctor, I am aware. Choosing to return to Dublinn signifies that no longer do I seek first and foremost to protect and save the Oripathy-blighted, and that I cannot anymore avoid the hostility of some by your side. I have thought, and thought, and before I return to the Rhodes Island landship, I will have written and sent you this letter.\nI will not become an enemy to Rhodes Island. But should you not approve, I will not return to Rhodes Island unpermitted, posing as an operator. That is all for you to decide.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1361,
      "atk": 440,
      "def": 67,
      "magicResistance": 20,
      "blockCnt": 1,
      "baseAttackTime": 1.6,
      "respawnTime": 70,
      "cost": 17
    }
  },
  "skins": [
    {
      "skinId": "char_1020_reed2#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_1020_reed2",
      "portraitId": "char_1020_reed2_1",
      "illustId": "illust_char_1020_reed2_1",
      "modelName": "Reed The Flame Shadow",
      "drawerList": [
        "STAR影法师"
      ],
      "description": "Reed picked this attire when she left Rhodes Island's Southern Victoria Office.\nPaired with a versatile cloak for traversing the wilderness, it is a complete break from the Dublinn style.",
      "rarity": -50
    },
    {
      "skinId": "char_1020_reed2#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_1020_reed2_2",
      "portraitId": "char_1020_reed2_2",
      "illustId": "illust_char_1020_reed2_2",
      "modelName": "Reed The Flame Shadow",
      "drawerList": [
        "STAR影法师"
      ],
      "description": "Fire continues to burn at her spear tip. She hopes she can warm the long, cold night.\nRhodes Island's fireproof material is highly reliable, even in the heat of battle.",
      "rarity": -10
    },
    {
      "skinId": "char_1020_reed2@epoque#30",
      "skinName": "Curator",
      "skinGroupName": "EPOQUE/XXX",
      "skinGroupId": "2024#epoque",
      "avatarId": "char_1020_reed2_epoque#30",
      "portraitId": "char_1020_reed2_epoque#30",
      "illustId": "illust_char_1020_reed2_epoque#30",
      "modelName": "Reed The Flame Shadow",
      "drawerList": [
        "STAR影法师"
      ],
      "description": "<color name=#ffffff>EPOQUE Collection New Arrivals/Curator. Scholar's garb straight from a fairy tale. Stuff your magic, knowledge, and curiosity in the pockets, and take notes with Reed.</color>",
      "rarity": 45
    },
    {
      "skinId": "char_1020_reed2@summer#17",
      "skinName": "Summer Flowers FA075",
      "skinGroupName": "Coral Coast/XVII",
      "skinGroupId": "2024#summer#2",
      "avatarId": "char_1020_reed2_summer#17",
      "portraitId": "char_1020_reed2_summer#17",
      "illustId": "illust_char_1020_reed2_summer#17",
      "modelName": "Reed The Flame Shadow",
      "drawerList": [
        "STAR影法师"
      ],
      "description": "<color name=#ffffff>MARTHE [Coral Coast] Summer Flower Series FA075. Brings out a girl's figure and physique using all-natural materials. Pursue this summer's hottest trend.</color>",
      "rarity": 95
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "3-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 868,
            "atk": 192,
            "def": 36,
            "magicResistance": 10,
            "cost": 15,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1143,
            "atk": 316,
            "def": 53,
            "magicResistance": 10,
            "cost": 15,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "3-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1143,
            "atk": 316,
            "def": 53,
            "magicResistance": 15,
            "cost": 17,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1361,
            "atk": 440,
            "def": 67,
            "magicResistance": 15,
            "cost": 17,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3261",
          "count": 5,
          "type": "MATERIAL"
        },
        {
          "id": "30022",
          "count": 8,
          "type": "MATERIAL"
        },
        {
          "id": "30052",
          "count": 5,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "3-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1361,
            "atk": 440,
            "def": 67,
            "magicResistance": 20,
            "cost": 17,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 1583,
            "atk": 550,
            "def": 84,
            "magicResistance": 20,
            "cost": 17,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3263",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30155",
          "count": 3,
          "type": "MATERIAL"
        },
        {
          "id": "30014",
          "count": 9,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skcom_quickattack[3]",
      "skillName": "Swift Strike γ",
      "desc": "ATK <@ba.vup>+{atk:0%}</>; ASPD <@ba.vup>+{attack_speed}</>",
      "iconId": "skcom_quickattack",
      "spCost": 35,
      "initSp": 15,
      "duration": 35,
      "blackboard": [
        {
          "key": "atk",
          "value": 0.45
        },
        {
          "key": "attack_speed",
          "value": 45
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31043",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 10,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30155",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_reed2_2",
      "skillName": "Wither and Thrive",
      "desc": "Prioritizing ground Operators, gives <@ba.vup>2</> allies 3 fireballs with the following effect: Every <@ba.vup>{cooldown}</>s, deals <@ba.vup>{atk_scale:0%}</> of Reed the Flame Shadow's ATK as Arts damage to an enemy, triggering her Trait but only on that ally.",
      "iconId": "skchr_reed2_2",
      "spCost": 27,
      "initSp": 18,
      "duration": 20,
      "blackboard": [
        {
          "key": "projectile_life_time",
          "value": 20
        },
        {
          "key": "atk_scale",
          "value": 2.4
        },
        {
          "key": "cooldown",
          "value": 1.5
        },
        {
          "key": "max_target",
          "value": 2
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31063",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31064",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 9,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_reed2_3",
      "skillName": "Ember of Life",
      "desc": "Attacks hit <@ba.vup>2</> enemies; ATK <@ba.vup>+{reed2_skil_3[switch_mode].atk:0%}</>; Talent 1 activation chance increases to <@ba.vup>100%</>; enemies with the Cinder effect take <@ba.vup>{talent@s3_atk_scale:0%}</> of Reed the Flame Shadow's ATK as Arts damage per second, and when defeated deal <@ba.vup>{talent@aoe_scale:0%}</> of ATK as Arts damage and inflict Cinder to nearby enemies\n<@ba.rem>Cinder lasts until this skill expires</>",
      "iconId": "skchr_reed2_3",
      "spCost": 40,
      "initSp": 30,
      "duration": 30,
      "blackboard": [
        {
          "key": "talent@prob",
          "value": 1
        },
        {
          "key": "reed2_skil_3[switch_mode].atk",
          "value": 0.6
        },
        {
          "key": "talent@s3_atk_scale",
          "value": 0.6
        },
        {
          "key": "talent@aoe_scale",
          "value": 1.4
        },
        {
          "key": "talent@range_radius",
          "value": 1.7
        },
        {
          "key": "talent@atk",
          "value": 0
        },
        {
          "key": "talent@damage_scale",
          "value": 1
        },
        {
          "key": "max_target",
          "value": 2
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30083",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_reed2",
      "moduleName": "Reed the Flame Shadow's Badge",
      "desc": "Operator Reed the Flame Shadow has demonstrated a remarkable aptitude for simultaneous aggression and medical treatment while casting.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Medic Operator during field operations to exercise Incantation Medic responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_reed2",
      "moduleName": "'A Floral Garland to the Red Dragon'",
      "desc": "Feeling in the dark, Reed untangles her hair with utmost care, then stands herself straight once more.\nA dream comes to mind, one she always used to have. Her sister stands behind her in her shadow, watching as she puts on a deathly heavy crown. She feels it's wrong for her to be wearing it, but she can't take it off no matter how she tries; all she can do is melt it by fire. Metal trickles down her face, scalding, searing, but the idea of the purple flame bringing her comfort, ice-cold, scares her more. So she makes not a sound.\nAnd she recalls two people she met while pursuing the high-speed battleships' tracks a few days ago, ordinary folk. They knew the name of Dublinn—their land showed scars from being razed by fire. They asked Reed point-blank, are you the one who ruined our lives? The Draco, manipulator of the flame of life, fell silent for a while. She was familiar with the fear her sister could leave in people. But in the end, she nodded, for she is the Leader of Dublinn, and the Tarans have no need for two Dublinns.\nSomeone is calling her name. She leaves, through the tight wooden door.\n—She crosses a threshing floor, filled with hay and cardboard stage props of every color.\nHer costume's a little cumbersome—everyone wanted to drape their own two sashes over her, in much the manner one nestles two flowers for their beloved in a buttonhole. Surely the Red Dragon didn't take to the battlefield like this a millennium ago.\nBut no matter. They don't have to trouble themselves with the looks of the crown-bearer. Let the wandering minstrels suppose, for the sake of a rhyme, that the Draco hero of legend had hair just as flowing and golden.\nReed clears her throat and swishes her tail, a little wary. The Tarans in front of her don't know how each brook of muddy waters tracing through the marsh is the track of a galloping warship. They don't know that the bleak clouds to the north that never blow this way are the fumes of war. They don't know that what Reed grasps is the very flame of the Red Dragon of Tara. They simply know it's important to still have food to eat after their taxes are levied, and it's as important to make sacrifice and perform theater so their farmwork is bountiful and blessed. Sat in the back are the soldiers who've fought all the way alongside her, and they look at her just as expectantly. They've taught Reed that a failure to learn the lines means no good harvest in the coming year.\n'I give you land, and I give you the weather to nurture it.'\nA fire ignites at her speartip in time with her words, and the audience abruptly settles down. At this moment, all could swear they have some vague premonition as to who it is that stands before them.\nReed lowers her head. A child places a floral garland on her head of every color under the sun, each flower a symbol of a growing, flourishing crop.\nIt is light, almost weightless. She bows down, and to the village's script, unchanged in all its years, she adds one line.\n'I give you peace.'"
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "There's a lot more I can do for you now—more than secretarial work. I won't be opposed to fighting anymore. But still, to be here, writing for you, is... a great honor of mine.",
      "voiceAsset": "char_1020_reed2/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "What would you like to ask? Maybe you want to know—how much power Dublinn has... no? Oh, just how I'm personally doing? I'm still no more than a shadow, but—not my sister's. Dublinn's flame is lit by so many people, so many ideals, and the shadow cast by that firelight—that is what I am now.",
      "voiceAsset": "char_1020_reed2/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "It's getting dark. Around this hour, there'd be people walking leisurely along the grey pavements, perhaps fowlbeasts gathering by the ponds—that is the Tara I remember. It's no special thing, but neither has it truly existed before. Doctor, I believe everyone should have a home to welcome them back.",
      "voiceAsset": "char_1020_reed2/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "I can't make myself out to be a comrade of yours—there are some by your side that surely hate me. But—once Dublinn no longer needs these raging, burning flames, then I'll come back here... I want to come back here.",
      "voiceAsset": "char_1020_reed2/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "In my spare time? I still like prose, and poetry, both reading and writing... and I like to hear others sing. I know a few folk songs—very pretty ones, but no record has been made of them. Doctor, Have you ever heard, how the stems of reeds can be used as whistles? Yes, the reeds that would burn away at the brush of a flame.",
      "voiceAsset": "char_1020_reed2/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "Once you've caught Oripathy, living can become very painful... Do I resent it? No, I just used to not understand... life is so fragile, so much is ready to steal it away, yet we were meant to withstand that—to resist each and every trouble? But now... I can see you fight not just to resist—you fight to give people back their lives.",
      "voiceAsset": "char_1020_reed2/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Do not fear, but do not disregard. Be light, be gentle... that is how you touch another. I remember learning this from you, Doctor, and it ensures my flames won't turn others to ash. Don't worry, I can bear the pain that accompanies. My fire won't die out.",
      "voiceAsset": "char_1020_reed2/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Many prophecies say similar things—'it is the Draco's nature to fight.' I won't stand for that. But—if my sister stays blind to what will become of the land, once blanketed by the fires of death... then I will stop her. I know what kind of Leader the people put their hopes in—and that's not what she is.",
      "voiceAsset": "char_1020_reed2/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "My mind's not at peace, Doctor. Is my every choice truly right? Their lives stoke our flames in the night. Yet in the end, if they fail to burn through the darkness... No, why should their lives even be mine to dictate...? But still, I will walk on. Now I bear a duty, and I will walk on.",
      "voiceAsset": "char_1020_reed2/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Not a word needed... It's always so tranquil, by your side.",
      "voiceAsset": "char_1020_reed2/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "I know—you'll have many new questions for me, about my identity, about my goals... but—I am still the same Reed.",
      "voiceAsset": "char_1020_reed2/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "No matter how many times, you'll still choose to fight like this...",
      "voiceAsset": "char_1020_reed2/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "What is it you seek, from those who earn this medal? Tell me more about your dreams.",
      "voiceAsset": "char_1020_reed2/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "Upon the damp soil, there struggles life after life. While my flame does not yet die, I will reach them—I will.",
      "voiceAsset": "char_1020_reed2/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "I understand the objective you've set.",
      "voiceAsset": "char_1020_reed2/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "You fight not by my will, but yours. You choose to be warriors. So I will stand with you, shoulder to shoulder.",
      "voiceAsset": "char_1020_reed2/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "What blocks the way, I will burn through.",
      "voiceAsset": "char_1020_reed2/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "It is your tyrannies that fuel this flame.",
      "voiceAsset": "char_1020_reed2/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Where do you wish to go?",
      "voiceAsset": "char_1020_reed2/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "I'm prepared to fight.",
      "voiceAsset": "char_1020_reed2/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Please, trust in me.",
      "voiceAsset": "char_1020_reed2/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Your lives are mine to protect.",
      "voiceAsset": "char_1020_reed2/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Your lives, now ignited.",
      "voiceAsset": "char_1020_reed2/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "This endless burn, you needn't bear.",
      "voiceAsset": "char_1020_reed2/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Fear not the firelight.",
      "voiceAsset": "char_1020_reed2/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "I am Dublinn.",
      "voiceAsset": "char_1020_reed2/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "In honesty, it's hard to even tell whether your battles are victories, given your dreams still lie so far, far away. But at times like these, it strikes me—perhaps we may all see the day, when peace comes.",
      "voiceAsset": "char_1020_reed2/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "To drive them away with fire is easily done. But—if we're to ensure they'll never come back to hurt us, then a fire is not enough.",
      "voiceAsset": "char_1020_reed2/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Did they flee? I have no hate for those who do—but here on the battlefield, I will pursue them.",
      "voiceAsset": "char_1020_reed2/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "The pain of burning, I can bear much more of. Just—don't let anyone else—disappear to the flames again...",
      "voiceAsset": "char_1020_reed2/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "I remember how I hid away in the ship's cabins. I miss those days.",
      "voiceAsset": "char_1020_reed2/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "...I still burn hot, don't I?",
      "voiceAsset": "char_1020_reed2/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "The poems I've transcribed? I can read them to you, if you're interested. It's okay if you don't understand Taran—perhaps you'll still feel the emotions' touch.",
      "voiceAsset": "char_1020_reed2/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_1020_reed2/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Can I sit here, and watch the flames? Mm, I'm not here to celebrate this day, not at all... but—hearing the bells echo through the wilds, it makes me glad for the firelight, on this night.",
      "voiceAsset": "char_1020_reed2/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Ah, Doctor. Yes, some things never change.",
      "voiceAsset": "char_1020_reed2/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "You read the poem I left in your gift...? To tell the truth, it wasn't written for this day. It's just—last night, while wrapping your present, the perfect rhyme suddenly came to me.",
      "voiceAsset": "char_1020_reed2/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "You and I are different. Dublinn is a dream that took shape long ago, long before it found itself in me. But Rhodes Island—you take something so hard to envision, and convince people to believe in it. You are what saved me, and I will always remember that.",
      "voiceAsset": "char_1020_reed2/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "train_spd_doubleProf[100]",
      "buffName": "Red Dragon's Blood",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, <@cc.kw>Caster</> and <@cc.kw>Medic</> Operators' Specialization training speed <@cc.vup>+30%</>",
      "skillIcon": "bskill_train_caster&medic1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "train_spd_doubleProf[110]",
      "buffName": "Red Dragon's Blood",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, <@cc.kw>Caster</> and <@cc.kw>Medic</> Operators' Specialization training speed <@cc.vup>+45%</>",
      "skillIcon": "bskill_train_caster&medic2",
      "phase": "PHASE_2",
      "level": 1
    },
    {
      "buffId": "control_dorm_rec[000]",
      "buffName": "Leader",
      "desc": "When this Operator is assigned to the Control Center, all Operators in Dormitories recover <@cc.vup>+0.05</> Morale per hour (strongest effect of the same type applies)",
      "skillIcon": "bskill_ctrl_leader",
      "phase": "PHASE_1",
      "level": 1
    }
  ],
  "patch_info": {}
}