{
  "id": "char_2012_typhon",
  "meta_info": {
    "name": "Typhon",
    "appellation": " ",
    "voiceActor": {
      "en": "Tuva Jagell",
      "jp": "Naomi Ohzora",
      "kr": "Cha Rim",
      "cn": "Shi Haku"
    },
    "rarity": 6,
    "profession": "Sniper",
    "subProfessionId": "Besieger",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "DPS"
    ],
    "nationId": "Sami",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Typhon\n[Gender] Female\n[Combat Experience] 9 Years\n[Place of Birth] Sami\n[Date of Birth] Feb 1\n[Race] Sarkaz\n[Height] 155cm\n[Infection Status]\nOriginium crystals distributed across surface of body, confirmed Infected by medical examination.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Excellent\n[Mobility] Standard\n[Physical Resilience] Excellent\n[Tactical Acumen] Normal\n[Combat Skill] Excellent\n[Originium Arts Assimilation] Standard",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Typhon, a Sarkaz active in Sami, considers herself a hunter and has both the knowledge and skills to deal with the dangers of Sami's natural environment. At Operator Magallan's invitation, she is currently cooperating with Rhodes Island and assisting in our affairs in Sami and the endless icefields.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests show the indistinct outlines of internal organs, obscured by abnormal shadows. Originium granules detected in the circulatory system. The subject is confirmed to be infected with Oripathy.\n\n[Cell-Originium Assimilation] 3%\nA small amount of Originium crystals can be seen on Typhon's body.\n\n[Blood Originium-Crystal Density] 0.19u/L\nEven though she has been active in the wilderness for quite some time, Typhon's infection status is remarkably stable, and it seems she has been taught relatively comprehensive protective measures.\n\nShe's actually an Infected, huh... Or rather, as she put it, 'it's normal for a Sarkaz to be Infected.' If anything, what most tugged at the heartstrings of everyone at Medical was the matter-of-fact way she said this.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Among Rhodes Island's operators, there are no shortage of self-described hunters who've spent years in the wilderness, but Operator Typhon is different from others we've met wandering outside the confines of civilized settlements. She is also unlike the Samifjod who make a living through hunting. Typhon herself seems somewhat aware of her uniqueness, but while she repeatedly tells us not to touch her weapon, she cannot clearly explain why. As such, we have conducted focused combat testing on her.\nThrough her bow and arrows, she utilizes relatively ancient Sarkaz Arts. We have seen similar Arts in Valarqvin, who was travelling with her. However, the latter has a clearer understanding of the nature of these Arts, while Typhon primarily harnesses them to reinforce her arrows. Later, we discovered some very unusual data in the test records. After repeated rounds of testing under controlled conditions, the recorder was finally able to confirm that, even without the aid of Originium Arts, the arrows she shoots from that eye-catching black bow cause small distortions in the surrounding space. Though extremely difficult to discern with the naked eye, these anomalies were picked up by our precise instruments.\nDuring follow-up conversations, we learned that Operator Typhon hunts not only wild beasts, but also what the Samifjod refer to as 'disaster,' as well as helping tribes deal with the assorted abnormal phenomena caused by said disaster. Since the behavioral logic of these 'disaster' is unlike that of any biological lifeform seen on the continent of Terra, she has naturally developed unconventional combat methods. But by her own account, despite being utterly alien to us, these anomalies are just an enemy that every Sami warrior must face.\n\nOf course, Engineering is super interested in her weapon. Doesn't her repeated insistence not to touch it just make you more curious? Too bad she never lets down her guard. Just imagine sneaking into the lounge while she's napping, only to be caught by your ankle in the darkness... Terrifying. We also tried tricking her into doing a physical examination before a combat test, so we get to it while she was away from it, but the slap on the shoulder I got from Kal'tsit was even more terrifying!\n––Engineering Department, Closure\n\n[Classified Log]\nTouching Operator Typhon's weapon is forbidden. The essence of its pitch-black appearance is the overwriting of physical matter by the projection of demons onto real space. Or as the Samifjod more commonly put it, 'contamination.'\nThe peculiarities of this weapon, combined with the ancient Sarkaz Arts she uses, allow her to effectively curb this demonic contamination. The nature of the repellant effect she exerts is completely different from the level of resistance offered by Sami's warriors.\nThis is a warning to those who can see it, Doctor. When confronted with a threat of this magnitude in the Infy Icefield, you cannot rely on comprehensive preparations to ready yourself mentally. Rather, you must first be mentally prepared to even recognize it.\n––Kal'tsit",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Our expedition teams have already brought back many stories about Sami. These tales inevitably generate a degree of prejudice: writing off Sami as a backwards, ignorant, and uncivilized region; the belief that once the locals are exposed to the technological marvels of modern society, they will be as astonished as primitive humans obtaining fire for the first time; or the notion that technology can be put on equal footing with nature. That the latter grants us power to compete against the miraculous workmanship of nature, and that all the conservatives who cling to nature will be inevitably resistant towards technological progress.\nTaking into account the experiences of Operator Qanipalaat, Rhodes Island has carefully designed a special guidance process when welcoming partners from Sami. As a result, when Typhon had to work with other operators here, or 'southerners,' as she refers to them, the intense friction and clash of cultures we anticipated did not occur. For example, when she happened to walk in for the first time, she merely pointed at a couple of photos on the electronic file record and suggested that I change positions before leaving.\nIt's clear that this is in part due to Columbia's influence on Sami. Much of Terra's most cutting-edge technology is already visible to the people there. However, the Columbians' expansion, centered around tourism and exploration, has currently only reached a select few areas in southern Sami, and without active cross-pollination, it is unlikely that any Samifjod would understand how to use these things to the extent that Typhon does.\nOf course, she is also not some gifted, natural-born scholar of 'modern civilization.' She is simply curious, and harbors the belief that she should seek out knowledge broadly: accepting without question everything that happens before her eyes and applying her own experiences to understand it. In truth, it is not uncommon for Samifjod to take the initiative to reach out to other lands, nor is it uncommon for them to matter-of-factly accept what happens there. Columbian engineers like to think of themselves as bringing light to the people of Sami, but the joy they show in technology may be no different to them than plucking a delicious fruit.\nWhen asked her opinion on the matter, Typhon simply replied, 'everything grows from nature.'\n\nTo be honest, it's probably best to just go along with her. If you try anything funny, she'll slap your hand... Hurts pretty bad, too. I've learned my lesson. So right after she repeatedly stressed to me how much the Samifjod respect trees, I had to go to the Convalescent Garden to help prune the branches, and I spent a whole week terrified of running into her.\nWhy only a week? Well, because after that, I found out that she was helping out at the Garden too, haha!\n'This is the only way for trees to grow on this tiny patch of southern soil. You can't help having rules like yours.' Indeed, she's completely right... Later, I came to understand that she considers herself something like a host while in Sami. When we were there, she needed to teach us about their rules and customs, but when she left and it was her turn to be the guest, she needed to learn OUR rules. It's also like this in Sami itself, where every tribe is different. She was probably already used to accommodating differences.\n––From a field operator sent to Sami on a mission",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Many of Typhon's habits are clearly taken from her foster mother, Valarqvin. She was educated in matters pertaining to Originium Arts, and as a result of Valarqvin's extensive pursuit of all knowledge, she developed an interest in all things new. But beyond that, she has also been deeply influenced by Valarqvin's auguries and understanding of fate. Very occasionally, she will display a kind of optimism rooted in stoic acceptance rarely seen in girls her age, allowing her to handle even highly stressful situations with composure.\nHowever, the two are not as tight-knit as we had imagined. At least according to Typhon, she doesn't actually spend much time with her. Perhaps because she had already developed her survival and combat skills by the time Valarqvin became her foster mother, Valarqvin has often been absent without telling her where she was going. This has been happening for as long as Typhon has had clear memories. She was left alone in the darkness to figure out the structure of the Cyclops's cave, and had to find the way out on her own to return to the Sami wilderness.\nFor a hunter, all of Sami is the environment she belongs in, and the Cyclops's cave was but one place to sleep. As such, she has never used the term 'home' to refer to Valarqvin's abode, nor does she call her by anything other than her real name. Day after day, she confronted the dangerous icefields, accumulating the skills to hunt and survive. Yet during this time, she also accumulated all sorts of questions. She would return to the cave with these questions, and if she was lucky enough to catch Valarqvin before she left, she would receive patient and detailed answers from the knowledgeable Cyclops.\n\n'Well, of course she knew that I wanted to go to Rhodes Island to work with you all. She also told me that Maggy would run into some rampaging rockhorns that would overturn our car, and that along the way, there'd be Columbians looking for trouble. And because we were well-prepared, these were all hardly a bump in the road. But she normally doesn't bother telling me that much. Maybe she's really worried about me this time.'\n'Hmm... Why would it be weird for her to worry about me? Well, even if she is, it's not like she needed to follow me to Rhodes Island.\n'She has her own prophecies to follow, and it's nothing you need to worry about. You get used to it.'",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "If it weren't for a few meddling senior operators who grabbed Typhon to get to the bottom of things, we would likely never have realized that her childhood memories are almost completely blank. While she knows that Valarqvin is now her foster mother, she has almost no recollection of her biological parents, not even a vague inkling of what they looked like. All she knows is that she used to live with them before the attack. She remembers a hut far away from the Sami tribes, hidden deep in the forest. The fire always burned brightly in that hut, casting two blurry shadows on the wall. She remembers sitting to the side, taking in that warm scene. Everything else, she learned later from Valarqvin, such as that her horn ornaments and giant bow were left behind by her parents. When Valarqvin rescued her, she initially thought that the contaminated weapon needed to be disposed of, but the young Typhon refused to let go of it, even in her coma.\nTo this day, Typhon still has nightmares from time to time. In these nightmares, she turns into various small, helpless beasts, hunted by shadows so enormous they eclipse the very horizon. Time and again, she sees her nest destroyed, leaving only the bones of her loved ones behind. At first, we analyzed this from the perspective of modern medicine and thought she might have selectively blocked off parts of her memories due to trauma, so we tried to get her to open up. Out of a longing for her parents, she said that she would be glad to recover her memories, and was not afraid of the pain that might come from uncovering such traumatic experiences. So after obtaining her consent, we began conducting preliminary examinations. Unfortunately, we discovered that she did not suffer from selective amnesia, but rather an impairment of memory function from a type of rare brain trauma, which was almost certainly caused by a 'disaster' undetectable to our medical instruments. At Dr. Kal'tsit's orders, we stopped looking into her case any further.\nIn any event, Typhon is now living a comfortable life. While she has never viewed her memory loss as something abnormal, she still misses the warmth of her forgotten parents. In contrast to how most of Terra views life and death, the Samifjod see it as nothing more than the physical form's cessation of movement. By performing certain rituals, the soul can continue to walk freely through the lands, making it possible to meet with ancestors. This belief makes them significantly less afraid of death, as well as easing the pain of separation. It is with this mentality that Typhon roams the wilds of Sami—she believes that somewhere out there, her parents are always watching over her.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "When a beast cub witnesses the death of its parents, it will come back to seek revenge as an adult. Even an herbivore may gouge a gaping wound in the stomach of a predator.\nTyphon has been silently preparing for that day for a long time now. She followed the most seasoned hunters and imitated their techniques. She hid in the cracks between rocks to peek at the northern warriors' drills, and she sought out knowledge from Arges. Perhaps only Arges saw the great determination hidden within this child, and as always, the Cyclops did not stop her.\nFinally, one last problem remained before her: how would she locate her enemy?\nShe thought it would take a long, long journey, but in reality, she found it the moment that idea was born.\nOr more accurately, it was her enemy that found her, as she felt an unusual weight from the bow on her back.\nFollowing this 'feeling,' Typhon tracked down the demon-contaminated beast for the first time, and began to regard hunting it as her duty.\nAnd that battle is still not over.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1310,
      "atk": 867,
      "def": 92,
      "magicResistance": 0,
      "blockCnt": 1,
      "baseAttackTime": 2.4,
      "respawnTime": 70,
      "cost": 24
    }
  },
  "skins": [
    {
      "skinId": "char_2012_typhon#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_2012_typhon",
      "portraitId": "char_2012_typhon_1",
      "illustId": "illust_char_2012_typhon_1",
      "modelName": "Typhon",
      "drawerList": [
        "LM7"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_2012_typhon#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_2012_typhon_2",
      "portraitId": "char_2012_typhon_2",
      "illustId": "illust_char_2012_typhon_2",
      "modelName": "Typhon",
      "drawerList": [
        "LM7"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_2012_typhon@summer#17",
      "skinName": "Temperature Difference RT.RX07",
      "skinGroupName": "Coral Coast/XVII",
      "skinGroupId": "2024#summer#2",
      "avatarId": "char_2012_typhon_summer#17",
      "portraitId": "char_2012_typhon_summer#17",
      "illustId": "illust_char_2012_typhon_summer#17",
      "modelName": "Typhon",
      "drawerList": [
        "LM7"
      ],
      "description": "<color name=#ffffff>MARTHE [Coral Coast] Temperature Difference Series Swimming Suit Type RX07. Attached with various accessories for convenient use. The special material is fire and cold-proof, suitable for activities in a variety of waters.</color>",
      "rarity": 95
    },
    {
      "skinId": "char_2012_typhon@wild#9",
      "skinName": "Northern Pathfinder",
      "skinGroupName": "Vitafield/IX",
      "skinGroupId": "2023#wild#3",
      "avatarId": "char_2012_typhon_wild#9",
      "portraitId": "char_2012_typhon_wild#9",
      "illustId": "illust_char_2012_typhon_wild#9",
      "modelName": "Typhon",
      "drawerList": [
        "LM7"
      ],
      "description": "<color name=#ffffff>Vitafield [Rewilder] Series Classics/Northern Pathfinder. Made with special materials with function in mind, perfect for meeting your various needs and weathering even the roughest conditions.</color>",
      "rarity": 129
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "4-4",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 775,
            "atk": 498,
            "def": 54,
            "magicResistance": 0,
            "cost": 22,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.4,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1034,
            "atk": 693,
            "def": 73,
            "magicResistance": 0,
            "cost": 22,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.4,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "4-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1034,
            "atk": 693,
            "def": 73,
            "magicResistance": 0,
            "cost": 24,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.4,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1310,
            "atk": 867,
            "def": 92,
            "magicResistance": 0,
            "cost": 24,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.4,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3241",
          "count": 5,
          "type": "MATERIAL"
        },
        {
          "id": "30062",
          "count": 5,
          "type": "MATERIAL"
        },
        {
          "id": "30052",
          "count": 4,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "4-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1310,
            "atk": 867,
            "def": 92,
            "magicResistance": 0,
            "cost": 24,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.4,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 1702,
            "atk": 1045,
            "def": 113,
            "magicResistance": 0,
            "cost": 24,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.4,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3243",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30115",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "31044",
          "count": 7,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skcom_quickattack[3]",
      "skillName": "Swift Strike γ",
      "desc": "ATK <@ba.vup>+{atk:0%}</>; ASPD <@ba.vup>+{attack_speed}</>",
      "iconId": "skcom_quickattack",
      "spCost": 35,
      "initSp": 15,
      "duration": 35,
      "blackboard": [
        {
          "key": "atk",
          "value": 0.45
        },
        {
          "key": "attack_speed",
          "value": 45
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31064",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30063",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 9,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_typhon_2",
      "skillName": "Order of the Icefield",
      "desc": "ATK <@ba.vup>+{atk:0%}</>, each attack fires off <@ba.vup>2</> arrows (prioritizing different targets), and has a <@ba.vup>{attack@prob:0%}</> chance of stunning targets for <@ba.vup>{attack@stun}</> seconds\n<@ba.rem>From second activation and on, this skill has unlimited duration</>",
      "iconId": "skchr_typhon_2",
      "spCost": 50,
      "initSp": 42,
      "duration": 20,
      "blackboard": [
        {
          "key": "atk",
          "value": 0.5
        },
        {
          "key": "attack@prob",
          "value": 0.4
        },
        {
          "key": "attack@stun",
          "value": 1
        },
        {
          "key": "first_duration",
          "value": 20
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30083",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 9,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_typhon_3",
      "skillName": "'Eternal Hunt'",
      "desc": "Immediately marks a target within range, Attack Interval <@ba.vdown>lengthens significantly</>, and attacks become a hail of arrows aimed at the marked target; the hail of arrows will randomly strike enemies around the marked target, dealing <@ba.vup>{attack@s3_max_hit_num}</> hits of <@ba.vup>{attack@s3_atk_scale:0%}</> ATK as Physical damage and stunning targets hit for <@ba.vup>{attack@s3_stun}</> seconds\n<@ba.rem>Skill activation grants {attack@s3_trigger_time} ammo and the skill ends when all ammo is used (Can manually deactivate skill)</>",
      "iconId": "skchr_typhon_3",
      "spCost": 40,
      "initSp": 25,
      "duration": -1,
      "blackboard": [
        {
          "key": "base_attack_time",
          "value": 3.1
        },
        {
          "key": "attack@s3_stun",
          "value": 0.4
        },
        {
          "key": "attack@s3_atk_scale",
          "value": 1.75
        },
        {
          "key": "attack@s3_trigger_time",
          "value": 10
        },
        {
          "key": "attack@s3_max_hit_num",
          "value": 5
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31053",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 10,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_typhon",
      "moduleName": "Typhon's Badge",
      "desc": "Operator Typhon has demonstrated a remarkable aptitude for maintaining distance whilst conducting suppressive fire against enemies of heavy caliber.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Sniper Operator during field operations to exercise Besieger responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_typhon",
      "moduleName": "Ammadikshu",
      "desc": "Bundled up in felt caps and scarves covering half their faces, the married couple come to a stop and cautiously, respectfully, withdraw the bloody beastmeat from their luggage. They drip the blood onto the tree root, and drape the meat atop a branch. Thereafter, they let out a string of perfunctory syllables, ones that even they don't know the meaning of.\nNot far away, their daughter skips about on her feet. She'd want to hold onto her parents' hands, but today her own hands are occupied. It's her first time headed outdoors with her own weapon, like the grownups do. She remembers how her parents taught her that to take up a weapon is to fight, and fighting demands she be vigilant at all times, so she always keeps her bow in hand, arrow nocked on string.\n'We have to teach her these things,' she hears her mother say. 'Teach her how to draw her bow, sharpen her knife, lay her traps. Teach her not to fear, to have the skill to meet any battle... That's the only way she'll survive. There'll come a day when they find out we're Sarkaz. Nowhere accepts the Sarkaz.'\n'Listen... you promised me we'd never go back to our old lives.' That's her father's voice. 'And... you promised her. Don't you remember? There was a rainbow that day. You watched as I ran into the forest with a kneeplate, to try and catch it with.'\n'She wasn't born yet then... oh, never mind.' Her mother's voice becomes soft, tender. 'I'll teach her, but I'll pray too, even if it's absurd for a Sarkaz to pray for the blessings of Sami. So long as they don't find us deserters...'\nTheir voices gradually fade, for the girl has her attention drawn by a roughly hewn wooden carving to a side of the path. She knows that where it points to will be a hollow filled with wonderful things, and that when her parents run out of something at home, and can think of no solution, they search for hollows like those. She wants a knot in rainbow colors, and so she follows the pointed direction, squeezing through the gaps in the trees, freeing one hand to collect berries along the way, plus some pretty stones, all of which she tosses into her quiver, preparing to exchange with the hollow.\nEventually, unwittingly, she has entered the thicket where the wild beasts lie in wait.\n......\nIn later years, the Sarkaz girl forgets all she experienced in childhood. Forgets how her parents called her name as they searched for her, forgets the colors of the knot on her wrist when she lifted her hands to surprise them.\nAnd she forgets, too, her parents' reaction.\n'You see, you see how it was she survived...' The man calls his lover near, all the while pointing at her quiver, incredulous.\nAnd so the Sarkaz couple sees that at the bottom of the tiny quiver, there lies the damp trace of melted snow."
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "Close your eyes, don't rush to open them. They may feel slightly hot, that's normal... Shh, stay calm, I crushed some herbs to help your eyes relax. You must have been staring at some dangerous thing. I do that a lot, trust me.",
      "voiceAsset": "char_2012_typhon/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "A guide...? I guess Simone is a better fit for the job. She's also a veteran hunter like me, so I know you'll be in good hands, and won't get into... trouble. There have been some misunderstandings and a few tribes now turn me away. Just remember, if anyone tells you I'm a man eater, they're lying.",
      "voiceAsset": "char_2012_typhon/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Hands off. I've told you before, no one gets to touch my bow. Not you, not the smiths. You don't have the skills to hunt shadows in the depth of Sami, so you shouldn't draw their attention. I know your kind, I know you're curious. I'll just repeat myself over, over, and over again until I get through to you.",
      "voiceAsset": "char_2012_typhon/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Check the logs from the research teams. See? These little hornbeasts are friends, they're harmless. And this kind of snow needs Arts to control, so call me if you run into some. Good, go ahead and add some notes to these pictures, you're pretty clever. Why the look? Is it so strange that I know how to use electronics?",
      "voiceAsset": "char_2012_typhon/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "You all are strange, just like Magallan, insisting on comprehending the land on your own terms. I've seen your hard work, you'll come to know the whole of Sami as you see her in your dreams someday. But now? You aren't there yet. I'm worried about you, but since we're working together, just listen to me and you'll be fine.",
      "voiceAsset": "char_2012_typhon/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "Put that navigation instrument down, you're no professional, it's wearing you out just carrying it around. Let me lead the way, just like Arges used to do for me. She always says pitfalls and pains guide you to destiny, but I find I can get where I want by just following the sound of the breeze and the twigs in the trees.",
      "voiceAsset": "char_2012_typhon/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "You've never tried sleeping on a cave floor before? What about a bed made of vines? You should give it a try, I can't get a good night's sleep if I don't hear the heartbeat of Sami. How could I even close my eyes if I can't wake the moment I get a vision...? Yes, I have a lot of nightmares, what about it?",
      "voiceAsset": "char_2012_typhon/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "...You called for me? Did you come across some trouble? If everything's fine, let me sit here alone for a while... I'm looking at the dead. The unsullied dead will walk among the beasts of the forest... I'm still looking for my parents.",
      "voiceAsset": "char_2012_typhon/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "Have I ever gotten lost? Hmm... Maybe. I left my home at first to find revenge, but when I saw all that sullied snow, I could only think to draw my bow and aim, to show the shadows that I was the true hunter. Can you be a hunter, too? Or can you be a companion to carry me out of danger when I'm hurt?",
      "voiceAsset": "char_2012_typhon/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Does the Doctor have the same kind of dreams that I do? Hm, probably not, we aren't in Sami, after all... Lucky enough for you, the shadows won't be chasing you through your dreams then.",
      "voiceAsset": "char_2012_typhon/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "If you come across any abnormalities while we're working together, I'll take care of them for you... Codename? Typhon is my only name. I found it on the horn ornament my mother left behind. Some people say it sounds scary, though.",
      "voiceAsset": "char_2012_typhon/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "Are you trying to show off your camera skills? No...? But how can you even call this combat experience, if you don't experience it yourself?",
      "voiceAsset": "char_2012_typhon/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "Um, what's this promotion badge for again? If it's useless in combat, then let's wait until we settle the danger right in front of us, then you tell me the story behind it.",
      "voiceAsset": "char_2012_typhon/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "Many travelers to Sami find death in avalanches caused by loud boasting, or other arrogant behavior. They never even get a chance to see Sami's shadow. You won't make the same kind of mistake, not with me accompanying you.",
      "voiceAsset": "char_2012_typhon/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Take these weapons and tools. We need them more than extra hands.",
      "voiceAsset": "char_2012_typhon/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Got it, I'll take the lead. Don't be nervous, I can handle this.",
      "voiceAsset": "char_2012_typhon/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Stay close, don't run off.",
      "voiceAsset": "char_2012_typhon/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Don't let them out of sight, even if your eyes are hurting.",
      "voiceAsset": "char_2012_typhon/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Stay calm and make your move. No need to worry, I've got your back.",
      "voiceAsset": "char_2012_typhon/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "What do you need of me?",
      "voiceAsset": "char_2012_typhon/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Time to choose our prey.",
      "voiceAsset": "char_2012_typhon/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Good timing.",
      "voiceAsset": "char_2012_typhon/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "I'll pin you to your shadow.",
      "voiceAsset": "char_2012_typhon/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Cowards break the silence first.",
      "voiceAsset": "char_2012_typhon/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Nature should not be disturbed.",
      "voiceAsset": "char_2012_typhon/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Get out of my home!",
      "voiceAsset": "char_2012_typhon/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Each of my arrows slows the black that taints the Sami snow.",
      "voiceAsset": "char_2012_typhon/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "I see you managed to complete a mission without causing any unnecessary pain to the quarry. Um, not bad, not bad. Sip a hot drink and get some rest.",
      "voiceAsset": "char_2012_typhon/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "If you've run out of arrows or let your target escape, then you should give up the chase. You've already lost.",
      "voiceAsset": "char_2012_typhon/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Grasp these seeds tightly in your hand, and run. Don't look back. I'll take care of things here.",
      "voiceAsset": "char_2012_typhon/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Can you explain how these machines work? I've got a good memory, Magallan explained the structure of the research station last time, and I still remember it all... Well, at least, I think I do.",
      "voiceAsset": "char_2012_typhon/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Nope, you'll have to be faster than that to even think about faking an attack.",
      "voiceAsset": "char_2012_typhon/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Do you have someone you trust standing guard? I want to rest for a bit, your camp is so warm…",
      "voiceAsset": "char_2012_typhon/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_2012_typhon/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Oh, there have been more and more people celebrating this festival. Will you have a feast too? What about fireworks? Always? Seems I've come to the right place. I'm going to look around for activities I've never tried before, so you don't have to entertain me.",
      "voiceAsset": "char_2012_typhon/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "What's up, Doctor. Where have you been? You're not lost, are you?",
      "voiceAsset": "char_2012_typhon/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "I helped you find a safe spot. Trees, water from freshly melted snow, the rotting flesh of beasts buried in the soil—you have to thank them for joining your spirit and letting you walk on this land. Come, take my hand.",
      "voiceAsset": "char_2012_typhon/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "It's good practice to always check up on your prey, because the hunt never truly ends. I've seen you defeat many opponents and save many lives. Good on you, but... you wish to fully wipe your enemy from the face of this land? No, a permanent extermination is just wrong.",
      "voiceAsset": "char_2012_typhon/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "meet_spd&sami[000]",
      "buffName": "Icefield Navigation",
      "desc": "When this Operator is assigned to the Reception Room, increases Clue search speed by <@cc.vup>10%</>, and when assigned together with another <$cc.g.sm><@cc.kw>Sami</></> Operator, increases Clue search speed by an additional <@cc.vup>5%</> while self Morale loss per hour <@cc.vdown>+0.5</>",
      "skillIcon": "bskill_meet_spd&sami",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "train_spd&profession3[170]",
      "buffName": "Combat Techniques: Besieger",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, <@cc.kw>Sniper</> Operators' Specialization training speed <@cc.vup>+30%</>; if the trainee's Job Branch is <@cc.kw>Besieger</>, training speed will be further increased by <@cc.vup>+45%</>",
      "skillIcon": "bskill_train_siegesniper",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}