{
  "id": "char_206_gnosis",
  "meta_info": {
    "name": "Gnosis",
    "appellation": " ",
    "voiceActor": {
      "en": "Charles Aitken",
      "jp": "Hikaru Midorikawa",
      "kr": "Jun Seung-hwa",
      "cn": "Flynn Liu"
    },
    "rarity": 6,
    "profession": "Supporter",
    "subProfessionId": "Hexer",
    "position": "RANGED",
    "team": "Karlan Trade",
    "tagList": [
      "Debuff"
    ],
    "nationId": "Kjerag",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Gnosis\n[Gender] Male\n[Combat Experience] None\n[Place of Birth] Kjerag\n[Date of Birth] Dec 11\n[Race] Liberi\n[Height] 188cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Standard\n[Mobility] Standard\n[Physical Resilience] Standard\n[Tactical Acumen] Excellent\n[Combat Skill] Standard\n[Originium Arts Assimilation] Excellent",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Former CTO of Karlan Trade. Joined Rhodes Island as an operator via special agreement between Karlan Trade and Rhodes Island.\nDirected a multitude of core technological developments as well as planned industrial facilities for Karlan Trade; he also did in-depth research on Originium during his time there. Currently a member of Rhodes Island's principal laboratory, working on cutting-edge research.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Gnosis shows no signs of infection.\n\n[Blood Originium-Crystal Density] 0.14u/L\nOperator Gnosis's blood Originium-crystal density is relatively high among Kjerag's non-Infected, likely impacted by his Originium research while there. However, he shows clear and comprehensive understanding of appropriate protective measures, and so currently presents little cause for concern.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "His codename Gnosis, meaning 'knowledge' or 'insight,' is said to be his real name. And as the name implies, he has extreme insight and an inexhaustible thirst for knowledge.\nIn some ways, Gnosis fits the stereotype of a researcher to a T, being unamenable to reason and unkind with his words.\nThis indifference of his doesn't change one bit in front of SilverAsh, so it surprises people to learn that he was actually SilverAsh's partner in founding Karlan Trade.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Since the earliest records of Kjerag's history, Gnosis's family—the Edelweisses—were keepers of precious documents and ancestry records for the whole region. Thus, the whole family's calling from generation to generation was to protect, write, and manage these records.\nGnosis's obsession with research comes from these ancestral duties.\nIt could be said Gnosis serves as an ideal researcher.\nHe has next to no desires, and has practically no interest in anything outside of research. He possesses the proactiveness and competence to transform his ideas into reality, electing to personally lead teams to obtain any necessary materials or tools that cannot be found at Rhodes Island. And once he concentrates on his research, he becomes a precise instrument—in the several experiments he's taken part in, he's never once made the slightest mistake.\nAt the same time, he's also rather apathetic regarding life and morality. We find it hard to call this a strong point, but it must be recognized that a portion of scientists hold moral stances different from an ordinary person, and prominent figures among these scientists often make startling breakthroughs not endorsed by common ethics. Rhodes Island by no means believes that ways of thinking that fall below our standards are needed to promote advancement in science, but we are unable to deny that the purer the scientist, the more likely they are to show deviation on moral issues. And for matters relating to the Infected, this goes doubly so.\nThis aspect of Gnosis was initially the focus of a high-level investigation, since a researcher of his caliber would undoubtedly be an asset to Rhodes Island, but if he was unable to identify with our perspective on the Infected, or was unwilling to abide by our policies, then we would be forced to part ways.\nGnosis did not disappoint us. He even surprised us with his willingness to conduct research related to the Infected following Rhodes Island's standard procedures.\nIn fact, when we submitted this requirement, he wasn't the least bit surprised. Presumably this was not because of whatever views he has on the Infected, but rather because he was already used to working under such constraints.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "The Silverashes and Edelweisses have always been close, with the two families' children growing up alongside each other and being jointly educated as a matter of course. SilverAsh and Gnosis are no exception.\nUnlike the numerous relatively radical policies SilverAsh implemented after founding Karlan Trade, his father—Olafur Silverash—was quite moderate and thus did not meet any opposition from the conservatives of Kjerag when first establishing its variegated industrial foundations. Thanks to his firm character and skilled finesse, Olafur was quite loved and respected in Kjerag, a world apart from SilverAsh's future situation. Of course, we know by now that there were reasons that SilverAsh could not avoid this.\nIn brief, while Olafur and his wife may have been the fiends that sullied Kjerag in the eyes of some its more obstinate people, to the majority they had always been a model couple that thought of the citizens as they led them.\nThe couple's death was first assumed to have been plotted by Gnosis's father, but was ultimately ascribed to an accident. This meant the Edelweisses were not directly put on trial. However, the fact that their passing occurred within the Edelweiss domain still inspired more than a little slander. In an isolated environment like Kjerag, one tiny mistake can be engraved in the collective memory for generations, much less the framing of a great family's leader. This hounded every member of the Edelweiss family, who chose in the end to leave.\n'You want to gain as full an understanding as possible of those working under you. I have no objections to this notion, and so I am willing to disclose the full history of my family. This does not, however, mean that I must tell you what went through my mind as I left Kjerag.'\n'I made an appointment with him to meet again in future?'\n'...How could that be?'\n'However, even if he hasn't come, I will still return.'",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "The infatuation Gnosis displays with scientific research aboard Rhodes Island is undeniably real, but it's confused a few of the people in the loop about the Snowcap Incident. Is he truly the same Gnosis who bore humiliation as part of SilverAsh's plans?\nOf course he is.\nThe Doctor never actually came into direct contact with Gnosis during the trip to Kjerag, nor could we learn anything about his personality from all the files we could assemble on the various angles of the Snowcap Incident after the fact.\nWe only know that a good deal of people were discontent with his first return to Kjerag while openly using the Edelweiss name, and that following that, when he and SilverAsh jointly founded Karlan Trade, SilverAsh defied majority opinion by having him hold the post of CTO. He reciprocated this display of trust by bringing a wide array of technologies to Karlan Trade. But just as Kjerag didn't welcome Gnosis, so they didn't welcome Karlan Trade either. Because he only saw the ends, means be damned, the people who worked under him, while acknowledging his talents, had many complaints. This is without mentioning the rumors that his parents were responsible for the deaths of SilverAsh's, so it mystified people that he was willing to give him such a lofty position. As they wouldn't dare question SilverAsh, the blame naturally fell on Gnosis himself.\nThis is all fact. Even after coming to Rhodes Island, his personality is still disliked by many operators. However, after seeing his unconcealed obsession with science, we can now see why he took such a dishonorable role in the Snowcap Incident.\nBecause he doesn't care.\nThis isn't to say he's the kind who doesn't understand others' feelings. Precisely the opposite; he's exceptionally clear-headed on what he wants to do, and as such he can detach himself from any other concerns.\nResearchers are often quite indifferent to everyday routine. They have sufficient mental energy to treat scientific principles objectively, but not necessarily enough left over to deal with personal emotions. Thus, a good few choose to cut themselves off as thoroughly as possible. Gnosis is clearly one of these types, and to him, the joint founding of Karlan Trade, and behind that, SilverAsh's concern for Kjerag's future, are the few fetters that exist for him. Aside from his work, that is the one and only thing he cares about.\nAnd just as he's willing to devote his heart and soul to his research, he'll actually do the same for Karlan Trade's affairs. Even though he'll never admit it, nor will anyone else ever understand.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "When Gnosis first joined Rhodes Island, after spending a minimal amount of time reading a mass of information, he gave a number of relatively drastic proposals and suggestions. This has happened before, and each time it is a protracted battle as the parties hunker down. Though Rhodes Island is prepared for such things, the inconvenience is still palpable, especially with Gnosis's first impression being of the sort of researcher that's hardest to get along with.\nBut unexpectedly, after receiving objections, Gnosis didn't seem one bit taken aback and moreover showed his willingness to accept our restrictions, surprising everyone present. He's never given any explanation for this.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1587,
      "atk": 377,
      "def": 116,
      "magicResistance": 25,
      "blockCnt": 1,
      "baseAttackTime": 1.6,
      "respawnTime": 70,
      "cost": 13
    }
  },
  "skins": [
    {
      "skinId": "char_206_gnosis#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_206_gnosis",
      "portraitId": "char_206_gnosis_1",
      "illustId": "illust_char_206_gnosis_1",
      "modelName": "Gnosis",
      "drawerList": [
        "竜崎いち"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_206_gnosis#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_206_gnosis_2",
      "portraitId": "char_206_gnosis_2",
      "illustId": "illust_char_206_gnosis_2",
      "modelName": "Gnosis",
      "drawerList": [
        "竜崎いち"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_206_gnosis@boc#4",
      "skinName": "Forerunner",
      "skinGroupName": "Bloodline of Combat/IV",
      "skinGroupId": "2022#boc",
      "avatarId": "char_206_gnosis_boc#4",
      "portraitId": "char_206_gnosis_boc#4",
      "illustId": "illust_char_206_gnosis_boc#4",
      "modelName": "Gnosis",
      "drawerList": [
        "竜崎いち"
      ],
      "description": "<color name=#ffffff>Bloodline of Combat Collection/Forerunner. Following the Vine-Bear Court's final meeting of the Tri-Clan Council, Gnosis formally assumed the post of inaugural Speaker of the Parliament of Kjerag by SilverAsh's recommendation.</color>",
      "rarity": 138
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "y-2",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 798,
            "atk": 205,
            "def": 61,
            "magicResistance": 15,
            "cost": 11,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1174,
            "atk": 294,
            "def": 88,
            "magicResistance": 15,
            "cost": 11,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "y-6",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1174,
            "atk": 294,
            "def": 88,
            "magicResistance": 20,
            "cost": 13,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1587,
            "atk": 377,
            "def": 116,
            "magicResistance": 20,
            "cost": 13,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3271",
          "count": 5,
          "type": "MATERIAL"
        },
        {
          "id": "30022",
          "count": 8,
          "type": "MATERIAL"
        },
        {
          "id": "30042",
          "count": 5,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "y-6",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1587,
            "atk": 377,
            "def": 116,
            "magicResistance": 25,
            "cost": 13,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 2035,
            "atk": 455,
            "def": 132,
            "magicResistance": 25,
            "cost": 13,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3273",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30145",
          "count": 3,
          "type": "MATERIAL"
        },
        {
          "id": "31024",
          "count": 7,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_gnosis_1",
      "skillName": "High-Speed Cogitation",
      "desc": "The next attack deals <@ba.vup>{atk_scale:0%}</> ATK as Arts damage and attacks <@ba.vup>twice</> consecutively",
      "iconId": "skchr_gnosis_1",
      "spCost": 4,
      "initSp": 0,
      "duration": -1,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 1.7
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30083",
              "count": 9,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_gnosis_2",
      "skillName": "Zero-Point Burst",
      "desc": "Deals <@ba.vup>{atk_scale:0%}</> ATK as Arts damage to all enemies within Attack Range and inflict <$ba.cold>Cold</> for <@ba.vup>{cold}</> seconds; <$ba.charged>Charged</> effect: Inflicts an additional layer of <$ba.cold>Cold</>",
      "iconId": "skchr_gnosis_2",
      "spCost": 6,
      "initSp": 0,
      "duration": -1,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 2
        },
        {
          "key": "cold",
          "value": 4
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31013",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_gnosis_3",
      "skillName": "Hypothermia",
      "desc": "ASPD <@ba.vup>+{attack_speed}</> and attacks <@ba.vup>{max_target}</> enemies simultaneously; Extend the effect duration of <$ba.frozen>Frozen</> enemies within Attack Range until the skill ends, then deal <@ba.vup>{atk_scale:0%}</> ATK as Arts damage to all <$ba.frozen>Frozen</> enemies and remove the <$ba.frozen>Frozen</> effect when the skill ends; Prioritizes enemies that are not <$ba.frozen>Frozen</>",
      "iconId": "skchr_gnosis_3",
      "spCost": 40,
      "initSp": 25,
      "duration": 13,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 6
        },
        {
          "key": "attack_speed",
          "value": 130
        },
        {
          "key": "max_target",
          "value": 2
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30063",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_gnosis",
      "moduleName": "Gnosis's Badge",
      "desc": "Operator Gnosis has demonstrated a remarkable aptitude for coercing frailty within the enemy via manipulation of snowstorm conditions.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Supporter Operator during field operations to exercise Hexer responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_gnosis",
      "moduleName": "'Vow'",
      "desc": "In the wake of Kjerag slowly gaining fame, so too have Kjerag's snowcaps become better and better known.\nAmong them, nevermelting Originium ice crystals, as a symbol of sincerity, have become even more sought after.\nSuch ice crystals do exist, but acquiring them is a challenge. Only at the peaks of the most dangerous summits might they possibly be found. Numerous people drawn by the allure have ultimately found themselves leaving empty-handed.\nStill, not a problem for Gnosis. The Edelweisses—once generational guards of Kjerag's archives—would know the Snow Realm better than anyone.\nIn his eyes, the difficulty lies in the climb.\nIndeed, despite spending his childhood years in Kjerag, he much prefers absorbing himself in archives. His family relocating to Victoria only saw him devote practically all his time to studies.\nThus, even after he'd followed Enciodes back to Kjerag, he never once showed any interest in taking on the mountains.\nBut today, he sets foot into them alone, following an ancient notebook as he ascends a remote peak. There, Originium ice crystals wait in silence for their unearthers.\nAs he regards them, Gnosis cannot help but reminisce.\nThe dream was power and prosperity for the nation of Kjerag, but the method of realizing it continually evolved as he studied in Victoria. His ultimate conclusion, he had to accept, ran counter to that future he and Enciodes had envisioned together in their youth.\nWhich was why, he recalls, that as they parted and made their promise, he felt an unprecedented shred of defiance—would Enciodes come to Victoria? And should he, and should the rift in their consensus be impassable, what then?\nIt came to be that Enciodes did arrive. Never had they clashed before, but they knew how each other's ideals had diverged in parts. Even so, with a shared dream in mind, still they firmly took each others' hands.\nAmidst the Snowcap Incident, he thought to play him at his own game, to employ more radical methods to corner Enciodes.\nThought, assessment, hesitance, and thought again. In a desolate corner, idea upon idea spun through his mind. He could do it himself, he thought. In the end, he did nothing.\nWhen in that room they put hand in hand once again, he knew his choice had been foregone.\nIt seems Enciodes has conveyed the Doctor an ice crystal. Gnosis has decided to procure one too, but does not plan to gift it to anyone.\nWith the Snowcap Incident behind them, on this day as banal as any other, he treads alone into the mountains for one thing only—he wants to forge this ice crystal into a sword. A gift for himself.\nThe blade it creates would be useless in combat. Should he ever replace his weaponry, it'll need to be made separately. But that is of no consequence, for he has no plans to fight with this blade. No, it won't even see the light of day. It'll remain hidden, forever.\nThe crystal symbolizes unwavering loyalty. Never has he shown such a thing to Enciodes, and never will he. He will be faithful only to his own choices.\nAnd his choice is—\nThe comms terminal at his belt vibrates. A communications network has been erected across the whole of Kjerag by now. Even upon the snowcaps, one can receive dispatches.\n'You have a meeting.'\n'Understood.'\nCarefully, he chisels off an Originium ice crystal and stows it away, before heading back down the mountain.\nBeing the CTO of Karlan Trade, his free time is few and far between."
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "I can spend some time discussing matters with you before my next experiment.",
      "voiceAsset": "char_206_gnosis/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "You are spending far too much time outside the laboratory, Doctor. As a researcher, you must know this only hinders you from making great strides.",
      "voiceAsset": "char_206_gnosis/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "SilverAsh's sisters? Yes, I've met them several times... Hm...? What more do you want me to say? I know nothing about those frolicsome, ever-changing creatures, and I certainly am not interested in them.",
      "voiceAsset": "char_206_gnosis/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "It is incredibly ignorant to simply write off the symptoms that arise upon Oripathy infection as a mere disease, and then to go on to think only about how to 'control' and 'heal' this disease. Don't tell me this is how you think as well.",
      "voiceAsset": "char_206_gnosis/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "Shining. I knew I would find her here... Hm? No, she is an excellent scholar, and we collaborated for a period of time until she disappeared one day. That's all.",
      "voiceAsset": "char_206_gnosis/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "I am not working for SilverAsh; our objectives merely overlap. Of course, I won't deny what he is trying to achieve holds great significance for the future of the Snow Realm.",
      "voiceAsset": "char_206_gnosis/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "The best way you can earn my trust is by showing me your true academic strengths, and it seems you've already realized as much, Doctor. I am not like SilverAsh. I am not interested in deeper emotional exchanges.",
      "voiceAsset": "char_206_gnosis/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "If you understand SilverAsh well enough, you know he is not a callous man. From my point of view, he might even be a little indecisive... That, is your weakness too, Doctor.",
      "voiceAsset": "char_206_gnosis/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "Much like SilverAsh's, your endeavors require the help of countless supporters. However, the more supporters you have, the more you have to worry about. Since you cannot disregard them, you should avoid getting entangled. That is my one and only piece of advice for you, Doctor.",
      "voiceAsset": "char_206_gnosis/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "It seems you are rather lax in maintaining your own health, Doctor.",
      "voiceAsset": "char_206_gnosis/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Pleasure to finally make your acquaintance, Doctor of Rhodes Island. I've been eager to meet you ever since Karlan began its relationship with your company. You may call me Gnosis.",
      "voiceAsset": "char_206_gnosis/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "War is merely a means to an end. That said, if you claim there are more efficient ways, I'm happy to learn.",
      "voiceAsset": "char_206_gnosis/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "I am far more interested in gaining access to Rhodes Island's databases than I am in a salary increase.",
      "voiceAsset": "char_206_gnosis/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "If Rhodes Island is willing the cross the line, I am sure you will see results that far surpass what you are currently achieving... That said, with SilverAsh as an example, I do understand the reasons behind your convictions. Hmph, allow me to offer a helping hand, then.",
      "voiceAsset": "char_206_gnosis/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "You're in luck. I just completed my experiment.",
      "voiceAsset": "char_206_gnosis/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Fulfill your roles, and leave the rest to me.",
      "voiceAsset": "char_206_gnosis/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "I can only hope this mission won't prove to be a waste of time.",
      "voiceAsset": "char_206_gnosis/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Follow the plan.",
      "voiceAsset": "char_206_gnosis/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Right.",
      "voiceAsset": "char_206_gnosis/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "You disrupted my train of thought, Doctor.",
      "voiceAsset": "char_206_gnosis/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "A fine choice.",
      "voiceAsset": "char_206_gnosis/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Let's put an end to this as soon as possible.",
      "voiceAsset": "char_206_gnosis/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "As expected.",
      "voiceAsset": "char_206_gnosis/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "I have an idea.",
      "voiceAsset": "char_206_gnosis/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "What a ruckus.",
      "voiceAsset": "char_206_gnosis/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Do not disrupt my thought process.",
      "voiceAsset": "char_206_gnosis/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "I look forward to seeing such spectacular results from you in your research, Doctor.",
      "voiceAsset": "char_206_gnosis/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Having prepared appropriately, these results are unsurprising.",
      "voiceAsset": "char_206_gnosis/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Sometimes, there is much to gain from the unexpected.",
      "voiceAsset": "char_206_gnosis/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Were there too many variables outside our control...?",
      "voiceAsset": "char_206_gnosis/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Time to head to the lab.",
      "voiceAsset": "char_206_gnosis/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Hey.",
      "voiceAsset": "char_206_gnosis/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "I have an idea. Care to hear it?",
      "voiceAsset": "char_206_gnosis/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_206_gnosis/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "My experiences of Kjerag inform me that today will be a raucous day... Well, Doctor, I still have experiments to perform, so if you'll excuse me. As compensation, I will provide you some novel research results. Oh, one more thing: Happy New Year.",
      "voiceAsset": "char_206_gnosis/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "You should spend your time more efficiently, Doctor.",
      "voiceAsset": "char_206_gnosis/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "I've gathered from the hollering and hooting of the operators out here that today is your birthday. This book will serve as your birthday present. Accept, and then I ask you to please pacify the people outside the laboratory... SilverAsh is here too? Hmm, it seems you do carry a beyond-average estimation in his eyes.",
      "voiceAsset": "char_206_gnosis/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "Celebrate, out there? I have no interest. I've made my way out of the laboratory and given you my greetings, so there is no further reason this occasion should keep me, unless you think I can produce novel research results for you in conditions this clamorous.",
      "voiceAsset": "char_206_gnosis/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "control_mp_cost&faction[030]",
      "buffName": "Hidden Mastermind",
      "desc": "When this Operator is assigned to the Control Center, increases Morale recovery per hour of all Operators in the Control Center by <@cc.vup>+0.05</> for each <$cc.g.karlan><@cc.kw>Karlan Trade</></> Operator assigned to the Control Center",
      "skillIcon": "bskill_ctrl_karlan",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "control_tra_limit&spd[000]",
      "buffName": "Precise Calculations",
      "desc": "When this Operator is assigned to the Control Center, all <$cc.g.karlan><@cc.kw>Karlan Trade</></> Operators assigned to Trading Posts gain order acquisition efficiency <@cc.vdown>-15%</> and order limit <@cc.vup>+6</>",
      "skillIcon": "bskill_ctrl_t_limit&spd",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}