{
  "id": "char_1023_ghost2",
  "meta_info": {
    "name": "Specter the Unchained",
    "appellation": " ",
    "voiceActor": {
      "en": "Harriet Carmichael",
      "jp": "Azumi Asakura",
      "kr": "Kim Hyeon-sim",
      "cn": "Angel Zhang"
    },
    "rarity": 6,
    "profession": "Specialist",
    "subProfessionId": "Dollkeeper",
    "position": "MELEE",
    "team": "Abyssal Hunters",
    "tagList": [
      "DPS",
      "Fast-Redeploy"
    ],
    "nationId": "Ægir",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Specter\n[Gender] Female\n[Combat Experience] Seven years\n[Place of Birth] Ægir\n[Date of Birth] July 27\n[Race] Ægir\n[Height] 165cm\n[Infection Status]\nNo Originium crystals are visible on the surface of the body, but confirmed Infected by medical examination. \nOperator Specter's infection symptoms are rather unique, and are undergoing clinical research.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Outstanding\n[Mobility] Excellent\n[Physical Resilience] Outstanding\n[Tactical Acumen] Standard\n[Combat Skill] Excellent\n[Originium Arts Assimilation] Flawed",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Specter, real name Laurentina, is a member of the 'Abyssal Hunters,' an Ægir military squad. She has demonstrated extreme proficiency in operations such as taking down large-scale organisms and destroying hard targets. \nAfter the 'Stultifera Navis' incident, her mental state and mood began to stabilize, and her memories returned.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests show the indistinct outlines of internal organs, obscured by abnormal shadows. Originium granules detected in the circulatory system. The subject is confirmed to be infected with Oripathy.\n\n[Cell-Originium Assimilation] 14.5% \nIt has been determined that the source of her nerve infection is due to excessive amounts of Originium concentrate that was forcibly injected into her spinal cord. Current medical technology is unable to deal with this condition, so this operator can only be administered minimal conservative treatment.\n\n[Blood Originium-Crystal Density] 0.34 u/L\nThe Originium infection progress is extremely slow, and even if this does not conform to our common sense, it is still a welcome thing. We speculate that the reason for this phenomenon may be related to the transformation that Abyssal Hunters undergo.\n\nOperator Specter's medical files have been moved to an extremely high-clearance database. We ask that relevant medic operators maintain strict confidentiality.\n––Medic Department Internal Notice",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "After the tides of her hometown called her memories and personality back to her, Specter quickly came to accept what had happened to her during her amnesiac period. For a free and easy person like her, having another 'self' was not a bitter pill to swallow. Rather, her mad 'self' merely provided Specter with another angle from which to understand things, greatly broadening her horizons. In this regard, Specter is quite satisfied, although she occasionally regrets that her 'self' was unable to use the inspiration of madness on the right path. As for now, she has ample time to process and digest the impact her 'self' has on her surroundings, Rhodes Island, and other operators. The suspicion and bewilderment on the faces of the operators who had contact with her before brought her no shortage of novelty and amusement. \n\nOperator Specter's mental state has continued to stabilize as of now, and in theory, the probability of her main persona being replaced again is extremely low. However, during fierce combat, or certain situations that cause her to have intense outbursts of emotion, certain sudden changes to her behaviors have been observed. We cannot say for sure whether this is a relapse of her condition, or if Specter is deliberately imitating her past self in search of 'inspiration.' We recommend continuing closely monitoring the operator's mental state as much as possible. \n––Anonymous Operator, Medical Department",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Unlike the elusive Gladiia or the reclusive Skadi, Specter is not only the most approachable Abyssal Hunter, but also the only one who will offer brief descriptions of Ægir for others. After chatting with her, many operators got their first glimpse into this mysterious deep-sea country. \nIn Specter's own words, in the ocean far from land's shores lies a utopian country: there is no Originium, the people do not have to worry about survival, and citizens are assigned to work where they are best suited according to their personal abilities. Light covers the bottom of the sea, and each transparent dome carves out a small piece of paradise. Everyday life is filled with various automatic equipment, and almost all mechanized manual labor is completed by high-end technological products. As a whole, the society is even more ideal than the images conceived in Terra's most cutting-edge science fiction novels. \nSpecter's descriptions undoubtedly satisfied most operators' conception of an exotic, far-flung country, and they naturally ignored the things she mentioned far less often: the immense pressure that the Seaborn posed to the survival of the Ægir people, and the destruction wrought upon Ægir by the Seaborn's followers. \nThe Abyssal Hunters invariably face the same problems on land that they did beneath the waves. \nBut due to their lack of manpower, the Abyssal Hunters are unable to change anything. In the face of the scourge of the seas that cannot be completely driven out even with the Ægir's science and technology, what can the land-dwellers' puny technology accomplish? \nThis is the Abyssal Hunters' status quo. Gladiia has long been concerned about this, and Specter is well aware of it. \nHaving that said, she has no reservations about cooperating with her friends on land. This is not due to some calculus based on ability or practicality, but rather because on an emotional level, she feels that fighting with these soft, vulnerable companions might make miracles. \nThat is the reason she leads the charge into enemy lines, her chainsaw's battle-dance opening up the slimmest of chances for her friends. \nAfter all, she already created a chance for Skadi's team to kill a so-called 'Him.' \nWhy can't she do it again?",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "The operators who take care of Specter on Rhodes Island have found that she tends to stare at sculptures or paintings for a period of time in complete silence. And once Specter returns to herself and expresses her thoughts on these things, the operators finally come to understand that it was her inherent love of art that soothed the scars on her psyche. \nFor Specter, art was the expectation bestowed upon her by Ægir society, as well as her own life's pursuit. Thanks to the nature of her parents' work, she had access to Ægir's bountiful art collection since a young age. Among the various art mediums, sculpture left an indelible imprint within Specter. She still remembers that snow-white sculpture. The moment she laid eyes on it, time seemed to stand still the clock's hand refused to turn. She indulged in the eternal giant displayed before her, coming to realize what true art and beauty is. To this day, she does not understand the idea behind the creation's sculptor, nor has she seen that statute again. However, all the emotional expressivity carried in that piece of stone have long found a home in her heart, and she hopes that one day she can become a sculptor acknowledged by Ægir. One day, she, Laurentina, will be able to create her own sculptures. \nIf she had not become an Abyssal Hunter.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Specter's metamorphosis from a sculpture apprentice into an Abyssal Hunter may appear to be an accident to some; however, what they do not know is that Ægir's technology and institutions can ensure that their chosen personnel will never deviate from the basic needs of their post. Because of this, citizens generally do not refuse when summoned by state institutions such as the Abyssal Hunters. Specter completed her metamorphosis with ease, quickly mastered what she was trained for, and officially became an Abyssal Hunter, hunting Seaborn along with Gladiia. Thus, her obsession with beauty turned into a deep hatred of the Seaborn. It may be the case that Seaborn evolve into striking forms that leave people awestruck, but this cannot be considered beauty - rather, it is more of a byproduct of evolutionary needs. The Ægirians' most ingenious creations are useless pieces of artifice in these creatures' eyes, a perspective that Specter could not tolerate. The 2nd Abyssal Hunter team to which she belonged was once responsible for clearing out a large Seaborn lair: an entire city that had fallen into the sea, its various buildings turned into breeding nests. When she saw the colors bleeding from torn oil paintings and the desecrated stone statues covered with nests, she no longer had any reservations in her heart about slaying the Seaborn. \nNow that civilization has encountered vermin, Specter is more than happy to play the role of exterminator. \nThrough their deaths, Ægir's survival is forged.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'You want to know more about the folks who experimented on me?'\n'I pretty much exterminated them all, Gladiia.'\n'I need to review the information and combine it with the intel provided by Iberia.'\n'Alright, let me try to think back.'\n'Quintus, the one you ran circles around, is probably the least worth talking about among the bunch.'\n'He couldn't see anything outside of the experiments, living inside a dreamscape he wove for himself, single-mindedly power-hungry and conceited.'\n'So, it wasn't hard to deal with him, right?'\n'Mm, next one.'\n'Amaia, that damn Liberi. You probably saw her on that Iberian ship.'\n'Elegant, and far more dangerous.'\n'That's right. She was in charge of recording down my mental state and providing feedback after the experiment. Given how knowledgeable and accomplished she was, it's a pity she was so well-suited for this job.'\n'She might've treated me the nicest among the experimenters, but you know what, Gladiia? She never actually liked me. In fact, she had a lot of things to say about the way we refused to follow nature's ordained trajectory.'\n'Hmph.'\n'In the end, becoming food for the Seaborn perhaps was what suited her heart best. Alas, for someone like her, Terra's future only has enough room for the Seaborn.'\n'It's not hard to find crazed cultists like her along the coast.'\n'As for the last guy, he... he wasn't a bishop.'\n'Hmm?'\n'All I remember is, he was the one who carried out the experiment's procedure... Nngh...'\n'Are you alright, Laurentina?'\n'I'm fine, I'm fine... Just getting some phantom pains...'\n'He rarely showed himself except to conduct the operations... The cultists seemed to call him... 'Sire'...'\n''Sire,' huh? I'll remember that.'\n'Quintus and Amaia are both dead. That guy will probably be watching his back a lot more carefully from now on.'\n'You don't need to worry, Laurentina.'\n'I will deal with this scourge.'",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 2214,
      "atk": 604,
      "def": 267,
      "magicResistance": 0,
      "blockCnt": 2,
      "baseAttackTime": 1.2,
      "respawnTime": 70,
      "cost": 16
    }
  },
  "skins": [
    {
      "skinId": "char_1023_ghost2#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_1023_ghost2",
      "portraitId": "char_1023_ghost2_1",
      "illustId": "illust_char_1023_ghost2_1",
      "modelName": "Specter the Unchained",
      "drawerList": [
        "Skade"
      ],
      "description": "Specter's newly coordinated outfit after regaining awareness.\nMore durable than a uniform, able to bear the great pressures of the Abyss.",
      "rarity": -50
    },
    {
      "skinId": "char_1023_ghost2#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_1023_ghost2_2",
      "portraitId": "char_1023_ghost2_2",
      "illustId": "illust_char_1023_ghost2_2",
      "modelName": "Specter the Unchained",
      "drawerList": [
        "Skade"
      ],
      "description": "Though awoken from her madness, her infatuation with combat remains.\nSo, is there any shred of insanity left to uncover in this outfit, or was it simply a part of her personality all along?",
      "rarity": -10
    },
    {
      "skinId": "char_1023_ghost2@boc#6",
      "skinName": "Born as One",
      "skinGroupName": "Bloodline of Combat/VI",
      "skinGroupId": "2023#boc",
      "avatarId": "char_1023_ghost2_boc#6",
      "portraitId": "char_1023_ghost2_boc#6",
      "illustId": "illust_char_1023_ghost2_boc#6",
      "modelName": "Specter the Unchained",
      "drawerList": [
        "Skade"
      ],
      "description": "<color name=#ffffff>Bloodline of Combat Collection/Born as One. An engraving leaves a shadow, like two sides of a coin, or the cycle of day and night. When both are aware of their dual nature, Laurentina possesses a soul most complete, like unto the twin moons.</color>",
      "rarity": 140
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1311,
            "atk": 335,
            "def": 133,
            "magicResistance": 0,
            "cost": 14,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1749,
            "atk": 459,
            "def": 205,
            "magicResistance": 0,
            "cost": 14,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1749,
            "atk": 459,
            "def": 205,
            "magicResistance": 0,
            "cost": 14,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 2214,
            "atk": 604,
            "def": 267,
            "magicResistance": 0,
            "cost": 14,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3281",
          "count": 5,
          "type": "MATERIAL",
          "name": "Specialist Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_SPC1"
        },
        {
          "id": "30022",
          "count": 8,
          "type": "MATERIAL",
          "name": "Sugar",
          "rarity": 2,
          "iconId": "MTL_SL_STRG2"
        },
        {
          "id": "30032",
          "count": 5,
          "type": "MATERIAL",
          "name": "Polyester",
          "rarity": 2,
          "iconId": "MTL_SL_RUSH2"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 2214,
            "atk": 604,
            "def": 267,
            "magicResistance": 0,
            "cost": 16,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 2803,
            "atk": 737,
            "def": 322,
            "magicResistance": 0,
            "cost": 16,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3283",
          "count": 4,
          "type": "MATERIAL",
          "name": "Specialist Dualchip",
          "rarity": 5,
          "iconId": "MTL_ASC_SPC3"
        },
        {
          "id": "30115",
          "count": 4,
          "type": "MATERIAL",
          "name": "Polymerization Preparation",
          "rarity": 5,
          "iconId": "MTL_SL_PP"
        },
        {
          "id": "30054",
          "count": 6,
          "type": "MATERIAL",
          "name": "Keton Colloid",
          "rarity": 4,
          "iconId": "MTL_SL_KETONE4"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_ghost2_1",
      "skillName": "The Skill to Survive",
      "desc": "When activated, exchange HP percentage with the ally with the lowest HP percentage within range. Specter gains ATK <@ba.vup>+{atk:0%}</>",
      "iconId": "skchr_ghost2_1",
      "spCost": 35,
      "initSp": 25,
      "duration": 25,
      "blackboard": [
        {
          "key": "atk",
          "value": 1.5
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30013",
              "count": 11,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_ghost2_2",
      "skillName": "The Thirst to Survive",
      "desc": "ATK <@ba.vup>+{atk:0%}</>, ASPD <@ba.vup>+{attack_speed}</>. While skill is active, prevents Specter's HP from falling below <@ba.vup>1</>\n<@ba.rem>Will be defeated when the skill ends</>",
      "iconId": "skchr_ghost2_2",
      "spCost": 35,
      "initSp": 25,
      "duration": 20,
      "blackboard": [
        {
          "key": "atk",
          "value": 1.3
        },
        {
          "key": "attack_speed",
          "value": 50
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30103",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_ghost2_3",
      "skillName": "The Pressure to Survive",
      "desc": "Attack interval <@ba.vdown>increases</>, attacks all blocked enemies, ATK <@ba.vup>+{atk:0%}</>, Max HP <@ba.vup>+{max_hp:0%}</>; deal <@ba.vup>{attack@atk_scale_ex:0%}</> ATK as extra Physical damage when attacking enemies with HP percentage equal to or higher than self, otherwise lose <@ba.vdown>{attack@hp_ratio:0%}</> of HP",
      "iconId": "skchr_ghost2_3",
      "spCost": 40,
      "initSp": 25,
      "duration": 25,
      "blackboard": [
        {
          "key": "atk",
          "value": 2.6
        },
        {
          "key": "max_hp",
          "value": 2
        },
        {
          "key": "attack@atk_scale_ex",
          "value": 0.7
        },
        {
          "key": "base_attack_time",
          "value": 1
        },
        {
          "key": "attack@hp_ratio",
          "value": 0.03
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31013",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 9,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_ghost2",
      "moduleName": "Specter the Unchained's Badge",
      "desc": "Operator Specter the Unchained has demonstrated a remarkable aptitude for repeated contention with the enemy upon the battlefield.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Specialist Operator during field operations to exercise Dollkeeper responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_ghost2",
      "moduleName": "'Vinyl Record' Box",
      "desc": "Specter draws a record from the record box and puts it on the gramophone, and melodious music arises.\nShe has no missions today. The only thing she needs to do is let herself relax, place herself into the best possible state to be thrown into the next mission, the next battle.\nThe record is a masterpiece of the Iberian Golden Age, bought by her off an Iberian operator's hands.\nSpecter closes her eyes, lets herself sink into the sofa, and enjoys it in stillness.\nShe couldn't tell you a thing about what accomplishments marked Iberia's Golden Age, but she can sense from the music the splendor of that age, and how its people must have been so proud of their successes.\nIt's not godawful at all, she concedes.\nShe never masks her disdain for the glories of dry land's culture, but she has no intents of applying that prejudice to the arts—\nYes. Prejudice.\nShe even admits as much to the Doctor, while continuing on her merry way.\nBut her insistence isn't without meaning.\nBesides, she believes that while her and the Captain seem to have it in common, there's actually quite the distinction.\nThe Captain's arrogance comes from that good old Captain purview of Chief Designer. But she—she thinks—she doesn't care where her power comes from, and she's passionate about what undertakings she has these days. But still, sometimes she can't help but wonder—how has that statue in her hometown ended up? How about her hometown itself?\nThe music comes to a crackling halt.\nLaurentina opens her eyes, and what gradually seeps into view is her familiar ceiling. She knows, terrifyingly, she'll get even more used to this environment in time. She's not panicked about it. In order to panic in a new environment, you need to not want to leave the old one, but she's practically forgotten just how her life in Ægir felt to live.\nFrom the record box she now pulls a sawblade, and gently wipes over it, swapping for a new record to continue playing all the while. Maybe, just as the Iberians used all the methods under the sun to record their Golden Age, she can try and get back into her once most beloved activity—sculpting.\nHer one stroke of luck: she might just be stuck away from home for a good while longer. She still has enough time to remember how it looked, she thinks, with no lack of self-mocking irony."
    },
    {
      "moduleId": "uniequip_003_ghost2",
      "moduleName": "The Beauty in the Incomplete",
      "desc": "'It is as if slaughtering those overgrown cuts of meat has become our unignorable, even our one-and-only, calling.'\nThe clock ticks and tocks. The dreadnought obstructs the rays as they come down from the dome. Ulpianus lifts his head and fixes his eyes on the flickering indicator lights, as if in thought.\n'It ought not be,' the young female Consul replies, following a long hesitation.\n'Of course it ought not. When an Ægir wakes, the first thought that enters their mind should not be of what they've lost, never. Nor of how to take back what they've lost.' Ulpianus is silent for a juncture, some kind of emotion flowing about his raspy throat. After a good while, he sighs, 'Oh, how many magnificent works we once made.'\n'And now, the battle to survive has become the only to-do list that this new generation knows.'\n'Battle. A glorious word, to be sure. And yet, our outstanding creativity and pursuit of beauty have been all but forgotten.'\nThe two simultaneously gaze afar. Lights dazzle beneath the dome.\n'...Not by choice.' Ulpianus adds.\nGladiia shoots a glance at Ulpianus, mulls over the wording for a moment, then speaks inquisitively: 'You were never the type to be so receptive to sentimentality.'\n'Indeed.' Ulpianus does not halt this time. 'We should address this matter solemnly. Our culture is in the midst of being permanently altered by these protracted days of calamity.'\nA colossal rumbling cuts short Gladiia's pregnant pause. More ships are entering port, a new fleet of migration and reconstruction, and she is left to ponder in earnest what Ulpianus has said. Over the pursuit of beauty, over the creation of the new. Before she was born, or perhaps earlier than that... centuries ago? Millennia? When the Ægir founded this stark and grand culture—did they imagine that now, its radiance would be so dull?\nDid they make any preparations for the present day?\nGladiia's thoughts are lost for but an instant. To her, the past is of unimportance. More vital are what preparations she is soon to make, what things she <i>can</i> do.\n'A new Abyssal Hunter.' Ulpianus unceremoniously breaks the silence. 'I hear she previously had quite an interest in the arts. Ballet, opera, she's dabbled in it all.'\n'Laurentina has mentioned a rather profound recollection of the sculpture in her hometown.'\n'Then she still retains some of the essence what all Ægir should have by rights.' Ulpianus turns around. The Consul's light attire for the season cannot conceal his body scarred by experimentation. 'What is she like? If she truly is an epitome of Ægir life from days gone by, then being forced away from the proper course of things must fill her with so much hate.'\n'No. Such sentimentality is but a small supplement to her whole.'\nGladiia breaks into a rare smile. This, despite how her smiles always took careful observation and judgment, on the muscular and nervous levels.\n'She creates a beauty of her own through battle. One of the sorts you speak of, with great exuberance.'\nUlpianus makes a light and noncommittal harrumph in response, after which he soon leaves Gladiia by herself under those gigantic shadows to appreciate the serenity.\nThe grand hall echoes with only the sounds of the Ægir's footsteps forward."
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "Doctor, if you want me to talk to you, then at leaaast give me some topics I can show interest in.",
      "voiceAsset": "char_1023_ghost2/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Doctor, don't blame me for having no interest in your grand endeavors. To be honest, the reason I became an Abyssal Hunter is hardly as lofty as you imagine. Abyssal Hunters bear a grave mission, but me? I just think the life suits me more, that's all.",
      "voiceAsset": "char_1023_ghost2/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "You want to know about my life in Ægir...? After so much time, my childhood memories are a bit of a blur. Maybe I'll remember a thing or two by telling you about it. Originally, I was meant to be a sculptor...",
      "voiceAsset": "char_1023_ghost2/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "My combat style shows no restraint compared to the past? Doctor, I think you might be misunderstanding me. If you call me mad, I'll take it as an insult. But if you call my combat style mad... I'll take that as a commendation.",
      "voiceAsset": "char_1023_ghost2/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "Hark... to the boundless master of all creation, embraced by darkness, murmuring soliloquy... Let me take a stab, Doctor. Maybe you like the old me rather more than the present me? I'll be honest, I've got a soft spot for that me too. It's nice to be so pure, isn't it?",
      "voiceAsset": "char_1023_ghost2/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "Doctor, you always worry so much. Do something for me, tear this sheet up, yes, just like that. Sometimes, things aren't so complicated. Survival is splitting everything in your way in two. It's just that simple.",
      "voiceAsset": "char_1023_ghost2/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "*Sigh* Doctor, I'm dying to get you visiting our city. That's the only way you can understand how tender my comment is on the life quality of Rhodes Island. It's a shame your body'd be too delicate for it. All the more shame I don't even know whether our city still exists.",
      "voiceAsset": "char_1023_ghost2/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Even if I've got a list of gripes about Rhodes Island, you people haven't abandoned the collection and preservation of art. I can retract all my criticisms just for that. Doctor, forget your job for a moment. This, is a work you shouldn't miss, not in a lifetime.",
      "voiceAsset": "char_1023_ghost2/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "You want to hear me sing? Of course I can indulge you. But I'm so sorry, singing has a special significance to us that you just can't share, not being one of us. Doctor, Doctor, it vexes me that I have so many things I want to share with you. Just how could I convey them to you?",
      "voiceAsset": "char_1023_ghost2/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "May you too stay lucid in your dreams.",
      "voiceAsset": "char_1023_ghost2/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "I recognize you, and you recognize me. We don't need all those boring introductions. But you still don't know me, and I still don't know you. If I recall correctly, dry-landers use simple enough means to get to know each other, so let's get communicating.",
      "voiceAsset": "char_1023_ghost2/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "Are you trying to tell me… my combat style should be more 'fit-in?'",
      "voiceAsset": "char_1023_ghost2/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "For politeness's sake, I accept your commendation. But, to us Abyssal Hunters, combat is the means we have to master to survive. We don't need applause or flowers for it.",
      "voiceAsset": "char_1023_ghost2/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "You chose a dangerous way to learn of the Abyssal Hunters and our enemies, Doctor. With nothing but your delicate body, the tides will drown you. But at the same time, you can count your lucky stars, because I invite you to hide behind me.",
      "voiceAsset": "char_1023_ghost2/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Shall the hunt begin?",
      "voiceAsset": "char_1023_ghost2/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Just let me think, whether you are here to help, or to trouble me like a whelp.",
      "voiceAsset": "char_1023_ghost2/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "It's high tide.",
      "voiceAsset": "char_1023_ghost2/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "The time for fun has now begun.",
      "voiceAsset": "char_1023_ghost2/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "My patience is limited, Doctor.",
      "voiceAsset": "char_1023_ghost2/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Waiting is its own art, too.",
      "voiceAsset": "char_1023_ghost2/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Every battle deserves to be enjoyed.",
      "voiceAsset": "char_1023_ghost2/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "I'm in a... gorgeous mood right now!",
      "voiceAsset": "char_1023_ghost2/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Good morning.",
      "voiceAsset": "char_1023_ghost2/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Good night.",
      "voiceAsset": "char_1023_ghost2/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "I'm not yet satisfied.",
      "voiceAsset": "char_1023_ghost2/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Come, more, more!",
      "voiceAsset": "char_1023_ghost2/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "We might not define danger the same way, but I'm willing to respect the genuine joy of others.",
      "voiceAsset": "char_1023_ghost2/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Do we have a ballad of victory? Yes, but not now. We're still a long way from true victory, aren't we?",
      "voiceAsset": "char_1023_ghost2/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Incompletion has its own beauty. That's how you're comforting yourself, isn't it?",
      "voiceAsset": "char_1023_ghost2/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "I'm to blame too for placing my trust in you. But don't worry, I'll bear the responsibility together with you.",
      "voiceAsset": "char_1023_ghost2/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "You want to hear my opinion of this landship? You'll be disappointed.",
      "voiceAsset": "char_1023_ghost2/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Oh? I knew it was you.",
      "voiceAsset": "char_1023_ghost2/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "You've got a strong hunger for knowledge, but it lacks direction at times, Doctor.",
      "voiceAsset": "char_1023_ghost2/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_1023_ghost2/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "A New Year's feast? Your desire for seeking joy in suffering is truly admirable... Of course I'll join. When on land, do as the landwalkers do, no? I'll see you then, Doctor. Happy New Year, and here's to death come closer to us still.",
      "voiceAsset": "char_1023_ghost2/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "I hope you have a meaningful day today, Doctor.",
      "voiceAsset": "char_1023_ghost2/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "I heard today was your birthday. I support chasing all sense of ceremony, even if it's not going to mean anything. So, happy birthday, Doctor, and congratulations on notching up another year of suffering.",
      "voiceAsset": "char_1023_ghost2/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "I can sense that the madness which used to bind me is slightly different to the Oripathy you're attempting to overcome... and what's interesting is, even having the knowledge I do, I can't give a clear solution. On that exploratory note, at least, I'm prepared to work with you all.",
      "voiceAsset": "char_1023_ghost2/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "train_spd&profession2[080]",
      "buffName": "Specialist Expert α",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, <@cc.kw>Specialist</> Operators' Specialization training speed <@cc.vup>+30%</>",
      "skillIcon": "bskill_train_specialist1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "train_spd&profession2[680]",
      "buffName": "Ægir Tactics",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, <@cc.kw>Specialist</> Operators' Specialization training speed <@cc.vup>+30%</>; if training this skill to Specialization Level <@cc.vup>3</>, training speed will be further increased by <@cc.vup>+65%</>",
      "skillIcon": "bskill_train3_specialist2",
      "phase": "PHASE_2",
      "level": 1
    },
    {
      "buffId": "train_cost&profession[380]",
      "buffName": "War Fever",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, Morale consumed per hour <@cc.vdown>+1</> when training a <@cc.kw>Specialist</> Operator's skill to Specialization Level <@cc.vup>3</>",
      "skillIcon": "bskill_train_specter",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}