{
  "id": "char_4013_kjera",
  "meta_info": {
    "name": "Kjera",
    "appellation": " ",
    "voiceActor": {
      "en": "Sarah Ovens",
      "jp": "Aya Hisakawa",
      "kr": "Jun Suk-kyong",
      "cn": "Emma Chen"
    },
    "rarity": 5,
    "profession": "Caster",
    "subProfessionId": "Mech-accord Caster",
    "position": "RANGED",
    "team": "Karlan Trade",
    "tagList": [
      "DPS",
      "Crowd-Control"
    ],
    "nationId": "Kjerag",
    "isNotObtainable": false,
    "itemObtainApproach": "Event Reward",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Kjera\n[Gender] Female\n[Combat Experience] None\n[Place of Birth] Kjerag\n[Date of Birth] Dec 5\n[Race] Undisclosed\n[Height] 165cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Normal\n[Mobility] Standard\n[Physical Resilience] Standard\n[Tactical Acumen] Excellent\n[Combat Skill] Standard\n[Originium Arts Assimilation] Flawed",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Head maid to Kjerag Saintess Enya Silverash (also known as Operator Pramanix), joining Rhodes Island as delegate of the Saintess.\nResponsible for a great deal of connective matters in Pramanix's secret visits to Rhodes Island. Extremely keen on the operator life, presently active as a Caster Operator in all manner of missions.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\n\n[Blood Originium-Crystal Density] 0u/L\n\nWhat do I say? She doesn't really hide it, and she went so far beforehand as to tell me that her body probably isn't like the layman's, so I'm not overly surprised by this?\nAlthough if I could just have a little discussion with her, get her to undergo regular inspections in my office, let me draw a little blood, that's all. It wouldn't impact her in any real way.\n—Warfarin\nAsk her yourself.\n—Kal'tsit",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Though her appearance seems rather youthful, Kjera often strikes a sense of seniority into people. Primarily, this is because she has a rather subconsciously old-fashioned way of looking at certain things, and not in a way that would turn off people of modern thought, but in a 'there are people who still think like this?' way. Moreover, she is exceptionally naturally caring of those around her, and operators who've been on missions with her line up to attest they've felt it was like being on a mission with a family elder, very strange, but not too bad either. Combined with what the Doctor's picked up in Kjerag, Kjera's true identity my be far more complex than the Saintess's head maid.\nJust as Dr. Kal'tsit says, 'Of all those of her kind still alive, she may well be the easiest one to get along with.'",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Compared to Pramanix, who has to go out of her way to make her own free time to leave Kjerag and come to Rhodes Island on 'vacation,' Kjera as her head maid clearly has much more liberty over allotting her own time. Pramanix may not stop over at Rhodes Island for long throughout the course of a year, but Kjera seems to stay aboard so long as she wishes it, likely because she simultaneously has a duty as a contact bridge between Rhodes Island and Saintess Enya—though as far as Rhodes Island is concerned, at least initially, we had no expectations of such contact.\nBefore Pramanix first visited Rhodes Island, Kjera didn't actually shy from meeting any others from Kjerag, not even avoiding showing up in the same place as SilverAsh when he visited—of course, both SilverAsh and her are obviously people who know the limits.\nEssentially, Kjera has never given anyone a very clear sense of being 'the surrogate of the Saintess,' but more pertinently, she seems to take a lot more joy in the Operator lifestyle than many others.\nMoreover, she has a full understanding of Kjerag; even the travel handbooks issued by Karlan Trade don't know as much as she does, and in her vivid explanations, plenty of operators have gained a more profound comprehension of what kind of place Kjerag is.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "When Kjera applied for Saintess Enya's interim collaborative operator status on her behalf, Rhodes Island was thoroughly hesitant.\nFirstly, Saintess Enya was already nominally Kjerag's leader, and Rhodes Island policy has always refrained from having direct ties to any political entity. Secondly—before that, her elder brother, Enciodes, had already become a Rhodes Island interim collaborative operator—SilverAsh.\nIf Enya and Enciodes' relations weren't apparent by the end of the Doctor's journey to Kjerag, then they were crystal clear by the time Kjera handed her application in. The siblings' reconciliation had already turned out as a false start. They chose their own respective positions, and hence simply acted on them, nothing more.\nAnd Enya still decided to join Rhodes Island even after knowing the basis of our and Enciodes' relationship; we're hard-pressed to believe her objective really was as simple as Kjera claims, that she wanted to give herself a moment of reprieve from the bustle of government affairs, and reunite with her sister. Or, perhaps, this truly is her mind, but given her identity, just the slightest carelessness and Rhodes Island would become another battleground for her and Enciodes' game, even if that's not what she wants.\nBut in the end, Rhodes Island still approved her application. After all, taking a step back, Kjera joining Rhodes Island as Enya's surrogate already gave rise to ties between us and Enya, and refusing at this time would be like sticking our heads in the sand. In another regard, Rhodes Island has always been capable of maintaining its own position, and as Enya and Enciodes are both willing to accept Rhodes Island's terms, acting as operators under certain restrictions, they would have to honor Rhodes Island's policy in that case. At Rhodes Island, she is Operator Pramanix, and Enciodes is Operator SilverAsh, with nothing on top.\n'...Speaking as a bystander, I'm very happy Enya and Enciodes have separately made their choices. The answers they've submitted are both brilliant, and I have high hopes for the future. But I'm no more than an observer, in the end. I'm Enya's head maid; I've seen her anger, bewilderment and tears. During the Snowcap Incident, I could say I couldn't interfere in the process of their giving their answers, so I'm not willing to directly act—in reality, if I really can't avoid it in the end, I will act to save Enya—but what about the future? Will I just fold my arms and watch then, too? Doctor, to tell the truth, I don't think I can do that.'\n'That's one big reason I came here, Doctor. These siblings make their own choices, and the barrier crossed between them will grow larger and larger, but given you could conclude the Snowcap Incident so, I trust that you also have the ability to find them another way in future. Doctor, you're going to help me, aren't you?'",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Doctor, you should be able to guess who I am. Am I Kjeragandr? Or perhaps an existence very intimate to Her?\nYou'd find it slightly boring if I personally told you, so I'll let you imagine. After all, it's not important in the end, is it?\nAt least, I personally feel it isn't.\nWhen She was born, She thought there was only the snowcapped mountain between heaven and earth, and the people living on the snowfields, and She automatically felt close to those people. She had never left Kjerag before, and She only knew a land by that name, and was only acquainted with the people who lived upon it. The Kjerag people believed they were relying on Her, but in actuality, wasn't She relying on them too?\nDid thinking of having to bear the people's hopes terrify Her in turn? Had confronting the way in which things developed left Her at a loss? Did realizing the people held to faith and ceased to walk on cause Her regret?\nWho was She?\nIn all honesty, what this question should be asking is, what was She, and what did She represent.\nMy answers are, She was born of Kjerag's people, and She stands for what once happened, but She doesn't know what *is* happening, nor what *will* happen.\nKjerag's future has never been in Her hands, and should not be in Her hands.\nBut if so—what course should She now follow?\nWhy would She be born unto this great land? If protecting Kjerag is not Her calling, then what meaning is there in Her life?\nThis answer, She wishes to find.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "The Doctor has determined, though Kjera hasn't explicitly stated it, she clearly possesses some form of high-speed, even instantaneous motion ability. Otherwise, her elusive and fleeting movements become impossible to explain.\nKjera doesn't hide this, and has given a definitive reply.\n'I can indeed appear wherever I want within Kjerag's borders, but I can't do that outside of them.'\nAside from that, she's also shown herself to have some ability of mental suggestion, able to make others not consider her conspicuous, and she's relied on this ability to lead her long life in Kjerag without being suspected.\nHer openness actually deepens Rhodes Island's confusion—in the end, this clearly doesn't fall under any Originium Arts.\nHowever, she and Nian should be of the same sort. After all, the first time she saw Nian, her stunned look left a deep impression on us. Nian seems to take a fair liking to her as well, frequently showing up solicited by her chef's table.\nFurther, compared to Nian's reason-rejecting abilities, her own could be called so much as immature, which inevitably piques greater curiosity in their true identities, as well as their race's mode of life.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1121,
      "atk": 246,
      "def": 101,
      "magicResistance": 20,
      "blockCnt": 1,
      "baseAttackTime": 1.3,
      "respawnTime": 80,
      "cost": 23
    }
  },
  "skins": [
    {
      "skinId": "char_4013_kjera#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_4013_kjera",
      "portraitId": "char_4013_kjera_1",
      "illustId": "illust_char_4013_kjera_1",
      "modelName": "Kjera",
      "drawerList": [
        "竜崎いち"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_4013_kjera#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_4013_kjera_2",
      "portraitId": "char_4013_kjera_2",
      "illustId": "illust_char_4013_kjera_2",
      "modelName": "Kjera",
      "drawerList": [
        "竜崎いち"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_4013_kjera@epoque#18",
      "skinName": "Ingenious Servant",
      "skinGroupName": "EPOQUE/XVIII",
      "skinGroupId": "2022#epoque#5",
      "avatarId": "char_4013_kjera_epoque#18",
      "portraitId": "char_4013_kjera_epoque#18",
      "illustId": "illust_char_4013_kjera_epoque#18",
      "modelName": "Kjera",
      "drawerList": [
        "竜崎いち"
      ],
      "description": "EPOQUE Collection New Arrivals/Ingenious Servant. A bespoke outfit ordered at the Savile Boutique Tailors by Kjera, the finished product of bewildering quality thanks to the fantastic minds of the designers, plus Kjera's own clever touch.",
      "rarity": 33
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "3-6",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 604,
            "atk": 135,
            "def": 48,
            "magicResistance": 10,
            "cost": 21,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 863,
            "atk": 191,
            "def": 73,
            "magicResistance": 10,
            "cost": 21,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 70,
      "rangeId": "3-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 863,
            "atk": 191,
            "def": 73,
            "magicResistance": 15,
            "cost": 23,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 1121,
            "atk": 246,
            "def": 101,
            "magicResistance": 15,
            "cost": 23,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3251",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30022",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30042",
          "count": 3,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 80,
      "rangeId": "3-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1121,
            "atk": 246,
            "def": 101,
            "magicResistance": 20,
            "cost": 23,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1475,
            "atk": 294,
            "def": 121,
            "magicResistance": 20,
            "cost": 23,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3253",
          "count": 3,
          "type": "MATERIAL"
        },
        {
          "id": "30094",
          "count": 8,
          "type": "MATERIAL"
        },
        {
          "id": "31023",
          "count": 13,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skcom_atk_up[3]",
      "skillName": "ATK Up γ",
      "desc": "ATK <@ba.vup>+{atk:0%}</>",
      "iconId": "skcom_atk_up",
      "spCost": 30,
      "initSp": 15,
      "duration": 30,
      "blackboard": [
        {
          "key": "atk",
          "value": 1
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30063",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_kjera_2",
      "skillName": "Unrestrained Heart",
      "desc": "Drone <@ba.vup>+{attack@cnt}</>, ATK <@ba.vup>+{atk:0%}</>. Releases Drones to attack enemies, and grants self and Drone a <@ba.vup>{attack@prob:0%}</> chance to inflict <$ba.cold>Cold</> to enemies for <@ba.vup>{attack@cold}</> seconds\n<@ba.rem>The Drone locks onto an enemy until the enemy is defeated or until the skill is over, then returns to the Operator</>",
      "iconId": "skchr_kjera_2",
      "spCost": 40,
      "initSp": 20,
      "duration": 25,
      "blackboard": [
        {
          "key": "atk",
          "value": 0.55
        },
        {
          "key": "attack@cnt",
          "value": 1
        },
        {
          "key": "attack@prob",
          "value": 0.22
        },
        {
          "key": "attack@cold",
          "value": 2.5
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31023",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_kjera",
      "moduleName": "Kjera's Badge",
      "desc": "Operator Kjera has demonstrated a remarkable aptitude for manipulating hovering units to combat and pursue the enemy in concert.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Caster Operator during field operations to exercise Mech-accord Caster responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_kjera",
      "moduleName": "In the Woolen of Snow",
      "desc": "To Her, there returned a distant and long-lost feeling.\nAnd the air flowed, and flowed together into wind. And wind came forth in great gusts, and rolled over Her shoulders and Her back, and through the interstices of Her fingers, howling as it did. To the people of Kjerag, this wind would be felt a colder one.\nThen wind's howls turned to chaos, its tight shrieks ushered to fray by words of somnolence, as a song rent and shattered over a million risings and settings of the sun and flew about Her forever. So the chatter grew and grew in the air, till it reached out with a black thorn. And a black raindrop hung upon the thorn's tip, and it seemed that it would fall to the land, and fall betwixt the mountains and the trees, and see that the mountains and the trees would become of its likeness. It was cacophony, and it was infinitely hostile, and it heeded no disobedience. This was Danger.\nSo She thought to stir, yet She found it now took considerable energy, which it had not done before.\nThereupon She forged into the snow of a million suns, and She sought as if seeking the tail of a threadmade cloth, and about Her finger wound a tail of this thread. And so the air changed in its flow, and the snow flew to the air by Her will, and thus was woven a curtain of it. And She put this curtain to the black rain, and drove it from the land at Her feet, in the manner She had done countless times before.\n'Kjarr? Kjarr?'\nThrough the curtain of wind and snow, a soft calling breaks, and reaches her ears again. Kjarr snaps out of her brief daze, half-woven cloth nestled in her lap. She finds her needle still in one hand, yet the tail of her thread fallen from the other, back into the pile.\n'I'm sorry, Saintess, I believe my mind wandered.'\nThis is her third day learning weaving from the Saintess. The chamber of the Vine-Bear Court they're in is hung with tapestries woven by Enya's own hand. For Enya, pursuing textiles is just another part of her spiritual devotions.\n'Oh... I see. Perhaps I'm teaching a little too fast for you?'\nSat face to face with Kjarr, there is absolutely no blame in Enya's words, her face almost twisted with humble apology. She holds her own needle and wound thread, with a cloth much like Kjarr's draped over the crook of her arm, but hers is far more complete, it seems, far more beautiful.\n'I wouldn't say that. Certainly easier to follow than your recitations of the scriptures.'\nHearing that, Enya smiles as she reaches into the wool pile, picks out the loose tail, and hands it back to Kjarr.\n'And yet I hardly leave you so lost in thought when I recite.'\nKjarr takes the tail, the warmth of Enya's intent lingering at her fingertips. She'll be finishing this cloth.\n'It strikes me, Saintess, that your stitch, and Her stitch of the blizzard, might in some ways be not so different.'\nAnd the blizzard whips up outside the window, almost hard enough to stir the tapestries inside.\nTo her, there returns a close and longed-for feeling."
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "Doctor! Was it me you wanted? Or did you want me to find Enya for something?",
      "voiceAsset": "char_4013_kjera/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "I can't just pop up anywhere I want like I can back in Kjerag, Doctor. So if you want something delivered for you, you'll want someone else.",
      "voiceAsset": "char_4013_kjera/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Doctor! Is your belly empty? I've learned how to use Rhodes Island's kitchen, so I can put something together for you.... ah, but I can only do Kjerag food for the time being. Hmm... how about some cheese fondue?",
      "voiceAsset": "char_4013_kjera/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Enya... Enya? Doctor, have you seen Enya? It's about time we return to Kjerag, and with all the things that need her attention, she has to come with us. Just where has that girl scurried off to now...?",
      "voiceAsset": "char_4013_kjera/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "'Prayer that will be found, devotion that will be rewarded...' If anything that convenient truly existed, I'd like to see it myself. Me? I'm hardly even perfect knitting sweaters—how could I grant anyone's wishes? Oh, but if you'd like a blizzard, that's something I can do for you.",
      "voiceAsset": "char_4013_kjera/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "In a certain way, Enya and Enciodes are the same to me. Both siblings want to change Kjerag, after all. But if I had to say why I'm so much closer to Enya... it's because she became my Saintess. Not Enciodes.",
      "voiceAsset": "char_4013_kjera/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Doctor, next time you visit Kjerag, would you like to see the view from the peak of Karlan? Standing at the summit above the clouds amidst the mountains, seeing the sun once again is a heavenly feeling. You'll love it—ah, but there is the chance you'll freeze to death before then. Tricky, that...",
      "voiceAsset": "char_4013_kjera/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Enya's attitude towards her brother, well... I'm sure you understand—the opposite of intimacy isn't hatred, but indifference. And she likes to say as much, though it's not actually quite that bad between them. That said, in time... I have no clue at all.",
      "voiceAsset": "char_4013_kjera/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "The world outside sprawls vast and far, Doctor. But I've come to realize something. It's like people are the same no matter where you go. The palette of emotions outside does not differ from what I have seen in Kjerag. It truly is a fascinating thing, though just as dull too.",
      "voiceAsset": "char_4013_kjera/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Oh, my, your sleeping posture is terrible... I'll run you a bowl of water. You can wash your face as soon as you come round.",
      "voiceAsset": "char_4013_kjera/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Doctor... shh. I came out in secret with Enya. Make sure Ensia and the Karlan Trade people don't find out, or things will get messy for her.",
      "voiceAsset": "char_4013_kjera/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "*Sigh*. No matter how advanced our weapons get, combat is still so barbarous...",
      "voiceAsset": "char_4013_kjera/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "Oh! A promotion...Well, I've come here with Enya quite a few times now...",
      "voiceAsset": "char_4013_kjera/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "The Rhodes Islanders by and large seem to know who I am now. Which means I can get a little closer to them, right...? Oh, can't I?",
      "voiceAsset": "char_4013_kjera/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Oh, won't you want me leading, Doctor?",
      "voiceAsset": "char_4013_kjera/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "I'll see you all safely through.",
      "voiceAsset": "char_4013_kjera/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Anyone we've left behind?",
      "voiceAsset": "char_4013_kjera/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Let me quell the enemy!",
      "voiceAsset": "char_4013_kjera/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Dear me, I’m not done readying yet!",
      "voiceAsset": "char_4013_kjera/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Let's assist others, shall we?",
      "voiceAsset": "char_4013_kjera/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Don't you fret. No matter the environment, I can 'see' them just fine.",
      "voiceAsset": "char_4013_kjera/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "No need for mercy on the enemy, correct?",
      "voiceAsset": "char_4013_kjera/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "You thought I couldn't see you?",
      "voiceAsset": "char_4013_kjera/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "I'm aimed at you, you know?",
      "voiceAsset": "char_4013_kjera/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "You didn't think it'd come from this angle, did you?",
      "voiceAsset": "char_4013_kjera/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "You're not getting close to me that easily, you know?",
      "voiceAsset": "char_4013_kjera/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Doctor, you can't be overzealous in challenging your limits, or you might hurt yourself.",
      "voiceAsset": "char_4013_kjera/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "What a splendid job, Doctor! You make me want to pat you on the head~",
      "voiceAsset": "char_4013_kjera/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Now, now, it's alright. These are fine enough results, aren't they?",
      "voiceAsset": "char_4013_kjera/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Doctor, fear not. I'm here.",
      "voiceAsset": "char_4013_kjera/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Let's see, here's... whereabout is this?",
      "voiceAsset": "char_4013_kjera/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Oh?!",
      "voiceAsset": "char_4013_kjera/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Doctor, would you like to go on a walk together?",
      "voiceAsset": "char_4013_kjera/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_4013_kjera/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Oh, so this holiday's far more widespread than just a Kjerag celebration. No, I don't think it's too strange. I just feel like once one holiday's over, you blink and the next one's already here. How curious. Still, any reason to be happy's a good reason. Doctor, would you like some cheese fondue?",
      "voiceAsset": "char_4013_kjera/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Doctor! Did you sleep well last night?",
      "voiceAsset": "char_4013_kjera/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Doctor, happy birthday! Come have a taste of this cake I made, or maybe blow out the candles and make a wish first? Oh, and put on this medicinal garland, it'll bless any children to live a hundred years free of ailments! You're not little anymore, you say? Heheh, Doctor, what are you telling me.",
      "voiceAsset": "char_4013_kjera/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "Without even noticing it, I've racked up an awful lot of visits here with Enya. I must say, Doctor, I'm gradually starting to understand why Enya loves to scurry over here when she's free. You see, this is a place full of interesting, adorable people. To where will you lead this sailing ship? I'd love to see for myself.",
      "voiceAsset": "char_4013_kjera/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "meet_spd&team[000]",
      "buffName": "Clue Search α",
      "desc": "When this Operator is assigned to the Reception Room, Clue search speed increases by <@cc.vup>10%</>",
      "skillIcon": "bskill_meet_spd1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "meet_spd&team[041]",
      "buffName": "Snow Watcher",
      "desc": "When this Operator is assigned to the Reception Room, Clue search speed increases by <@cc.vup>10%</> and it's easier to obtain the clues of <@cc.kw>Karlan Trade</>",
      "skillIcon": "bskill_meet_kjerag2",
      "phase": "PHASE_2",
      "level": 1
    },
    {
      "buffId": "meet_flag[040]",
      "buffName": "Kjeragandr",
      "desc": "When this Operator is assigned to the Reception Room, every time that a non-<@cc.kw>Karlan Trade</> clue is collected, the likelihood of obtaining <@cc.kw>Karlan Trade</> clues is increased (working time improves the likelihood)",
      "skillIcon": "bskill_meet_flag_kjerag",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}