{
  "id": "char_430_fartth",
  "meta_info": {
    "name": "Fartooth",
    "appellation": " ",
    "voiceActor": {
      "en": "Samantha Dakin",
      "jp": "Suzuko Mimori",
      "kr": "Yeo Yun-mi",
      "cn": "Wen Liu"
    },
    "rarity": 6,
    "profession": "Sniper",
    "subProfessionId": "Deadeye",
    "position": "RANGED",
    "team": "Pinus Sylvestris",
    "tagList": [
      "DPS"
    ],
    "nationId": "Kazimierz",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Fartooth\n[Gender] Female\n[Combat Experience] 4 Years\n[Place of Birth] Kazimierz\n[Date of Birth] Oct 10\n[Race] Liberi\n[Height] 155cm\n[Infection Status]\nConfirmed Infected by medical examination.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Standard\n[Mobility] Excellent\n[Physical Resilience] Standard\n[Tactical Acumen] Normal\n[Combat Skill] Excellent\n[Originium Arts Assimilation] Standard",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'Fartooth' Knight Justyna, garnered initial fame at the Major, presently affiliated with the Infected knight-founded Pinus Sylvestris Knightclub. An Infected knight with some degree of fame in Kazimierz. Following a string of crises in the recent Major, Pinus Sylvestris and Rhodes Island emerged with a cooperative relationship, in which Fartooth Knight came to Rhodes Island as a collaborator, to receive Oripathy treatment, and provide Rhodes Island with combat support.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests show the indistinct outlines of internal organs, obscured by abnormal shadows. Originium granules detected in the circulatory system. The subject is confirmed to be infected with Oripathy.\n\n[Cell-Originium Assimilation] 5%\nOperator Fartooth's degree of infection is relatively light, but minor crystallization is visible on the surface of the body.\n\n[Blood Originium-Crystal Density] 0.21u/L\nGiven the overall stability of her condition, and control over her lesions, treatment is focused on monitoring.\n\nKnight competitions really do pay out fast. If she didn't have the money to afford treatment, there's no chance she'd be in such good condition. Undeniably, the Blood Knight has given options to those who otherwise had none.\n——Warfarin",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "With the agreement between Pinus Sylvestris Knightclub and Rhodes Island and several Infected knights arriving to receive treatment, we have gained a rough understanding of the characters of these knights.\nFartooth Knight is seen as a woman of few words, cold and reserved. She earned the title 'Fartooth' as an independent knight, declining droves of invitations from firms and Knight Orders, publicly declaring that she was considering founding a Knightclub herself. This choice brought her considerable hassle, but also served as the turning point for her to join Pinus Sylvestris.\nCompared to the Knightclub's early members, the later-arriving Fartooth Knight needed some time to acclimate. However, from her relationship with the likes of Flametail, as well as her interaction with our Operators during her time at Rhodes Island, we see that Fartooth Knight is surprisingly not as aloof and difficult to approach as her outward appearance may suggest. Under her firm shell, this Infected knight has a fairly gentle manner—even soft.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Fartooth Knight was shone brilliantly in the Major preliminaries; her strength cannot be underestimated.\nRarer is that while her individual strength is second-to-none in Pinus Sylvestris, she doesn't share the same failing that many with strength often do—arrogance. This small-statured knight is entirely adept at cooperation, proactively coordinating with her teammates. If required to serve as primary offense, her attacks are fierce and intense, but if other assault personnel are in her lineup, Fartooth will change tactics, as though she can hear the wind, seizing upon its tiniest whispers of information, providing agile and flexible long-range support to her teammates.\nAlso worth mentioning is that on first contact, Fartooth Knight's succinct and unique manner of speech led some operators to misunderstand her for a time. However, we all quickly grasped that her tendency to utter perplexing sentence fragments, supplemented by further explanation, comes from her penchant for lonely pondering—she keeps rapidly deducing the main point in her head, reaching a conclusion, and then blurting it out. After realizing how she confuses those around her, only then does she follow up by elaborating.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Fartooth Knight, original name Justyna Valentine, was born in a tranquil part of rural Kazimierz, and up until adulthood, was no more than a normal village girl.\nJustyna longed since childhood to become a knight, like any average Kazimierzian child would. The knights in shining armor were awe-inspiring, dashing and formidable, the targets of all their adoration. Despite the prevalence of the Major and the old chivalric spirit gradually fading from Kazimierzian minds as Justyna grew up, her image of the knights wasn't badly damaged (an all-too-rare case), thanks to the Radiant Knight. When she finally met her knightly role model, both parties were far removed from where they started, but Justyna's feelings are known only to herself.\nHowever, bearing the dream of knighthood, the now-grown village girl who ventured on a journey to the Grand Knight Territory had never once imagined the utterly unexpected misfortune that might strike her. Before she could officially register to become a knight at Kawalerielki, an accident en route infected her with Oripathy, and in the time when the Blood Knight hadn't yet won the championship, it was no more than wild fantasy for Infected to become knights. Her dream snuffed out by unforeseeable circumstances, she had nowhere to go, and nowhere to return. That is until the Blood Knight reigned victorious, and news came of the push for the Infected Knights Act.\nThoroughly damped down before, fires of hope is ignited once again, true and searing, so hot as to scald some, yet making for it like mad, unable to let go.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Fartooth's experiences are by no means unusual; like all Infected knights, she had to strive far harder than the vast majority if she wished to obtain formal knight qualification. It's hard to imagine how this girl of such unassuming stature survived through the bloodiness of the illegal tournaments, or how she struggled to obtain her knighthood, how she could finally make a brilliant show in the preliminaries, and obtain a title so quickly.\nAnd though there was much controversy as this lone girl barged her way into the Major, she had some supporters of her own too, as well as a considerable income. In the masses' eyes, past the living exception of the Blood Knight, there was no better outcome for an Infected knight than this.\nBut for Fartooth herself, all this may not have been so important. No matter if she wanted to found her own Knightclub, or agreed to join Pinus Sylvestris, it all went far in showing she wanted something more than simple fame or wealth.\nShe was now a knight. Had Justyna the village girl's dream really come true? She'd become Infected, then once again found hope, had narrowly climbed up on this thin, thin thread, but the higher she climbed, the more she came in touch with the other side of the knights she'd once yearned after. Now in the present, perhaps more than any riches or renown, more than any chivalric glory that once was her dream, Justyna simply wants to return home.\nIn her time receiving treatment at Rhodes Island, Fartooth spends most of her time on the upper deck, except when she's with her Knightclub fellows. There, she recalls how she used to work in the fields, saving the money to buy her first longbow, fantasizing about her gallant figure as she wielded it someday. She reminisces on the haystacks that smelt of sunshine, on the wind brushing past her ears, and her friends and family that would listen as she blew folk songs. Yet by the time she could be as gallant as she dreamed, she now only wanted to return to those simple, peaceful countryside days.\nWhen she sits alone high up, playing her carved recorder, she only hopes that somehow the wind will carry her flutesong back home, just as if she could return home with it.\n\nOf course, Justyna is clearer than anyone that for Infected, returning to past life is little more than a wild hope.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Fartooth tends to stay with the other members of her Knightclub. Despite Wild Mane and Ashlock's quarrels giving her headaches, she continues to silently follow her companions as they work together. Compared to Flametail's overflowing ideas, and the goals Ashlock and Wild Mane hold to, Fartooth's motive for joining and staying in Pinus Sylvestris is the simplest of all. \nFlametail invited her. As Infected knights together, they stand in identical situations, and Pinus Sylvestris brought her a sense of security. For someone left out of the crowd, with nowhere to return to, no further reason could be needed. One could say that Fartooth doesn't care what sort of direction Pinus Sylvestris may head in future; so long as her companions are still there, so long as this new home remains, that is enough for her. \nShe'll spare nothing, protecting all this that she treasures.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1217,
      "atk": 980,
      "def": 133,
      "magicResistance": 0,
      "blockCnt": 1,
      "baseAttackTime": 2.7,
      "respawnTime": 70,
      "cost": 22
    }
  },
  "skins": [
    {
      "skinId": "char_430_fartth#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_430_fartth",
      "portraitId": "char_430_fartth_1",
      "illustId": "illust_char_430_fartth_1",
      "modelName": "Fartooth",
      "drawerList": [
        "NoriZC"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_430_fartth#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_430_fartth_2",
      "portraitId": "char_430_fartth_2",
      "illustId": "illust_char_430_fartth_2",
      "modelName": "Fartooth",
      "drawerList": [
        "NoriZC"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_430_fartth@whirlwind#5",
      "skinName": "Hear the Wind Sing",
      "skinGroupName": "0011/Tempest/V",
      "skinGroupId": "2023#whirlwind",
      "avatarId": "char_430_fartth_whirlwind#5",
      "portraitId": "char_430_fartth_whirlwind#5",
      "illustId": "illust_char_430_fartth_whirlwind#5",
      "modelName": "Fartooth",
      "drawerList": [
        "NoriZC"
      ],
      "description": "<color name=#ffffff>0011 Tempest Series/Hear the Wind Sing. New concept based on the theme of Wind, a collaborative work between multiple designers. The ever-present floating ribbons capture the shape of the wind.</color>",
      "rarity": 71
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "3-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 749,
            "atk": 535,
            "def": 79,
            "magicResistance": 0,
            "cost": 20,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.7,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 973,
            "atk": 744,
            "def": 106,
            "magicResistance": 0,
            "cost": 20,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.7,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "3-9",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 973,
            "atk": 744,
            "def": 106,
            "magicResistance": 0,
            "cost": 22,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.7,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1217,
            "atk": 980,
            "def": 133,
            "magicResistance": 0,
            "cost": 22,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.7,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3241",
          "count": 5,
          "type": "MATERIAL",
          "name": "Sniper Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_SNP1"
        },
        {
          "id": "30052",
          "count": 7,
          "type": "MATERIAL",
          "name": "Polyketon",
          "rarity": 2,
          "iconId": "MTL_SL_KETONE2"
        },
        {
          "id": "30042",
          "count": 4,
          "type": "MATERIAL",
          "name": "Oriron",
          "rarity": 2,
          "iconId": "MTL_SL_IRON2"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "3-9",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1217,
            "atk": 980,
            "def": 133,
            "magicResistance": 0,
            "cost": 22,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.7,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 1522,
            "atk": 1196,
            "def": 163,
            "magicResistance": 0,
            "cost": 22,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.7,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3243",
          "count": 4,
          "type": "MATERIAL",
          "name": "Sniper Dualchip",
          "rarity": 5,
          "iconId": "MTL_ASC_SNP3"
        },
        {
          "id": "30135",
          "count": 4,
          "type": "MATERIAL",
          "name": "D32 Steel",
          "rarity": 5,
          "iconId": "MTL_SL_DS"
        },
        {
          "id": "31054",
          "count": 7,
          "type": "MATERIAL",
          "name": "Cutting Fluid Solution",
          "rarity": 4,
          "iconId": "MTL_SL_PLCF"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skcom_quickattack[3]",
      "skillName": "Swift Strike γ",
      "desc": "ATK <@ba.vup>+{atk:0%}</>; ASPD <@ba.vup>+{attack_speed}</>",
      "iconId": "skcom_quickattack",
      "spCost": 35,
      "initSp": 15,
      "duration": 35,
      "blackboard": [
        {
          "key": "atk",
          "value": 0.45
        },
        {
          "key": "attack_speed",
          "value": 45
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31013",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_fartth_2",
      "skillName": "Ally Support",
      "desc": "Can attack blocked enemies outside of Attack Range. ASPD <@ba.vup>+{attack_speed}</>",
      "iconId": "skchr_fartth_2",
      "spCost": 40,
      "initSp": 25,
      "duration": 35,
      "blackboard": [
        {
          "key": "attack_speed",
          "value": 110
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30063",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_fartth_3",
      "skillName": "Feathershine Arrows",
      "desc": "Attack Range changes to an <@ba.rem>infinitely long straight line</> ahead, ATK <@ba.vup>+{atk:0%}</>. When attacking an enemy outside of the normal Attack Range, damage dealt increases to <@ba.vup>{damage_scale:0%}</>",
      "iconId": "skchr_fartth_3",
      "spCost": 20,
      "initSp": 10,
      "duration": 20,
      "blackboard": [
        {
          "key": "atk",
          "value": 1.4
        },
        {
          "key": "damage_scale",
          "value": 1.4
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31023",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 9,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_fartth",
      "moduleName": "Fartooth's Badge",
      "desc": "Operator Fartooth has demonstrated a remarkable aptitude for defeating enemies from long range. \nThe Field Operations Department has thus passed the following resolution: \nThis operator shall be appointed a Sniper Operator during field operations to exercise Deadeye responsibilities. \nIn witness whereof, \nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_fartth",
      "moduleName": "First-show Support Set",
      "desc": "......The wind. \nI can hear the wind's sound changing. \nIt was quiet before, but now it's become noisy.\n......\nLots of people... They're here to watch the match. \nMy first time competing in the knight tournament. \nThis is different from when I was in the underground arena... This is an official match. \n...Different? \nI've become an official Infected Knight, but does this really make a difference compared to before? \n...... \n......Soon. \nThere's not much time left. The match will start soon. \nI... \nI know, I will win. \nI will win...... \n...... \n\nExcuse me, is Miss Justyna Valentine here? We've brought your custom-made equipment! \nHuh, is Miss Valentine not here? \nShe... hasn't been seen since noon? What do you mean nobody knows where she is? The match is about to begin, and she's still not back yet? \nThis is quite unfortunate. Being late to her debut match will surely leave a bad taste in the fans' mouths. This certainly won't do any favors for Miss Valentine's future career! \nAnd in addition to that, she's going to need to personally look over her custom equipment, and if she's not here... \nHuh? Wait, what's that sound? \nHmm... Is that... somebody playing the flute? \n\nThe soft melody of the flute was gently carried along the wind, far, far away. \nEver higher, ever further away. \nThe wind continued to blow, to the place I promised to return to. \nPlease, take this tune back with you. \nPlease tell everyone. \nThat Justyna has finally become a knight. \nBut don't tell anyone. \nThat Justyna sorely misses her home. \n\n......\n......My goodness, how long have I been here?! \nI shouldn't be spacing out like that! Who has the time to sit around leisurely, playing a bland country tune? \nWell, whatever. \nThere's not much time left, I've gotta find Miss Valentine, and fast!"
    },
    {
      "moduleId": "uniequip_003_fartth",
      "moduleName": "Fan Letters",
      "desc": "To the incredible Ms. Justyna,\n\nI'm a loyal fan of yours!\n...I'm really sorry, I just don't know how to start this letter off. I've almost filled up the wastebasket with scrapped drafts at this point. In the end, I think that cliche is the only thing I can really write.\n\nThis is the first time in my life I'm writing a letter to a hero of mine. You said during an interview that you read every single letter from your supporters, and I know you wouldn't lie!\nFirst, I want to congratulate you on getting the title 'Fartooth,' it's so incredibly cool! I was there for your match with Feather Knight, the sight of you winning without any backup at all touched all of us there! It's only right you were #1 in the season!\nEver since I first saw a match of yours three years ago, I got really into you as a knight. You might not remember, but I was sat in the front row of the grandstand, and the knight who was against you slipped up with a move and almost hurt the audience, but then you blocked it even though you were injured. Among the people you saved, the ones behind you, were me and my family.\nEver since then, you've been an inspirational figure for me. You're a true knight, Ms. Justyna, I'm surer of that than anything. I was still a student then, and if I studied good enough and my grades got better, my family would reward me by taking me to see your matches. I could say you were the one who gave me the drive to keep heading forwards.\n\nI want to become a glorious knight like you so much! Knights would never point their arrowheads at the defenseless, and I don't believe you'd ever use violence against any Knightclub's fans!\nThe 'Fartooth' Knight Justyna I know doesn't concede even when she's hurt, and never talks down to other knights even in the arena. I, along with your other supporters, don't believe any of that slander against you, so please don't take those irresponsible newspaper reports to heart! We're all looking forward to you returning as soon as you can!\nAlso, when I heard you say you wanted to start your own Knightclub, I was over the moons! You always ran solo in the past, and sometimes you looked sort of lonely, so it made me and a lot of other fans really worried... In the end, whether you start your own Knightclub, join another one, or stay active as an independent knight, we'll always support you as long as it's your decision, Ms. Justyna!\nWe hope everything goes well for you!\n\nYour faithful supporter"
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "It's done. The battle plans, reports, and mission schedules have all been sorted... Eh... Is this not the right way? Sorry, I'm not used to this yet...",
      "voiceAsset": "char_430_fartth/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Iwona and Ashlock can make quite a ruckus together. I can't hear the wind when they do that. It's a pain.",
      "voiceAsset": "char_430_fartth/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Hm? Who's that in the training grounds...? The Radiant Knight? Doctor, is it okay if I go check it out up close?",
      "voiceAsset": "char_430_fartth/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "It's really close. When I sit here and look outside, I can see the crops in the distant ripening as the farmers harvest their fields. It's just like my hometown.",
      "voiceAsset": "char_430_fartth/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "It's actually not very hard to become a knight in Kazimierz if you're healthy. All you have to do is sign up at the arena. But to become a real 'knight' is difficult. Real difficult, even for those who are healthy.",
      "voiceAsset": "char_430_fartth/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "I agree with Sona's ideas, and I'm willing to fight for them... Though, I guess I might just be afraid of losing the one place where I belong. Doctor, do you also see Rhodes Island as a place you will protect no matter what it takes?",
      "voiceAsset": "char_430_fartth/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Thank you for treating us. Sona, Iwona, and Ashlock asked me to bring you these as thanks. And here's one that I picked. It's a small token of my appreciation.",
      "voiceAsset": "char_430_fartth/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "I used to dream of becoming a knight, but on the way to the Grand Knight Territory, I got infected in an accident. I still remember how it felt. The numbness spread from my palm to my fingertips... That was the first time I couldn't hold my sword.",
      "voiceAsset": "char_430_fartth/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "Here's a grass whistle... Want to listen to me use it? I used to whistle with it whenever I had some free time back home. The wind back then is not like it is now. It was clear as crystal, and it wasn't dangerous at all... It was calming.",
      "voiceAsset": "char_430_fartth/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Finally awake? Here, the files are sorted... Should be right this time, I think?",
      "voiceAsset": "char_430_fartth/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "'Fartooth' Justyna, Pinus Sylvestris Knightclub. You can call me Fartooth. I've heard about Rhodes Island and you in particular, Doctor.",
      "voiceAsset": "char_430_fartth/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "They're going to lose. If they don't take a proper defense stance, they won't be able to block this one. You've got them.",
      "voiceAsset": "char_430_fartth/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "A promotion? Is that something like advancing to the next round?",
      "voiceAsset": "char_430_fartth/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "There's not much that I want, and I don't have much either. That's why... as long as I'm still standing here, nobody can hope to take anything from me!",
      "voiceAsset": "char_430_fartth/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "...I'll do as you say. You are my commander, and I'll follow your orders.",
      "voiceAsset": "char_430_fartth/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "A team battle? Understood.",
      "voiceAsset": "char_430_fartth/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Ready. Line up... Sortie!",
      "voiceAsset": "char_430_fartth/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Wait, the winds have shifted... Everyone, stay alert!",
      "voiceAsset": "char_430_fartth/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Yeah, I'm ready whenever.",
      "voiceAsset": "char_430_fartth/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "One-on-one, or one-on-many?",
      "voiceAsset": "char_430_fartth/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "I hope we can win this match fair and square.",
      "voiceAsset": "char_430_fartth/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "I, 'Fartooth' Justyna, will be your opponent.",
      "voiceAsset": "char_430_fartth/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "The winds are stirring. I can tell.",
      "voiceAsset": "char_430_fartth/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "I've locked onto you.",
      "voiceAsset": "char_430_fartth/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "There's no need to talk in battle.",
      "voiceAsset": "char_430_fartth/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Let's put an end to this... You can't beat me; accept your defeat.",
      "voiceAsset": "char_430_fartth/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "You've done well, Doctor. This is a glorious victory.",
      "voiceAsset": "char_430_fartth/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "I fended them off just as you instructed... I'm being too solemn? Really...?",
      "voiceAsset": "char_430_fartth/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "I won't attack those who leave the arena.",
      "voiceAsset": "char_430_fartth/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Go on ahead...! I'll hold them here, Doctor! Lead the others away!",
      "voiceAsset": "char_430_fartth/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Not bad. The airflow here feels refreshing... Thank you.",
      "voiceAsset": "char_430_fartth/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Hm? What is it? Want an autograph?",
      "voiceAsset": "char_430_fartth/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Doctor...? Yeah, I can tell it's you without listening to your footsteps. The winds around you aren't like the others.",
      "voiceAsset": "char_430_fartth/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_430_fartth/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "There are so many noises mixed in on the wind here. Fireworks, dishes and glasses, the voices of people as they celebrate. My neighbors would be just as noisy every holiday back home, but I've never minded it, because that's how this day should be. Happy New Year, Doctor.",
      "voiceAsset": "char_430_fartth/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Don't move... Your hair's sticking out. That's right. Stay still. I'll fix it for you.",
      "voiceAsset": "char_430_fartth/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Here, Doctor. This is your present from me. It's a chime. Hang it on your window, and it'll sing whenever the breeze stirs. Very soothing. Happy birthday, Doctor. I gift you the sound of the wind.",
      "voiceAsset": "char_430_fartth/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "I brought this flute from home, and the only songs I play are ones my neighbors taught me. I know you can never return to the past, but that's not so bad, is it? Just like how the wind never blows back to where it came from. It carries itself on its own momentum, flying further and further away, to a loftier place.",
      "voiceAsset": "char_430_fartth/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "dorm_rec_all&oneself[042]",
      "buffName": "'Homecoming'",
      "desc": "When this Operator is assigned to a Dormitory, self Morale recovered per hour <@cc.vup>+0.55</>, and restores <@cc.vup>+0.1</> Morale per hour to all other Operators assigned to that Dormitory (Only the strongest effect of this type takes place)",
      "skillIcon": "bskill_dorm_all&one3",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "manu_prod_spd[002]",
      "buffName": "Pinus Sylvestris α",
      "desc": "When this Operator is assigned to a Factory, productivity <@cc.vup>+15%</>",
      "skillIcon": "bskill_man_spd1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "manu_prod_spd[012]",
      "buffName": "Pinus Sylvestris β",
      "desc": "When this Operator is assigned to a Factory, productivity <@cc.vup>+25%</>",
      "skillIcon": "bskill_man_spd2",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}