{
  "id": "char_2024_chyue",
  "meta_info": {
    "name": "Chongyue",
    "appellation": " ",
    "voiceActor": {
      "en": "Yong Yea",
      "jp": "Toshihiko Seki",
      "kr": "Koo Ja-hyoung",
      "cn": "Ling Zhao"
    },
    "rarity": 6,
    "profession": "Guard",
    "subProfessionId": "Fighter",
    "position": "MELEE",
    "team": "Sui",
    "tagList": [
      "Nuker"
    ],
    "nationId": "Yan",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Chongyue\n[Gender] Male\n[Combat Experience] Undisclosed\n[Place of Birth] Yan\n[Date of Birth] Jan 1\n[Race] Undisclosed\n[Height] 188cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Excellent\n[Mobility] Excellent\n[Physical Resilience] Standard\n[Tactical Acumen] Outstanding\n[Combat Skill] ■■\n[Originium Arts Assimilation] Flawed",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Chongyue, the elder brother of landship residents Nian, Dusk, and Ling. He has a close relationship with government organizations such as the Yanese Ministry of War and the Sui Regulator. Previously served as a martial arts instructor at the nomadic city Yumen, a position which he has resigned from. He came to Rhodes Island to visit his family, and after a round of audits, he is temporarily residing onboard the landship as a visitor. Chongyue possesses rich combat experience and has provided Rhodes Island his unique combat suggestions. However, as requested by Dr. Kal'tsit, Chongyue rarely participates in missions directly.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\n\n[Blood Originium-Crystal Density] 0.01u/L\n\nGotta say, since we had cases like Dusk and Ling before, I put in tons of prep work for Chongyue's medical examination. Hell, I pulled a couple people off of work just for this, and that's just the theoretical research guys at Medical. It's not often we get the chance, so I figured I'd collect biological data that could have research value... Chongyue was very amenable to the whole thing, but the results were kinda disappointing. True, all the values are terrifyingly high, but it's just a normal guy's body. You can tell he trains a lot... It's too normal.\nHow should I describe it... Like, you make an account in a game. Then, you grind for hours on end day after day to get to level cap. It's amazing, but c'mon! I'm trying to make cheats here, you know?\n— Closure",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Chongyue's routine is frightening. He wakes up at dawn for morning practice: exercising his breathing as well as the kung fu basics, such as legs, waist, and shoulders. Then, for four hours in the middle of day, he familiarizes himself with a variety of weapons and analyzes martial arts techniques. At dusk, he finishes his evening tasks, cultivates his foundations, and writes as well as keeps his martial arts records... and he does so every single day without fail.\nThe problem here is that ever since he agreed to become our interim martial arts instructor, this has become everyone's routine...\n'The key to success in kung fu can be summed up in one word: Diligence.' According to his explanation, in addition to training your body, practicing kung fu is more about training your mind and perseverance. I understand the logic, of course. I'm simply complaining. After all, the prospect of learning the legendary 'Divine Style' is alluring. To tell the truth, though, I still have some reservations about the authenticity of the 'Yumen showdown' account that Waai Fu gave us—how the winds and sand raged, the skies' colors changed, and how two masters rivaled by none in the world battled and settled their score in less than ten rounds—if I had heard this from Mr. Nothing, I'd definitely write it off as a tall tale. Perhaps it just goes to show how we still have much to learn about Yanese martial arts.\nAside from Yanese operators, Chongyue also sees many operators from other regions, such as Ursus and Sargon, attending his martial arts lectures. But when his students talk to each other in private, they seem to all have noticed in his lectures traces of the styles they already know, as well as, perhaps, the theory behind the moves and the methodology he applies force with. It's all very vague, but his methodology is simpler and more powerful... There are only two possibilities. One would be that Chongyue is a prodigy. He has seen more than half of Yan's martial arts styles and even those of other countries, and has improved upon them. The other would be that he is a prodigy, and has been to many places, and many of the styles are based on his... I digress. How would that even be possible?\nIn any case, Chongyue might be even stricter than Instructor Dobermann. Fortunately, Nian all of a sudden roped him into acting as a stunt coordinator for a movie series she is prepping. Come to think of it, though, in private, Chongyue is actually a rather kind person. He's not as difficult to figure out as Ling or as high-strung as Dusk... Just talking about this makes me miss his lessons.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "When Chongyue first came to Rhodes Island, most operators who'd heard of his background and exploits were under the impression that the grandmaster who defended Yan's northern deserts for years must be a strict, stuffy man and thus avoided him. This lasted until a certain operator was pestered by the library to return an overdue book and subsequently found out that the man who had reserved <i>Homesick, Homesick Blues</i> next was Chongyue. Thereafter, we inadvertently stumbled upon his many other interests: woodcarving, pottery, literature, coffee... A few clubs figured they would give it a shot and sent Chongyue an invitation to their events, and most of them received a reply, 'I will be there on time,' which only gave the event planners anxiety.\nChongyue's knowledge of the world outside the desert is actually very rich. He even shows considerable interest in the ever-changing pop culture all across the lands. At first, we thought he agreed to participate in Nian's movie because of brotherly love for his sister, but thinking back, perhaps he is actually interested in the workmanship and technology that go into filmmaking. It's worthy mentioning that Chongyue is very quick to learn. After only two months with the crew, he already had a basic understanding of technologies, such as how traditional film develops and the digital encoding and storage used in new films. Even though he is receiving training at a professional organization, he is learning at a shockingly fast pace.\nPerhaps we should put this another way. Chongyue may be a respected awe-inspiring grandmaster in both military and martial arts studies, but he is a willing, diligent student in other subjects. When this is brought up, a few of our younger operators thought nothing strange of this: 'There are tons of elders who can keep up with young people's topics these days. Maybe someone else's behind the times.'",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Classified Log]\nClosure's asked me this plenty of times already. My dear eldest brother can't do anything over-the-top like melt things down as he pleases like me, nor does he have any way to just diddle a thousand years away in a dream like Ling. He's got the body of a normal guy, what do you want from him?\n...\nOh, I just remembered something funny that I should really tell you. He's been inside Dusk's paintings before.\nA long, long time ago, he went to pay her a visit. She was too scared to see him, but she still had to, so—right, you're pretty good. Smart, aren't you—Dusk drew the mountain she was in, that shack of hers, and herself, all exactly the same. <i>Dusk</i> showed him her latest and greatest paintings, took him on a magnificent journey to tons of amazing sights: an exquisite palace that stretches far into the air beyond the cliff without collapsing, landbeasts crawling across lotuses mere inches wide to cross a great river, and a mountain full of rusted weapons on an old battlefield that have yet to wear away even after a thousand years... Then, she had to listen to him drone on and on for over an hour about how she shouldn't wallow in her inkscapes, and he even tried to persuade her to go to the frontier fortress with him like Ling... Just constant nagging like that.\nSo all in all he spent an entire day and night in that painting with that <i>Dusk</i>. Then, at daybreak, he tided up all the open scrolls there, and went on his morning practice. He executed a few sets, then, boom—the fog settles and the sun rises, and the painting's torn to shreds. Outside the painting, the mountain and the shack were the same as before. Of course, Dusk's dour face, too. Haha.\nHah, when did he figure it out? He probably knew right from the start. The way he put it, 'who wouldn't recognize their own sister?' As for why he had to wait a whole day and night, Dusk thought he was taking her for a ride. She can be immature like that. The way I see it, he was playing along with her wishes and cheering her up, haha.\nHow did he break out of the painting? Obviously, he stayed calm and paid attention to the tiniest details... Perhaps this is the 'sublimity' that kung fu folks like to talk about? I mean, why else do you think he loves human techniques so much? Instead of using martial arts to refute the old man's existence, it might be more fitting to say he used it to attain ultimate self-affirmation. It is through martial arts that he found to answer to the question, 'who am I?'\nAs for how he separated from the old man and molded that body of his, how am I supposed to know? Not like I was gonna learn from him. But now that that basket of blunders has figured out the trick behind it, he's bound to stir up trouble sooner or later. When the time comes, I sure hope our eldest brother will teach him a good lesson!\n...\nAlright, now sign this form for the camera equipment rental! Otherwise, that's all I'm gonna tell you.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Classified Log]\nThe Grandmaster has defended Yumen for years, and all of Yan is eternally grateful for his efforts. Likewise, the Sui Regulator would like to express our sincerest gratitude to your company for accepting him aboard your landship for recuperation, now that his years of accumulated stress have caught up to him and forced him to retire from his post.\nWe understand that Nian, Dusk, and Ling are also aboard Rhodes Island. These three are equally as important to Yan as the Grandmaster, and we ask your company to give all relevant matters the most appropriate treatment.\n...\n—Official correspondence from the Yanese Sui Regulator, discovered moments before Nian set it on fire in her furnace.\n\n'Retirement.' When I first heard our eldest brother utter that word, I was still in Yumen.\nHe has been busy, these many years, and far beyond Yumen. Wars in the north, pirates in the south; wheresoever the court doth wish him to be, there he will be. Of all us siblings, he was the first to abhor violence, yet remains the closest to violence. He's made acquaintance of many an interesting fellow, yet the more he meets, the lonelier he becomes. The affairs of man are chaotic. Is this the fault of war, or is it not...? Retirement has ever been on his mind, and the court has likewise guaranteed him one. Yet many springs and autumns have come and gone while I awaken from my drunken stupor, and still he awaited a more opportune moment. 'Twas in part the court's apprehensions, in part his own. And his long wish now fulfilled, as siblings we must rejoice.\n...\nBut is he truly free?\nOver these long years, too closely bound by ties to the military he has become. The Sui Regulator, the Ministry of Rites, the Ministry of War... Many eyes in the court, and few will wish to see him a hermit. Moreover, with days numbered, 'Ya' has returned to Yan, and with the sounds of war during that hunt a thousand years ago yet to cease, Its awakening can only draw ever closer. Perhaps there is someone else aside from that basket of blunders pulling strings behind the curtain...\nBy nature, we siblings love this mortal realm, and none of us wish to return to chaos... but this does not concern my eldest brother. Nay, he is no longer 'Shuo,' and has not been for some time. And thus, he loves this realm more than any of us. After all, Chongyue belongs to the mortal realm.\nAh, never mind. 'Tis nothing worth minding. When the water is turbid, let it be until it clears. When the water boils, take off the lid. Am I scared? What is there to be scared of...? When you sober up, raise another flask.\nRight. Do not trouble yourself going to him. While he is aboard Rhodes Island, let him enjoy his retirement.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'A beast lets whistle shrill. The mist folds part halo clear\nIt takes its number first. Came so hence all would form\nGlint ebon leaks past scales. Body unbroken hue\nIt hastes yet grasp eludes. Sight sinks earthward to seek\nWhat seals to bid Hui's dark? What parts to bid Ming's light?\nIts gaze goes far. The dayfly feeble there, what shudders grand it strikes\nThe skills of common man. What lengths their limits stretch\nThus arm it strives to vessel make. ■■■■ corpse, ■■■■ selfsame fight\n■■■■. Meld fore and hind as one, like Heaven changed with Earth\nIts grief is marked; man strifes in such extents. Such war should come to halt\nThus quest it has and will, clouds rent and haze begone. In universe, left sole.\n\n—While the cause is unclear, a portion of the characters midway through the rubbing of this inscription are indistinct and difficult to discern. Reportedly, Sui Regulator scholars have devoted themselves to long-term full restorative work, with headway already made.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 2160,
      "atk": 477,
      "def": 304,
      "magicResistance": 0,
      "blockCnt": 1,
      "baseAttackTime": 0.78,
      "respawnTime": 70,
      "cost": 11
    }
  },
  "skins": [
    {
      "skinId": "char_2024_chyue#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_2024_chyue",
      "portraitId": "char_2024_chyue_1",
      "illustId": "illust_char_2024_chyue_1",
      "modelName": "Chongyue",
      "drawerList": [
        "KuroBlood"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_2024_chyue#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_2024_chyue_2",
      "portraitId": "char_2024_chyue_2",
      "illustId": "illust_char_2024_chyue_2",
      "modelName": "Chongyue",
      "drawerList": [
        "KuroBlood"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_2024_chyue@nian#10",
      "skinName": "Alighting",
      "skinGroupName": "0011 Productions/IX",
      "skinGroupId": "2024#nian",
      "avatarId": "char_2024_chyue_nian#10",
      "portraitId": "char_2024_chyue_nian#10",
      "illustId": "illust_char_2024_chyue_nian#10",
      "modelName": "Chongyue",
      "drawerList": [
        "KuroBlood"
      ],
      "description": "<color name=#ffffff>0011 Custom Brand [Magnificence Curation] Series Collection/Alighting. Magnum opus of a Yumen craftsman, given to a traveler heading on a long journey. In the hope that men and might need no longer be a burden, that he can wander for myriad li with ease.</color>",
      "rarity": 64
    },
    {
      "skinId": "char_2024_chyue@cfa#1",
      "skinName": "All-Round Actor",
      "skinGroupName": "CROSSOVER",
      "skinGroupId": "2024#cfa",
      "avatarId": "char_2024_chyue_cfa#1",
      "portraitId": "char_2024_chyue_cfa#1",
      "illustId": "illust_char_2024_chyue_cfa#1",
      "modelName": "Chongyue",
      "drawerList": [
        "KuroBlood"
      ],
      "description": "<color name=#ffffff>Collaborative Series/All-Round Actor. Clothes Chongyue wears when studying past roles. The characters are so different, so how should one breathe life into them? He browses both scripts and tapes, experiencing life after life after life.</color>",
      "rarity": 176
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1246,
            "atk": 242,
            "def": 156,
            "magicResistance": 0,
            "cost": 9,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 0.78,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1684,
            "atk": 357,
            "def": 224,
            "magicResistance": 0,
            "cost": 9,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 0.78,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1684,
            "atk": 357,
            "def": 224,
            "magicResistance": 0,
            "cost": 11,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 0.78,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 2160,
            "atk": 477,
            "def": 304,
            "magicResistance": 0,
            "cost": 11,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 0.78,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3221",
          "count": 5,
          "type": "MATERIAL"
        },
        {
          "id": "30032",
          "count": 8,
          "type": "MATERIAL"
        },
        {
          "id": "30062",
          "count": 3,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 2160,
            "atk": 477,
            "def": 304,
            "magicResistance": 0,
            "cost": 11,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 0.78,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 2635,
            "atk": 590,
            "def": 363,
            "magicResistance": 0,
            "cost": 11,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 0.78,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3223",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30115",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "31024",
          "count": 5,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_chyue_1",
      "skillName": "Abundant",
      "desc": "Deals <@ba.vup>{atk_scale:0%}</> ATK as Physical damage to the target. When at maximum charges, removes all charges and deals damage for each charge removed\n<@ba.rem>Max 3 charges</>",
      "iconId": "skchr_chyue_1",
      "spCost": 3,
      "initSp": 0,
      "duration": 0,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 4
        },
        {
          "key": "cnt",
          "value": 3
        },
        {
          "key": "times",
          "value": 3
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30023",
              "count": 9,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_chyue_2",
      "skillName": "Whisk",
      "desc": "Deals <@ba.vup>{atk_scale:0%}</> ATK as Physical damage to up to <@ba.vup>{max_target}</> enemies and causes targets affected by Talent 1 to <$ba.levitate>Levitate</>, then removes <$ba.levitate>Levitate</> from all enemies with <$ba.levitate>Levitate</>, activates Talent 1 on them with 100% chance, and deals <@ba.vup>{atk_scale_down:0%}</> ATK as Physical damage\n<@ba.rem>Max 2 charges</>",
      "iconId": "skchr_chyue_2",
      "spCost": 10,
      "initSp": 9,
      "duration": 0,
      "blackboard": [
        {
          "key": "max_target",
          "value": 4
        },
        {
          "key": "atk_scale_down",
          "value": 6.5
        },
        {
          "key": "atk_scale",
          "value": 4.5
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31023",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31064",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_chyue_3",
      "skillName": "Anatta",
      "desc": "Deals <@ba.vup>{atk_scale:0%}</> ATK as Physical damage to the target and nearby enemies; after this skill has been used <@ba.vup>5 times</>: Chongyue's <@ba.vup>attack range increases</> and attacks <@ba.vup>hit twice</>; this skill becomes <@ba.vdown>auto-activated</> and <@ba.vup>deals damage an extra time</>.",
      "iconId": "skchr_chyue_3",
      "spCost": 8,
      "initSp": 0,
      "duration": 0,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 3.8
        },
        {
          "key": "cast_cnt",
          "value": 5
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31064",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30093",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30155",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_chyue",
      "moduleName": "Chongyue's Badge",
      "desc": "Operator Chongyue has demonstrated a remarkable aptitude for asserting the advantage in close-quarters combat.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Guard Operator during field operations to exercise Fighter responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_chyue",
      "moduleName": "'When to Wake Up'",
      "desc": "He opens his eyes, flickering silently in the depths of incense billowing from the censer. He feels—\nShattered.\nThe pain bites at his consciousness, charging straight at its source, and it seems that this wisp of smoke, this tiny flame is his body. No, he remembers that he had once been able to analyze all things in this world, level mountains and lay waste to cities with a flick of his tail. However, his consciousness should not have arisen from the midst of this chaos, for that which slumbers yet sleeps, and naught has changed since. The tendrils of smoke weave their way through the netting, sinking down to the base of the censer, where the wispy cloud swallows him whole. Why do I awaken? Why do I struggle? Why is it that at the deepest part of this tomb-like jail, there is an even narrower cage? His eyes become smoke, and he gorges himself on his own body, letting off a roar of fury at the nothingness before him.\nThe smoke shifts imperceptibly, as if a minute breeze has swept across the chamber of stone. He remembers—\nHumiliation.\nA great hunt, his defeat, the shame engraved on his bones and inscribed on his heart. His fury draws a picture of the past, where the strong were brought low by the weak, ancient time was overwritten by fleeting moment, and gods were toppled by commoners. The True Lung bled before the people, boiling copper and molten gold pouring onto the earth. For three thousand days and nights, smiths chiseled deep ravines into mountains, casting myriad forms of weapons. The altar became a stronghold, and the robes of the devotees burning incense concealed blades of edict divine. Yes, this was the price of such trickery. An incisive punitive strike, a wound that could not heal. The traces of this humiliation still reside in his body, and he plans to use this wound as a mold to cast a sword.\nA flame bursts forth from the censer as if pumped by a bellows, and the Candleholder on guard rings the alarm bell. He raises—\nA blade.\nWithin the boundless gloom, there are still other consciousnesses being born. At the moment, those consciousnesses are not as lucid as he, but they are as he, and they too seek to surface from the depths of this turbid pond. He still remembers how mortals would describe this sort of relationship, and he understands that they will be his... brothers and sisters. He endures the pain, as though his stomach had been split in twain, and flicks his wrist. The cloud of smoke bursts and dissipates, his sword rending apart heaven and earth from within the chaos.\nThe primordial fog shrinks back, and gloomy night becomes brightest day.\nThe Candleholders rush into the stone chamber, and the Imperial Guards surround the tomb layer by layer. At last, he feels—\nFreedom.\nThe smoke rises from the censer in spirals, standing steady on its stone platform. In the depths of its belly, the Feranmut yet slumbers. He feels that his own body has become lighter, as if he has turned into a wisp of smoke rising through a hole in the censer, floating across the heads of the Candleholders and Imperial Guards, floating past the sealed stone door of the mausoleum, floating through the skies above Baizao, towards distant lands."
    },
    {
      "moduleId": "uniequip_003_chyue",
      "moduleName": "Shuo",
      "desc": "Punch, relax, inhale, exhale—breathing out impurities. The breath leaves him like a lingering fog, spiraling through the air for some time. The sky has just cleared after a rain, and the slippery puddles reflect the grandmaster as he practices.\nMirrored movements at mirrored speeds, yet a thread of disharmony can be seen in this mirror image.\nChongyue halts and looks around.\nThe breath slowly forms into a shape with a head and tail—the shadow of a beast. It clings to his feet, eyes glaring like daggers.\nMobilizing his Qi, the grandmaster shifts position and surges forward with a flip. Clouds move and light shifts. The shadow twists, using the surrounding shadows to form a beast tail that threatens to strike him down.\nHe dodges and thrusts his palm, dispersing the tail instantly. But by then, the white fog has grown large. It opens its maw and bares its claws, poised to attack.\n'Hah!'\nWith a cry that shakes the earth, he tightens his fist, gathers force, and unleashes a punch. Wind whips as it connects, scattering the fog, yet it condenses again into a larger and now grayish-black beast, darkening the sun with its form. It narrows its eyes at the 'human' before it.\n'I know you won't give up that easily. Come; be it a hundred or a thousand times, I won't back down.'\nThe enraged beast stirs a wild gale, leaves sticking to it like green scales. It opens its jaws wide and charges at Chongyue.\nHe makes no move to avoid it, taking the full brunt of its fearsome blow. With a push of his palm, he sends it reeling.\n'What words can't convey, my actions will.'\nHe dashes forth, palm now again a fist, and slams down with all his might.\nA dull thud resounds across heaven and earth, followed by a violent roar.\nHe does not stop, instead raining down blow after blow, until the beast can no longer lift its head. Thunder rolls and dark clouds gather, but the beast seems to show slight signs of surrender.\n'A usual sparring would end here, but between us, I must go all out. Apologies!'\nChongyue leaps into the air, his body light as a feather, his fist heavy as a mountain. With a single strike, he punches a hole straight through his foe.\nWith this upper hand, he presses the attack. His fists become palms, then claws—his left tears as his right clutches—and the beast roars, unwilling to admit defeat. But in the end, the fog disperses, bereft of form and spirit. After a while, the sun begins to shine once more. Where the bestial shadow once swept, a sword now remains.\nThe grandmaster picks it up, unsheathes it, calms his heart, and steadies his Qi. A few breaths, and Chongyue paces his slightly quickened breathing.\n'Practicing a new move, grandmaster? It looked mighty impressive.' Two passing soldiers clap in awe, as if they have been watching for quite a while, and only dare to speak when Chongyue is completely finished.\n'It is nothing special. I dare not let my skills waste nor my original aspiration fade—\n'I was simply sharpening myself.'"
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "You would like to be my 'kung fu recorder?' The way Rhodes Island treats its guests truly moves me. It is no wonder my sisters love this place so much… I misunderstand?  No problem, I have no qualms with being your subordinate either.",
      "voiceAsset": "char_2024_chyue/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Doctor.' Your title reminds me of the Yanese scholars. Experienced and knowledgeable, they see the forest for the trees. You feel like we've met before? It's true that after awakening from my dream of chaos, I have traveled to many places... Sadly, the more friends I make, the lonelier I feel. Perhaps we are alike in that respect.",
      "voiceAsset": "char_2024_chyue/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "As you can see, I note down only my experiences and insights, rather than any specific kung fu moves. What really matters to the martial arts is 'Yi' — your intent. If you let yourself be constrained by those gaudy forms, you will find it hard to break out of them. Take Dusk's paintings, for example. If I couldn't grasp the intent behind them, and sought to discuss techniques and styles with her, she would only shut the door on my face.",
      "voiceAsset": "char_2024_chyue/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "I agreed to be a 'fight choreographer' for Nian's movie. It keeps her from making too much of a racket, or getting too lonely. Dusk is timid, and Ling is too fond of drink. I will look after them as well... We are far from a normal family. Nevertheless, we are siblings, and not the collective 'we' as we are often called.",
      "voiceAsset": "char_2024_chyue/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "Death is a daily occurrence to warriors on campaign. But the real challenge they face, is preserving their humanity and morality after facing such morbidity, rather growing jaded and desensitized. Indeed, conflicts and mortality have been the way of these lands for eons. But only those giant, terrible creatures are cold-hearted enough to think so.",
      "voiceAsset": "char_2024_chyue/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "The world is a vast place, and wonderful sceneries abound, yet man has limited strength and time. It is impossible to see all these sights, much less defend them. To those who practice the martial arts, all we can do is train day and night, from the depths of winter to the height of summer. It may sound like a clumsy and brutish method, but the result is giving every last drop you have, leaving no regrets.",
      "voiceAsset": "char_2024_chyue/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "That sword is an unwanted possession that must not be cast away. Huai Tianpei keeping it is an outcome that all concerned parties can accept. My duel with him, you ask? He trained for forty years, and landed a single heavy blow on me. But how many comings and goings of spring and autumn have I trained? All things considered, I was the one who lost.",
      "voiceAsset": "char_2024_chyue/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "'Who am I'... For this question, you need only gaze upon the water. Be it human, beast, mountains, foggy woods, or the reflection of the twin moons on the night sky, whatever it is you see, that is your answer. As for the distant, radically different future, whether we siblings will return to chaos and seek new answers, is an entirely different question.",
      "voiceAsset": "char_2024_chyue/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "The scholars at court seek perfect answers in everything. The kung fu practitioners who wander in jianghu seek revenge, status, glory, or a simple resolution. Their obsessions run deep, yet their time runs short. Often, they spend their whole lifetimes chasing a single ideal or undertaking... All those people, how woeful and pitiful, how respectable and regrettable.",
      "voiceAsset": "char_2024_chyue/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "The spring comes and goes, leaving a lonely autumn.",
      "voiceAsset": "char_2024_chyue/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Doctor, thank you kindly for taking care of my sisters. I hope you will excuse me for intruding upon Rhodes Island for a little while. Please call me 'Chongyue.' It's a name given to me by... an old friend of mine.",
      "voiceAsset": "char_2024_chyue/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "The colors that once embellished the autumn grass, hues long buried by war.",
      "voiceAsset": "char_2024_chyue/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "Often I think about those soldiers who traveled from all corners of Great Yan to Yumen. They risked their lives in battle until death took them, or their age crept upon themselves... yet never for their own ends.",
      "voiceAsset": "char_2024_chyue/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "Battles we have fought, death we have braved. Doctor, no need to say more.",
      "voiceAsset": "char_2024_chyue/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Lit, quenched, then lit again… The signal fires never ever rest.",
      "voiceAsset": "char_2024_chyue/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "In that case, Doctor, will you beat the drums for me as we sortie?",
      "voiceAsset": "char_2024_chyue/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "The sunset weaves a silken river. Heaven and earth bolster me upon departure.",
      "voiceAsset": "char_2024_chyue/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Warriors from afar rest scarce, the armor they wear spurs them to march.",
      "voiceAsset": "char_2024_chyue/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "One should spar from time to time.",
      "voiceAsset": "char_2024_chyue/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "At your command.",
      "voiceAsset": "char_2024_chyue/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Look at this spectacular sight. Alas, it is now a battlefield.",
      "voiceAsset": "char_2024_chyue/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Many intellectuals must join a battle before penning a decent verse, including that sister of mine… This too is an opportunity.",
      "voiceAsset": "char_2024_chyue/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Unsteady posture, wavering intent. Much to learn yet.",
      "voiceAsset": "char_2024_chyue/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "A thousand moves in one breath!",
      "voiceAsset": "char_2024_chyue/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Strike, and sunder the tides cleft. Retract, and leave no peace bereft.",
      "voiceAsset": "char_2024_chyue/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "After all this time, you still turn to war for solutions!",
      "voiceAsset": "char_2024_chyue/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "You calmly place your pieces to plot your victory... Doctor, a weiqi player like you is a truly rare sight.",
      "voiceAsset": "char_2024_chyue/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "A thousand armies move at the beating of your war drums, with a handful of sand to clean the blood from one's armor... What a tremendous victory!",
      "voiceAsset": "char_2024_chyue/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "There is never a true victory in brandishing a sword and formulating a strategy, while looking for gains and losses is an even greater folly. So long as you leave no regrets, then all is well.",
      "voiceAsset": "char_2024_chyue/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "All warriors must face defeat. Don't lose heart.",
      "voiceAsset": "char_2024_chyue/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "This is much more comfortable than a military tent. Can I even manage a good night's sleep without the sound of drilling soldiers…?",
      "voiceAsset": "char_2024_chyue/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Doctor, have you figured out how to counter that move from yesterday?",
      "voiceAsset": "char_2024_chyue/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "The times are changing, and man along with them. So too does the scenery change.",
      "voiceAsset": "char_2024_chyue/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_2024_chyue/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Nian, Dusk, and Ling are already drunk? It's not often Rhodes Island gets this lively...Let them be. Relax, I will keep an eye on them. Our sibling 'reunion' may be an extraordinary event to most, but this too is human nature. Who are we to reject participation in these traditions?",
      "voiceAsset": "char_2024_chyue/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Doctor, I did not see you at this morning's training session.",
      "voiceAsset": "char_2024_chyue/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Once I traveled through Sargon and taught the locals a few moves for their defense. From what I heard, they became very fierce and instigated many riots. Ever since, I have been careful who I teach. This booklet contains instructions on how to strengthen your body and health. Take it. It is a joyous day, after all.",
      "voiceAsset": "char_2024_chyue/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "Yumen throws a banquet rather like this every year, to reward its warriors for their work the year prior. The men would clatter their weapons and sing along with the beat. But the next morning, they would still be up for duty, no matter how inebriated. Just like that, Yumen has traversed the lands and defended Great Yan's peace for a hundred years. Doctor, what is it that you defend?",
      "voiceAsset": "char_2024_chyue/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "control_mp_cost&bd_up[000]",
      "buffName": "I am I",
      "desc": "When this Operator is assigned to the Control Center, self Morale loss per hour <@cc.vdown>+0.5</>; for each <$cc.g.sui><@cc.kw>Sui</></> Operator assigned to buildings other than Dormitories and Activity Rooms, <$cc.bd_b1><@cc.rem>Worldly Plight</></><@cc.vup>+5</> (max 5)",
      "skillIcon": "bskill_ctrl_cost_bd3",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "control_mp_bd_cost_expand[000]",
      "buffName": "Solitary Light",
      "desc": "When this Operator is assigned to the Control Center, Operators working in <$cc.c.room2><@cc.kw>other buildings</></> recover <@cc.vup>+0.05</> Morale per hour, with an additional <@cc.vup>+0.05</> for every <@cc.vup>20</> <$cc.bd_b1><@cc.rem>Worldly Plight</></> (<$cc.c.sui2_1><@cc.rem>Special Comparison Rules</></> apply with Control Center bonus)",
      "skillIcon": "bskill_ctrl_cost_bd4",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}