{
  "id": "char_113_cqbw",
  "meta_info": {
    "name": "W",
    "appellation": " ",
    "voiceActor": {
      "en": "Caitlyn Bairstow",
      "jp": "Ayana Taketatsu",
      "kr": "Park Ko-woon",
      "cn": "Ruan "
    },
    "rarity": 6,
    "profession": "Sniper",
    "subProfessionId": "Artilleryman",
    "position": "RANGED",
    "team": "Babel",
    "tagList": [
      "DPS",
      "Crowd-Control"
    ],
    "nationId": "",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] W\n[Gender] Female\n[Combat Experience] 11 Years\n[Place of Birth] Kazdel\n[Date of Birth] Claims to have forgotten\n[Race] Sarkaz\n[Height] 165cm\n[Infection Status] \nConfirmed Infected by medical examination.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Standard\n[Mobility] Standard\n[Physical Resilience] Excellent\n[Tactical Acumen] Outstanding\n[Combat Skill] Excellent\n[Originium Arts Assimilation] Standard",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "W, Sarkaz mercenary leader. W's squad, having been involved in Kazdel's lengthy civil war, is infamous for their brutal and efficient combat methods. W clashed with Rhodes Island during the Chernobog incident, but after defecting from Reunion for unknown reasons, signed a strategic cooperation agreement with Rhodes Island after negotiating with Dr. Kal'tsit in person.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests have shown the outlines of W's internal organs to be indistinct due to abnormal shadows. Originium granules have been detected in her circulatory system, confirming her to be infected with Oripathy. \n\n[Cell-Originium Assimilation] 14%\nMercenary W shows clear signs of infection. No further examinations available. \n\n[Blood Originium-Crystal Density] 0.29u/L\nThere is little reason for optimism regarding W's prognosis due to prolonged exposure in the Kazdel region, as well as unchecked abuse of military-grade Originium products. However, she has never experienced dysphoria regarding her status as an Infected; perhaps, as is true for many Sarkaz, she has become accustomed to persecution for her dual identity. \n\nAs everyone already knows, W has a very disagreeable personality. Even after entering into a cooperation agreement with Rhodes Island, she has never agreed to an examination— yes, that's right, examination, not treatment. To be honest, I don't know many who are willing to treat her, beyond their duties as medics. Even so, this Sarkaz has demonstrated remarkably little willingness to comply with anything, frequently spouting off rubbish such as 'If you don't want to help, then don't bother,' or 'I've duked it out with folks like you before. No need to stand on ceremony here.' Of course I already knew that, but... even though that's a different matter, bring her over here right now! \n—A medical department director",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "W belonged to an independent mercenary team during the war in Kazdel. The team gained notoriety for its frequent raids on commercial Laterano convoys, and many of its members have claimed their guns as trophies. These guns, often awarded as part of a formal ceremony, fetch a very high price at the Scar Market, Kazdel's infamous black market. W herself still has a number of these guns in her collection, but it was marked as contraband and confiscated following her onboarding in order to avoid arousing the ire of our Laterano operators. Among the many weapons she uses is an explosives-launching device with obvious signs of modification. As for its provenance... after thorough consideration, we decided to not investigate the matter further. \nFollowing the conclusion of the war, W accepted an offer from Talulah to fight for Reunion as a mercenary, thus becoming one of Reunion's accomplices. Subsequently, W unilaterally broke off her cooperation with Reunion and reached an agreement with Rhodes Island that continues to this day. From the above, we most likely have no way of determining W's specific role during the Kazdel Civil War, her motivation in joining and then quickly betraying Reunion, or her purpose in cooperating with Rhodes Island. We know nothing about her history from the onset of the Kazdel Civil War to the time she joined Reunion. Considering that W is still a mercenary, and also factoring in what she did during the incident with Reunion, we urge all ordinary operators to keep their distance from W as much as possible, and also urge all departments to exercise caution when dealing with these dangerous collaborators. \n[Classified Log]\nYou want an ordinary operator to keep tabs on W? Isn't that asking too much? They'd lack critical information. But since we're old acquaintances, why not let me take care of it? \nFine, fine. We should be thankful W rarely needs to stay aboard the landship. Everyone hates her as much as they fear her, but how could things be that simple? What I'm asking is: how complicated could she be? If you know what she used to be, you should know how to get along with these lunatics. Her skills are the real deal - otherwise, how would she have been able to pull all her mercenaries from Talulah? But don't worry, even if she dared pull something on us, Dr. Kal'tsit would see right through it. \nStill, we should definitely keep our distance from her. Especially for our adorable operators who don't get how the world works. W could really upset them. As for our elite operators... I worry that equal parts conflict and alcohol could spark an explosion that ends up destroying half of the ship, if not all of it. I hope that never happens. I'm serious. \nFinally, please remember that as members of the HR Department, we would never recruit an unstable person into the ranks of Rhodes Island. That's the most important condition for employment, after all. So the possibilities are twofold - first, the situation is dangerous enough to demand such measures, or second... we've always known the truth. Or it could be a bit of both. Wouldn't you agree? \n—■■■",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Sarkaz mercenaries. Up until the final days of Kazdel's Civil War, mercenaries were the most common armed forces seen in Kazdel's barren lands. Each of them worked in small teams, sometimes being recruited by nobles with vast funds and supplies, other times forming spontaneous coalitions with other mercenary teams. In Kazdel, where allegiances shift like the sands and various groups frequently find themselves at each others' throats, the concepts of life and death take on a different form than compared to any other region. For the soldiers mired in conflicts across the regions, becoming mercenaries has become an increasingly popular option. In the history of modern warfare, the topic of 'Sarkaz mercenaries' has always been a subject of intense debate. Some Sarkaz mercenaries were sponsored by someone outside of Kazdel who was both well-equipped and skilled in local strategic configurations, an alarming arrangement that posed a security challenge to all parties. As a result, professional forces dedicated to counteracting the Sarkaz mercenaries have been formed, though specific details are not yet available. \nAfter the incumbent regent clashed with the orthodox royal family to spark the civil war, the remnants of Kazdel's army which had been scattered among various nobles began to gradually unite with civilian forces, eventually being split into factions. The fighting was brutal and harrowing, but some scholars believed that the Civil War allowed a new process of redistribution and restructuring to take root in the barren and chaotic Kazdel. Although the heirs of the orthodox royal family were expelled from Kazdel, they were still supported by various ancient clans and noble families who pitched their massive economic power into unifying a large number of mercenaries, effectively gathering these scattered warriors under a king's banner. This event is considered to be the official start of the mercenaries' prominent role in the Civil War. Shortly afterwards, the regent's side returned fire and did the same. As a result, most mercenaries were brought under one of these major banners, which to some extent eroded the original meaning of the term, 'mercenary.' Despite this, there still remain a small number of mercenaries who are unwilling to get shackled down to this unsurvivable conflagration, and still struggle to maintain an independent position between the two main groups. They believe that mercenaries, or rather, Sarkaz as a whole, should be free. Their deeds are widely circulated as legends among the civilians of Kazdel, albeit having been heavily embellished for artistic purposes. \n—'Struggle and Freedom' Chapter 2 - 'Kazdel and the Modern History of Mercenaries,' excerpt. This book came from W's personal belongings, and the author's name is unexpectedly abbreviated to only the letter 'H.' The sentence, 'Sarkaz should be free,' is highlighted in red.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "W and her squad remained largely independent from Rhodes Island, and considering the peculiarities of Sarkaz mercenaries, rarely spent time stationed on the Rhodes Island landship. Even her infrequent sightings on the ship are enough to cause quite an uproar. \nOne need not reiterate W's nasty temperament, and aside from Dr. Kal'tsit and the Doctor, she considers few to be worth her attention. The last time W came back to the ship for debriefing, we almost had a brawl with two elite operators on our hands... the reason? W provoked them, of course. Even when there is no ill intent behind her words, her attitude alone is enough to incite conflict, particularly when it comes to the dead — including the ones she had something to do with! Truly, a Sarkaz who sheds neither blood nor tears! \nOh, right, regarding Amiya. \nAmiya does not seem to know much about W, and W, despite not considering Amiya to be particular noteworthy, will still defer to her. Isn't that strange? We all think so. Despite her grumbling, complaints and tendency to disregard orders and act according to her own judgment, W has complied with Amiya's orders, at least when it comes to reporting results. It's as if... W has high expectations for Amiya, but I don't think that's a good thing. \nOne more thing - I'm not entirely sure if this is just my imagination, and the boss stops my observations—\nBut sometimes, W will stand in front of an empty room, unmoving... as if in a daze. Other times, she'll just watch Amiya while she goes about her daily business. Yeah, just stare. \nWhat in the world could she be thinking? In the likely event that it's something dangerous, we must take precautionary measures. \nImportantly... every time she was observed, she wasn't smiling.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Classified Log]\nDoctor, I'm sure you realized this as well, but there is some relationship between W and Rhodes Island... as well as with your past. \nWhen a Sarkaz like Flamebringer showed up at Rhodes Island, I knew this day would come. Miraculously, from Kazdel to Ursus, then to Lungmen to today, and maybe on into the future, we've continued to move forward, but we still meet the same people we started this journey with - only now, with the far-reaching effects they left behind. And once again, I have to come to terms with the fact that there are things in this life that we can't avoid, or run from. I talked to Ms. Kal'tsit and Amiya, and even brought a bunch of snacks to bribe Closure with - and everyone had a different opinion. \nI begged ■■■ to please let me talk to you, Doctor. Even though you might not recognize me anymore, I feel like I have to talk to you about something. You just have to keep thinking of me... as a Sarkaz boiler worker. \nI wanted to talk about W. I've known W for a long time. Did W mention this to you... while She was still alive? About Her Majesty. Us 'old Operators' swore to never speak of this again, but it's not because we're trying to hide anything from you, Doctor. The reason is simple - none of us are willing to confront that past. Ms. Kal'tsit... also knows about this, of course. Hm? Don't worry, I checked in with her before I came by. There are some things I can't do as thoroughly as she'd like, so I'm just here to have a little chat. \nBack to W - in the beginning, she was a kid, who only knew to follow Her Majesty's orders, and nobody else's. Even among the then-unified Sarkaz, not many people knew about W's existence. What about Amiya, at the time? They wouldn't have met each other by then; after all, she had just enlisted as a mercenary. Unscrupulous, cynical, and flashing that devil-may-care smile. As for me, I was just a boiler worker at the time who had never seen a battlefield— huh? That's right, I built these muscles at work... I just got lucky and beat that elite operator at arm wrestling... I've never been on the battlefield. I don't know how extreme the soldiers thought W was, and I don't know why they thought she was unstable. I've never seen her in a fight, except she came back from a mission, trailing behind Her Majesty, thinking it's not her place to even say hello. The way I see it, she was trying to follow Her Majesty. Following Her ideals, Her light, just like every Sarkaz before. \nBut W isn't that person anymore. There aren't very many people at Rhodes Island who know about W. But most of the people W knew are gone now. She wore her disguise... for too long, and it sank in too deep. She used to have some friends. Yes, even someone like her still needs the help and companionship of friends. They used to all fight alongside us, and though it wasn't for a very long time, if those friends were still here today, they might still be able to lend her a helping hand. Now, I'm thinking there isn't a single person is left who can help her. That's right, nothing we can do. Nothing you or Dr. Kal'tsit can do, and I'd get it if nobody wanted to do this anyway. But we shouldn't take that for granted. \nWe all want to know what W is after, and what her plans are. In her eyes, is Rhodes Island just a flash in the pan, or a brand new future to carry the hopes of the past? That's a very important question, maybe even more important to people still haunted by the past. That includes Amiya, and even Ms. Kal'tsit. It also matters to how W will handle her relationship with Rhodes Island in the coming days, as well as with Amiya, Ms. Kal'tsit, and even you. \nHm? Oh. There's a simple reason I came to see you. You might not remember the past, but the people from your past keep popping up, one by one. Some are trusting, some not so much, and I'm sure you must be having a hard time dealing with them... Haha, too bad I'm just a lowly boiler worker with no place to worry about the Doctor of Rhodes Island. \nMs. Kal'tsit and Amiya may be able to take good care of you, and also keep Rhodes Island in steady, continued operations. But W... is nothing like them. Whether she's coming at you, or the other way around, I just hope both of you can keep calm and don't be hasty. \nI wanted Amiya or Ms. Kal'tsit to tell you this stuff, or at least have it delivered by ■■■. Everyone gave up and let me do it, but truth be told, I'm also pretty nervous. \nI mean, I'm just your typical, run-of-the-mill Sarkaz. I can't do crazy Arts or swing big swords and axes - if anything, I'd just drop them on my feet. The best I can do is to take care of my own work. All I hope... is that Rhodes Island can keep on trucking across the world, safely. \nHm? You have a question for me? Theresa? You... where'd you hear that name? \n... Theresa, huh? \nMaybe it won't be so long before you have to truly face your past.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'So you didn't actually...'\n'Death is a great way to get people off your trail. It was his idea to sneak out and meet you here, that's all.' \n'So when do we go to Victoria? Wouldn't want to keep our usurper waiting.' \n'The situation in Victoria is a lot more complicated than you think. Don't have that much info on Theresis, you know?' \n'Still not enough for you?' \n'Maybe for you. But for Rhodes Island? Not even close. Do you want to get everyone killed?' \n'Fine, fine... since you're so eager to give this a try, I thought you... Oh, did you just want to go help that guy?' \n'I want you to sit quietly for now. It's not time yet.' \n'Oh... in other words...?' \n'......'\n'How about that? To think we'd be get all these clues about Londinium just by hanging out at Rhodes Island for a bit. How could Kal'tsit be that unprepared?' \n'You've done your homework, so stuff like this happens. After all, you also 'get along' so well with the Doctor.' \n'Piqued your interest, huh?' \n'Not really. I'd like to head back and see Ascalon, if I get a chance.' \n'Are you going to Rhodes Island yourself?' \n'Sure am. I'm looking forward to seeing what you do next, so try your best to not die when you leave Victoria. We still have a lot of unfinished business.' \n'It's okay, don't worry about it. We'll tie up all our loose ends someday.' \n'Hmph... You'd better uphold your end of the deal. I'll be waiting. '",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1284,
      "atk": 711,
      "def": 112,
      "magicResistance": 0,
      "blockCnt": 1,
      "baseAttackTime": 2.8,
      "respawnTime": 70,
      "cost": 29
    }
  },
  "skins": [
    {
      "skinId": "char_113_cqbw#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_113_cqbw",
      "portraitId": "char_113_cqbw_1",
      "illustId": "illust_char_113_cqbw_1",
      "modelName": "W",
      "drawerList": [
        "Liduke"
      ],
      "description": "The outfit that the mercenary, W, wears most often.\nSince that moment, this outfit has become W's favorite.",
      "rarity": -50
    },
    {
      "skinId": "char_113_cqbw#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_113_cqbw_2",
      "portraitId": "char_113_cqbw_2",
      "illustId": "illust_char_113_cqbw_2",
      "modelName": "W",
      "drawerList": [
        "Liduke"
      ],
      "description": "After receiving Rhodes Island's permission, a certain dangerous person received a lot of dangerous weapons.\nShe happily tinkered with these weapons to make the best use of them whenever needed. Even working with these ruined industrial products never left a trace on her clothing — or rather, she prepared a lot of embellishments to maintain her disguise with ease.",
      "rarity": -10
    },
    {
      "skinId": "char_113_cqbw@epoque#7",
      "skinName": "Fugue",
      "skinGroupName": "EPOQUE/VII",
      "skinGroupId": "2020#epoque#6",
      "avatarId": "char_113_cqbw_epoque#7",
      "portraitId": "char_113_cqbw_epoque#7",
      "illustId": "illust_char_113_cqbw_epoque#7",
      "modelName": "W",
      "drawerList": [
        "Liduke"
      ],
      "description": "EPOQUE Line [Passe] Series Selects/Fugue. Ordinary Sarkaz mercenary wear. Easy to mend, protective, and carries even more explosives after simple modification.",
      "rarity": 22
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "3-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 821,
            "atk": 397,
            "def": 68,
            "magicResistance": 0,
            "cost": 25,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1027,
            "atk": 568,
            "def": 89,
            "magicResistance": 0,
            "cost": 25,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "3-8",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1027,
            "atk": 568,
            "def": 89,
            "magicResistance": 0,
            "cost": 27,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1284,
            "atk": 711,
            "def": 112,
            "magicResistance": 0,
            "cost": 27,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3241",
          "count": 5,
          "type": "MATERIAL",
          "name": "Sniper Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_SNP1"
        },
        {
          "id": "30012",
          "count": 12,
          "type": "MATERIAL",
          "name": "Orirock Cube",
          "rarity": 2,
          "iconId": "MTL_SL_G2"
        },
        {
          "id": "30022",
          "count": 5,
          "type": "MATERIAL",
          "name": "Sugar",
          "rarity": 2,
          "iconId": "MTL_SL_STRG2"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "3-10",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1284,
            "atk": 711,
            "def": 112,
            "magicResistance": 0,
            "cost": 29,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 1605,
            "atk": 912,
            "def": 133,
            "magicResistance": 0,
            "cost": 29,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3243",
          "count": 4,
          "type": "MATERIAL",
          "name": "Sniper Dualchip",
          "rarity": 5,
          "iconId": "MTL_ASC_SNP3"
        },
        {
          "id": "30125",
          "count": 4,
          "type": "MATERIAL",
          "name": "Bipolar Nanoflake",
          "rarity": 5,
          "iconId": "MTL_SL_BN"
        },
        {
          "id": "30054",
          "count": 7,
          "type": "MATERIAL",
          "name": "Keton Colloid",
          "rarity": 4,
          "iconId": "MTL_SL_KETONE4"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_cqbw_1",
      "skillName": "King of Hearts",
      "desc": "Immediately launches a grenade, dealing <@ba.vup>{atk_scale:0%}</> ATK as Physical damage to all enemies hit and <$ba.stun>Stunning</> them for <@ba.vup>{stun}</> seconds",
      "iconId": "skchr_cqbw_1",
      "spCost": 16,
      "initSp": 0,
      "duration": -1,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 3.5
        },
        {
          "key": "stun",
          "value": 3
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30103",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_cqbw_2",
      "skillName": "Jack in the Box",
      "desc": "The next attack buries a mine (lasts for 120 seconds) in a deployable tile within this unit's Attack Range; The mine will detonate when an enemy passes by it, dealing <@ba.vup>{atk_scale:0%}</> Physical damage to all nearby enemies and <$ba.stun>Stunning</> them for <@ba.vup>{stun}</> seconds",
      "iconId": "skchr_cqbw_2",
      "spCost": 8,
      "initSp": 0,
      "duration": 0,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 2.8
        },
        {
          "key": "stun",
          "value": 2.2
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30043",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 10,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_cqbw_3",
      "skillName": "D12",
      "desc": "Places bombs on up to <@ba.vup>{max_target}</> enemies within Attack Range, prioritizing enemies with the highest HP; After a delay, the bombs will detonate, each dealing <@ba.vup>{atk_scale:0%}</> ATK as Physical damage to nearby enemies and <$ba.stun>Stunning</> them for <@ba.vup>{stun}</> seconds",
      "iconId": "skchr_cqbw_3",
      "spCost": 33,
      "initSp": 20,
      "duration": 0,
      "blackboard": [
        {
          "key": "max_target",
          "value": 4
        },
        {
          "key": "atk_scale",
          "value": 3.1
        },
        {
          "key": "stun",
          "value": 5
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30053",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_cqbw",
      "moduleName": "W's Badge",
      "desc": "Operator W has demonstrated a remarkable aptitude for inflicting physical casualties on multitudes of enemies.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Sniper Operator during field operations to exercise Artilleryman responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_cqbw",
      "moduleName": "Mercenary's Bag",
      "desc": "The mercenary's bag has an interlayer, and within it go things she doesn't normally bring out.\nYoung, wandering children are all too common a sight across these lands, most clinging onto their bitter lives. A little girl pleads with a group of monsters, hoping to be spared some food.\n'Please, please, help me!' says the little girl, 'I can do a lot of things, I can help you too.'\nThe monsters take pity on this wasteland vagabond, and they accept her, allowing her into a small den she can call home.\n'You're so nice!' she says, with her tiny cloth bundle. 'I can hunt—I'll bring back even more food for you.'\nThe skies grow dark, and dark means unsafe. She shrinks into her hiding spot, looking out at the dim sky.\n'We don't have enough food. You said you would hunt. Now's the time.' The leader of the squad of monsters brushes its hair out of its eyes, and says to the girl, 'Bring back more food.'\nThe girl journeys out alone into the dark, and all the creatures under the night sky tuck themselves away, leaving her with nothing. But, far in the distance, she catches sight of a small campfire, a bag of food full enough for several days, and a seemingly very listless mercenary.\n'Take it.' The thought pops into her head. Finally, she reaches out and manages to grasp the bag. Inside is something she hasn't eaten in a long time—real food.\nSnatch it, steal it, whatever it takes. Getting it is the only way the monsters will recognize her; taking it is the only way they will let her stay. She clutches it tight and starts to run.\nWith the mercenary giving chase, the girl runs all the way back to the squad of monsters, and they rush at the mercenary, claws out.\nBut the wails she imagines never come. The mercenary seems to be saying something in a loud voice. The girl peeks out from behind the bonfire. The mercenary takes the monsters once more into the black night, and after a brief departure, they come back.\nThe monsters are delighted, crying out in celebration, as they haul a modest convoy of supplies out from the night. Time passes, growing darker still, and it comes time to rest.\nThe girl lies down in relief, the mercenary takes watch duty, and after they are done celebrating, the monsters too sleep beside the bonfire.\nShe takes stock of this newcomer, and the newcomer returns her gaze. After a brief moment of eye contact, she turns away and shuts her eyes.\nThe monsters murmur as they dream, and the mercenary adds some wood to the fire. Only one pair of eyes is open, glinting in the flames, and they size up the camp.\nWhen the only sound to be heard by the bonfire is steady breathing, the girl opens her eyes.\nOnce all the other sounds completely disappear, she emerges from her hiding spot.\n'We make a good team.' In the mercenary's hand is a blade, slicked with a liquid, thick and red. The girl looks around, taking in the state of the camp.\nShe finds a patch of ground to sit down on, still more or less clean. The mercenary starts moving the things back to their camp, and, left alone, she looks up at the moons.\n'...Traitor!' The sole remaining monster charges out from some corner, breath ragged and letting out an incomprehensible voice. It grapples the girl.\n'I'm going to die like this,' thinks the girl as she struggles desperately. 'I can't die.'\nA hole is made in her little bundle; a shard of a blade cuts through the cloth in her grip and slices her hand. She grips this shard tight, and thrusts it into the night over and over, until the monster can no longer hold of its weapon. Thick, sticky, red liquid trickles to the floor.\nSurvive.\nInside the interlayer of the mercenary's bag is the shard of a blade, something she placed in there even before she was a mercenary."
    },
    {
      "moduleId": "uniequip_003_cqbw",
      "moduleName": "Lost Dull Knife",
      "desc": "A hungry slave stumbled through the desolate wastes beneath a starry sky, spotting a silent mercenary by a campfire in the distance.\n'I'm searching for an unstoppable giant ship in the wilderness. I've heard that the ship's master will give us sanctuary.'\nThe slave nervously prostrated himself on the ground, offering his only weapon.\n'Who are you?' The mercenary didn't even look at him.\n'I'm an escaped slave from the Scar Market. I accidentally injured a guard and can't go back, but I want to live.'\nThe mercenary gazed at the campfire in silence for a moment. 'I know where the giant ship will pass tomorrow. After daybreak, I'll take you there.'\nThe slave expressed gratitude to the mercenary, set down his weapon, and attempted to sleep where he stood.\nThe one-armed guard shuffled through the starlit wasteland, spotting the silent mercenary by a campfire in the distance.\n'I'm searching for an unstoppable giant ship in the wilderness. I've heard that the ship's owner will give us sanctuary.'\nThe guard nervously stood still, holding no weapon to protect himself.\n'Who are you?' The mercenary didn't even look at him.\n'I'm an escaped guard from the Scar Market. I let a slave go out of compassion and can't go back, but I'm willing to serve a new master.'\nThe mercenary gazed at the campfire in silence for a moment. 'I know where the giant ship will pass tomorrow. After daybreak, I'll take you there.'\nThe guard expressed gratitude to the mercenary, concealed his severed arm, and tried to sleep where he stood.\n'However, only one of you can go.' The mercenary stood up, a disgusted expression illuminated by the campfire.\nIn the firelight, the slave and the guard saw each other's eyes.\n'I'll be back after daybreak.' The mercenary left the camp and vanished into the starlit wilderness.\nWhen the first beam of light fell upon the wastes, the mercenary returned to the extinguished campfire.\nBoth the guard and the slave had disappeared, leaving behind only a lone weapon.\nWith the weapon in hand, the mercenary returned to the giant ship. The giant watching the gate was curious about their fate.\n'I don't care. They were never qualified to serve Her Majesty.'\n'And what's your standard, how are you so sure?' The giant playfully teased the mercenary.\n'For as much as she's ever reprimanded me, she never considered kicking me out.' The mercenary laughed and said, 'The standard, of course, is me.'"
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "Truthfully, I've thought up countless possibilities about coming back here, looking out at the same scenery that she saw that day... But I never could have imagined that I'd actually be standing here with you. Heh, It's just too outrageous, 'Doctor.'",
      "voiceAsset": "char_113_cqbw/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Where'd I go? Can't tell you. Kal'tsit bypassed you and gave me a secret order... I'm lying? Oh my, I'm almost touched by how much you trust her. Fine, fine. I just went to splurge on a bunch of clothes, that's all. And I've already gone through inspection. What, are you surprised?",
      "voiceAsset": "char_113_cqbw/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Some of your little cuties are always glaring at me through gritted teeth. But when are they actually gonna find the balls to pick a fight...? Kal'tsit already explained the situation? They're dealing with it? C'mon, show some respect for the needs of your staff. Just let 'em come at me. I'm bored out of my skull here anyway.",
      "voiceAsset": "char_113_cqbw/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "You used to like working with us mercs a whole bunch. Mercenaries are efficient instruments of war. Just like fast food, ready to eat and easily disposable. You want to know what happened in the past? Hmm, some people would prefer I keep my mouth shut about that topic. Say, it must be such a blessing to not remember anything, right?",
      "voiceAsset": "char_113_cqbw/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "Save the Infected? Almost all the Sarkaz in Kazdel are infected, and you haven't even seen the kinds of oppression and conflict that go on there... So, how far do you plan to go with this 'salvation'? You got Kal'tsit, who can't even protect ONE single Sarkaz. And you, a goddamned hooded amnesiac. Now, tell me, what are you gonna do?",
      "voiceAsset": "char_113_cqbw/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "Look at these fresh operators of yours, starry eyes, full of naïvety. Can't help but wonder, if they had to watch those kind and gentle folk die, one by one, would they still do things the same way, with the same old song and dance? Hey, I'm not trying to look down on anyone. I'm just reminding you, don't just go twisting her ideas into some stupid little joke.",
      "voiceAsset": "char_113_cqbw/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Hey you, ever noticed those little thingies Amiya wears? You do know that Kal'tsit is keeping stuff from you, right? Man, I thought you were super smart and observant and good at getting everyone to trust you, considering you don't remember a thing. Honestly, it's kinda weird that you can even trust other people. Makes me wonder what those two jerks would say if they saw you like this.",
      "voiceAsset": "char_113_cqbw/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "This place sure does get all kinds, huh? A lot more weirdos here than before. Oh, don't get me wrong. I don't give a shit what they're thinking. But I gotta say, Amiya's doing a pretty good job. At least she's working hard to become more like a certain someone, and I can't say I hate that.",
      "voiceAsset": "char_113_cqbw/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "Dr. {@nickname}, since nobody's ever mentioned this to you before, I'm pretty curious how you'll react when you start to remember what happened— Don't give me that confused look. For now, just remember this name: Theresa. Yeah, Theresa.",
      "voiceAsset": "char_113_cqbw/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Somebody's got it easy. Never thought there'd come a day when the {@nickname} would be napping here completely defenseless... The past doesn't bug you at all, huh? Sleeping like a baby…",
      "voiceAsset": "char_113_cqbw/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Sarkaz mercenary, W. It's been a while, but I guess 'a while' might be something totally different for you. Aw, don't worry, the 'you' here isn't the 'you' I'm looking for. So you're safe, for now. Just for now.",
      "voiceAsset": "char_113_cqbw/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "This is all too familiar. Kinda scarily familiar. Be straight with me, did you really lose all your memories?",
      "voiceAsset": "char_113_cqbw/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "Yeah, yeah, I'm listening. Didn't think you'd be this hands-on with stuff. Honestly, I'd rather snatch a medal off someone else than suffer this honor from your hand.",
      "voiceAsset": "char_113_cqbw/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "It's a funny little thing that I get to fight alongside this version of you. And look, it turns out the two of us can get along. At least, until you remember what happened that day…",
      "voiceAsset": "char_113_cqbw/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Hey everybody, let's try to stay alive.",
      "voiceAsset": "char_113_cqbw/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "A mercenary's leadership is about practicality. Don't expect a babysitter.",
      "voiceAsset": "char_113_cqbw/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Yep. Another beautiful day.",
      "voiceAsset": "char_113_cqbw/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Kill them all to finish the job, right? Not that simple? What a pain in the ass...",
      "voiceAsset": "char_113_cqbw/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Roger that.",
      "voiceAsset": "char_113_cqbw/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Understood.",
      "voiceAsset": "char_113_cqbw/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Who knows, I might sneak off somewhere.",
      "voiceAsset": "char_113_cqbw/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Nice, nice, I'll take a power nap over here.",
      "voiceAsset": "char_113_cqbw/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Who's gonna hit the jackpot today?",
      "voiceAsset": "char_113_cqbw/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Step right up, plenty of surprises for everyone!",
      "voiceAsset": "char_113_cqbw/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "You've got until 'three' to surrender. THREE!",
      "voiceAsset": "char_113_cqbw/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Boom! Ahahaha!",
      "voiceAsset": "char_113_cqbw/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Seeing you pull a hundred and ten percent out of everyone out there… I feel the nostalgia.",
      "voiceAsset": "char_113_cqbw/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Did you see that guy's face just now? The total despair when he realized he was gonna get blown to bits, no matter what he did? Wasn't that hilarious?!",
      "voiceAsset": "char_113_cqbw/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "You don't usually make mistakes like that. Are you getting rusty, or is there too much on your mind?",
      "voiceAsset": "char_113_cqbw/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Retreat? Keep casualties to a minimum? Heh, can't believe those words are coming out of your mouth.",
      "voiceAsset": "char_113_cqbw/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "This door seems to be repaired, huh.",
      "voiceAsset": "char_113_cqbw/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Looks like there's a lot more stuff here, but far fewer people.",
      "voiceAsset": "char_113_cqbw/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "...Which side of you is the real one?",
      "voiceAsset": "char_113_cqbw/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_113_cqbw/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "I hardly ever see Rhodes Island this lively. I take it you guys are fine with kicking back and relaxing then? Unfortunately, I only managed to prepare a few 'surprise' gifts. You should already know what's inside, right? Don’t want any? You sure? Your loss then.",
      "voiceAsset": "char_113_cqbw/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Dr. {@nickname}, what would you like to do for Rhodes Island today? The usual?",
      "voiceAsset": "char_113_cqbw/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "It's today, isn't it? It was a cinch to get my hands on the detailed profile of Rhodes Island's 'Doctor', which means your security sucks as bad as the bombs I made when I was three years old. And look at this, it's your birthday? How many birthday songs packed full of love have you heard by now?",
      "voiceAsset": "char_113_cqbw/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "What a merry little get-together. This how you and Kal'tsit celebrate the status quo, holding a dinner party in the safety of this place? You know who should really be seeing this? Definitely not the current you, absolutely not the current me, and sure as hell not Kal'tsit, with that perfect memory of hers.",
      "voiceAsset": "char_113_cqbw/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "train_spd&profession2[040]",
      "buffName": "Sniper Expert α",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, <@cc.kw>Sniper</> Operators' Specialization training speed <@cc.vup>+30%</>",
      "skillIcon": "bskill_train_sniper1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "train_spd&profession2[640]",
      "buffName": "Patience",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, <@cc.kw>Sniper</> Operators' Specialization training speed <@cc.vup>+30%</>; if training this skill to Specialization Level <@cc.vup>3</>, training speed will be further increased by <@cc.vup>+65%</>",
      "skillIcon": "bskill_train3_sniper2",
      "phase": "PHASE_2",
      "level": 1
    },
    {
      "buffId": "train_cost&profession[340]",
      "buffName": "Insipid",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, Morale consumed per hour is increased by <@cc.vdown>+1</> when training a <@cc.kw>Sniper</> Operator's skill to Specialization Level <@cc.vup>3</>",
      "skillIcon": "bskill_train_w",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}