{
  "id": "char_4046_ebnhlz",
  "meta_info": {
    "name": "Ebenholz",
    "appellation": " ",
    "voiceActor": {
      "en": "Atilla Akinci",
      "jp": "Ryota Osaka",
      "kr": "Um Sang-hyun",
      "cn": "Jax"
    },
    "rarity": 6,
    "profession": "Caster",
    "subProfessionId": "Mystic Caster",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "DPS"
    ],
    "nationId": "Leithanien",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Ebenholz\n[Gender] Male\n[Combat Experience] None\n[Place of Birth] Leithanien\n[Date of Birth] Jun 5\n[Race] Caprinae\n[Height] 173cm\n[Infection Status]\nConfirmed Infected by medical examination.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Standard\n[Mobility] Normal\n[Physical Resilience] Normal\n[Tactical Acumen] Standard\n[Combat Skill] Standard\n[Originium Arts Assimilation] Outstanding",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Ebenholz, a Leithanien commoner who became infected with Oripathy during the Vyseheim incident. Introduced to Rhodes Island for treatment by Operator Hibiscus, he demonstrates an extraordinary talent for Originium Arts. Following examinations, he joined Rhodes Island as a field operator.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests show the indistinct outlines of internal organs, obscured by abnormal shadows. Originium granules detected in the circulatory system. The subject is confirmed to be infected with Oripathy.\n\n[Cell-Originium Assimilation] 5%\nSmall traces of infection are visible on the surface of the body.\n\n[Blood Originium-Crystal Density] 0.22u/L\nDid not receive prompt treatment upon infection. Infection has shown signs of spreading but is currently under control.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "A seemingly unapproachable Caprinae young man.\nIf you ask him for the time, he will look down at his watch and politely tell you. However, if you try to take the opportunity to make small talk, he will bring the conversation to an abrupt end in the most polite way possible.\nOnly the Doctor and a very few other operators are able to get him to open up. When he shares a conversation with them, he demonstrates a side of himself that he rarely shows anyone else, and expresses his opinions without reserve. However, no matter the topic, his words always seem to carry a hint of gloominess, which is noticeable even when he talks about himself, perhaps even more so.\nEvery now and then, Ebenholz can be seen playing musical instruments. According to the witness descriptions, Ebenholz seems to be proficient with all instruments, but is most frequently seen playing the cello with such sorrow that it reminds listeners of people and events of the past.\nThere are even rumors that one of his specialties is the flute, however he has never been spotted playing one.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "According to Leithanien's official explanation, Ebenholz used to be an ordinary student studying music and Originium Arts at a certain university in his hometown of Vyseheim, a mid-sized city in Leithanien. During an unfortunate incident, Ebenholz became infected with Oripathy and had no choice but to withdraw and seek medical help at Rhodes Island.\n\n[Classified Log]\nUnfortunately, that document from Leithanien bears little resemblance to the truth.\nEbenholz was not born in Vyseheim. He lived much of his life in Urtica, a small town in disrepair.\nHe is no commoner either, at least not in Urtica. In truth, right up until he left for Rhodes Island, he was Graf Urtica. His appointed guardian issued orders as his representative, even after he came of age.\nLike other children of his social class, Ebenholz received an education indispensable to a Leithanian noble: etiquette, literature, Originium Arts, and—inseparable from and oftentimes even more important than Originium Arts—music.\nMany parents will do their utmost to hire the best music teachers, and these teachers can have a decisive influence on their charges' upbringing. There are even nobles who will judge a person's character solely by the reputation of their first music teacher.\nHowever, according to Ebenholz himself, his guardian was not very keen on following this tradition.\n'The teacher laid out a few instruments in front of me and asked me with a friendly voice which one I was interested in.\nI picked up the violin and played a little bit. He was so overjoyed by that, and kept calling me a genius, but I didn't respond to his compliments. When I saw the instruments, a barrage of foreign concepts and knowledge of how to play them flooded into my brain, as though someone was there ordering me around.\nEven so, I was pretty happy about it. It was the first time since I came to Urtica that someone showered me with praise so enthusiastically and actually meant it. Heh, even though I'd already heard so much insincere praise. Guess I never learned my lesson.\nThe next day, I met that teacher again, but he looked at me with nothing but scorn. Clearly, my representative had told him part of the truth.'\nThe HR Operator in charge of recording these logs is not familiar with the situation in Leithanien and nonchalantly asked, 'What truth?'\n'That Urtica is a territory passed down in the Witch King's lineage. In which case, what does that make Graf Urtica?'",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Classified Log]\nLeithanien experienced tumultuous upheaval during its regime change. Those who were fed up with the Witch King's massacres turned the flames of their fury on anything and anyone related to the Witch King. Ebenholz's parents died during that period due to their distant blood relationship.\nIn turn, a minority were unhappy with the end of the old era. They resorted to all kinds of methods to resist the Twin Empresses' reign, and the most extreme of them became known as the 'Witch King's Remains.' It was they who saved Ebenholz from meeting the same fate as his parents, but in doing also dragged him into a greater maelstrom.\nIn a single sentence, Ebenholz explained what they had done to him: 'They force-fed a verse of the Voice of Mundane into my brain.'\nThe Medical Department has examined Ebenholz's brain on multiple occasions, but are as of yet unable to determine how and in what form the Voice of Mundane was implanted into it. What is certain, however, is that the Voice of Mundane is real, and causes him intense headaches. It is closely linked to Ebenholz's natural-born talent in both music and Originium Arts, but we have been unable to determine exactly what it is.\nThrough Ebenholz's introduction, we obtained copies of a research manuscript from Operator Czerny, and according to its inexact descriptions, the Voice of Mundane is a melody improvised by the Witch King and transcribed by his court musicians.\n'Then shouldn't the Voice of Mundane be sheet music, or some kind of tape?'\n'What do you think? Did they cram paper or plastic into my brain?'\nIn the end, the Medical Department had no choice but to tentatively accept Ebenholz's own explanation:\n'It's a melody, a great melody. A melody so great that it makes me worry that I'll be swallowed whole without even noticing.'\n'Can a melody really swallow a person?'\n'All I can say is... I'll do my best to prevent it from happening again.'\nEver since, Ebenholz has refused to discuss the topic.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Classified Log]\nWhen he first arrived at Rhodes Island, Ebenholz did not show much of the patronization or verbal aggressiveness that Operators Hibiscus and Czerny had described. Most operators only know him as a quiet yet courteous Leithanian operator new to Rhodes Island. Back then, Ebenholz wasn't very keen on talking to others. When by himself, he often spaced out, looking only at the cello that he always kept near him. Some operators, worried, have asked him if he needed any help, but he always simply shook his head.\nEbenholz changed after his first field operation. The operation itself could not have been more successful. Rhodes Island rescued a dozen children from extremely poor conditions in an orphanage, resettling the non-Infected at trustworthy organizations, while taking in the Infected among them.\nIt's worth noting that Ebenholz was key to the entire operation, from seeing through the orphanage manager's subterfuge to providing Originium Arts support during the actual rescue operation.\nAfter he made it back to Rhodes Island, Ebenholz began to change for the better. He started to proactively talk to those who approached him, to learn everything he could about Rhodes Island, and also to assess acrimoniously the things he could not bear to even look at. Of course, this applies only to the Doctor and a very few other operators.\nOnce, he even attended an operator-organized book club and started to exchange emails with several of them afterward.\nMost of Rhodes Island's operators did not notice this change, but there is one thing that's caught everyone's attention:\nEbenholz has stopped spacing out while looking at his cello. Instead, he often plays it and hums along, almost like talking to an old friend.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'Enough of your self-loathing rhetoric. You cannot hide your short-sightedness from me, my foolish descendant.'\n'Thanks for the compliment, old fart.'\n'Yet you still doubt yourself. Injustice has you indignant, yet you also doubt the veracity of your anger. In the end, you even accepted these doubts. You told yourself to simply put up an act, and now you must continue this act... Laughable. Absolutely laughable!'\n'Thanks for the lesson. Please do give me some time to completely forget your words.'\n'Hah...'\n'You must be wondering why I don't tell you to shut up when you speak anymore, isn't that right?'\n'Do tell.'\n'First, I've realized that yelling at you is neither going to make you shut up nor make my headache go away. And by the way, I'm more concerned about the latter.\nSecondly, I still have no idea who you are. I don't know if you're a lingering echo in the Voice of Mundane, or just a hallucination. I don't even know if, for reasons I can't begin to imagine, I'll completely lose myself to that ear-piercing melody like Kreide.'\n'But I'm not afraid of you anymore, old fart. It's that simple.'",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1359,
      "atk": 1134,
      "def": 120,
      "magicResistance": 20,
      "blockCnt": 1,
      "baseAttackTime": 3,
      "respawnTime": 70,
      "cost": 25
    }
  },
  "skins": [
    {
      "skinId": "char_4046_ebnhlz#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_4046_ebnhlz",
      "portraitId": "char_4046_ebnhlz_1",
      "illustId": "illust_char_4046_ebnhlz_1",
      "modelName": "Ebenholz",
      "drawerList": [
        "竜崎いち"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_4046_ebnhlz#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_4046_ebnhlz_2",
      "portraitId": "char_4046_ebnhlz_2",
      "illustId": "illust_char_4046_ebnhlz_2",
      "modelName": "Ebenholz",
      "drawerList": [
        "竜崎いち"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_4046_ebnhlz@boc#6",
      "skinName": "Eine Variation",
      "skinGroupName": "Bloodline of Combat/VI",
      "skinGroupId": "2023#boc",
      "avatarId": "char_4046_ebnhlz_boc#6",
      "portraitId": "char_4046_ebnhlz_boc#6",
      "illustId": "illust_char_4046_ebnhlz_boc#6",
      "modelName": "Ebenholz",
      "drawerList": [
        "竜崎いち"
      ],
      "description": "<color name=#ffffff>Bloodline of Combat Collection/Eine Variation. A traditional-style gown worn by every Graf Urtica, now draped over Ebenholz's shoulders. Orders apathetically seep from the tip of the staff, piercing through the sparse ensemble of nobles.</color>",
      "rarity": 140
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "3-13",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 732,
            "atk": 611,
            "def": 51,
            "magicResistance": 10,
            "cost": 23,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1046,
            "atk": 873,
            "def": 87,
            "magicResistance": 10,
            "cost": 23,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "3-14",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1046,
            "atk": 873,
            "def": 87,
            "magicResistance": 15,
            "cost": 25,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1359,
            "atk": 1134,
            "def": 120,
            "magicResistance": 15,
            "cost": 25,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3251",
          "count": 5,
          "type": "MATERIAL"
        },
        {
          "id": "30052",
          "count": 7,
          "type": "MATERIAL"
        },
        {
          "id": "30062",
          "count": 3,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "3-14",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1359,
            "atk": 1134,
            "def": 120,
            "magicResistance": 20,
            "cost": 25,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 1678,
            "atk": 1400,
            "def": 135,
            "magicResistance": 20,
            "cost": 25,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3253",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30135",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "31044",
          "count": 7,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_ebnhlz_1",
      "skillName": "Quickening Presto",
      "desc": "Attack Range <@ba.vup>changes</>, Attack Interval is <@ba.vup>massively reduced</>, and each attack deals <@ba.vup>{attack@atk_scale:0%}</> ATK as Arts damage",
      "iconId": "skchr_ebnhlz_1",
      "spCost": 15,
      "initSp": 5,
      "duration": 5,
      "blackboard": [
        {
          "key": "base_attack_time",
          "value": 0.17
        },
        {
          "key": "attack@atk_scale",
          "value": 0.5
        },
        {
          "key": "attack@cnt",
          "value": 1
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31013",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_ebnhlz_2",
      "skillName": "Desolate Echoes",
      "desc": "Expends all stored attack charges and summons <@ba.vup>stored attack charges +1</> Old Day Remnants on deployable tiles within Attack Range (lasts for 30 seconds). The Remnants activate when enemies approach, each dealing <@ba.vup>{atk_scale:0%}</> ATK as Arts damage to nearby enemies and dragging them towards itself <@ba.vup>moderately</>",
      "iconId": "skchr_ebnhlz_2",
      "spCost": 13,
      "initSp": 0,
      "duration": -1,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 2.45
        },
        {
          "key": "force",
          "value": 1
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30063",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_ebnhlz_3",
      "skillName": "Sound of Silence",
      "desc": "ASPD <@ba.vup>+{attack_speed}</>, ATK <@ba.vup>+{atk:0%}</> and only targets elite or boss enemies. The damage boosting effect of this unit's first Talent increases to <@ba.vup>{talent_scale_multiplier:0%}</> of the original\n<@ba.rem>Can manually deactivate skill at will</>",
      "iconId": "skchr_ebnhlz_3",
      "spCost": 20,
      "initSp": 10,
      "duration": 30,
      "blackboard": [
        {
          "key": "attack_speed",
          "value": 80
        },
        {
          "key": "atk",
          "value": 0.65
        },
        {
          "key": "talent_scale_multiplier",
          "value": 1.4
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31023",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 9,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_ebnhlz",
      "moduleName": "Ebenholz's Badge",
      "desc": "Operator Ebenholz has demonstrated a perennial commitment to Originium Arts.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Caster Operator during field operations to exercise Mystic Caster responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_ebnhlz",
      "moduleName": "Originium Dice Case",
      "desc": "'Could you be—?!'\nEbenholz quickens his pace as he exits the Medical Department, hoping to shake off the person behind him, but he's nevertheless followed all the way to his dormitory door.\n'You have crossed the line.'\n'What does it matter?! I felt something was different about you. I can see now—it really is you, Graf Urtica!'\nThe man's forehead is rife with sweat, his voice dramatically lowered.\n'I know you. You're just biding your time, waiting.'\n'You have the wrong person.'\n'Impossible! Look at these—Haguenau's inherited dice and wand, which went missing along with him twenty years ago! He and I grew up together! He told me himself that they were bestowed on his family by the Emperor!'\n'Haguenau? ...I'm not familiar.'\n'But I know what these are! Nobody else could have used them as weapons,' the man pants, 'and you have no idea what I went through afterward! Everyone said I was tainted by Haguenau's madness, shunned me, but Haguenau was never mad. And neither was I! I even caught Oripathy thanks to their backstabbing—I lost my land and family estate. I fell from being a well-to-do squire to this sorry state!'\n'You have my sympathies—'\n'No! That was nothing! They were crueler still, a hundred times over!'\n'A hundred times? Just what did they do to you?'\n'They dared to slip my only daughter some kind of drug, and she disobeyed me, you understand? She went and married a filthy commoner, even had a bastard child! Can you imagine such disgrace? One worse than death? Would you truly permit such a scandal if it were you?!'\n'......'\n'I beg you, take me as a retainer! Take me back to that age, to when we controlled with fear, when we made the petty thieves who dared question you shudder in despair! To when we could drive such presumptuous thoughts from the commoners' minds!'\n'Of course, I would gladly accept any treatment, be it favor or reprimand! I would fear you as though every day were my last! I would serve you, heed your every command! Should you call for my life to—'\nEbenholz sighs the heaviest sigh, gathers the dice in the hollow of his palm, and presents them to the man.\n'Very well, you will become my retainer here and now, with this secret ritual. Close your eyes and listen well.'\nThe man's entire body trembles with excitement.\n'Fick der Graf Urtica.'\n'?!'\n'Fick all die Kaiser, fick all die Kurfürsten, die Herzöge, die Grafen, die Barone—as well as you, Herr Knappe, or should I say, Herr Ex-Knappe.'\nThe man's expression gradually twists.\n'Wake up. No more living your dreams of superiority.'\n'You've lost your land, so do as the prideful commoner does and lift your head, puff out your chest, and live on.'\n'That is the one and only word of advice I'll give you.'"
    },
    {
      "moduleId": "uniequip_003_ebnhlz",
      "moduleName": "'Theory Expositor'",
      "desc": "An Engineering operator, his beard slightly white, handed me my custom-order set of casting equipment. Its appearance was exactly as I'd requested: a simple metal case with not a hint of adornment, a wand with the surface polished to a mirror sheen, and a spherical energy reserve unit in a full silver color. Freshly produced, the Originium circuitry gave off the smell of solvent.\nI picked up the wand from the case, and the reserve smoothly floated up with it, responding to the wand's movements, resting into a stable orbit in the air some thirty or forty centimeters from my hand.\nI fired the reserve out, and the red circle bullseye at the center of the alloy was dented inwards by it. Impeccable energy conversion efficiency.\nThe Engineering operator's and my expressions were in total accord. We understood what a masterpiece this was.\n\nSome months later, I met him again, bringing my old wand with me, and some Originium dice in my pocket.\n'Old shoes do fit easier,' he remarked.\nI could only shrug.\n'Still, I'd like to know why you went back to your old equipment,' he said, his gaze sharp behind his goggles. 'Even if it's just cosmetic reasons—no skin off my nose. Call it a little after-sales service courtesy of Engineering.'\n'Because of... the noise.'\n'Noise?'\nI simply pulled out my wand and give it a perfunctory wave. The tip streaked through the air, but what came was not the sound of slicing air, but music.\n'I did some research into your wand there, when we got your request. The frequencies it vibrates against the air at are beyond common sense, I can tell you that. It's a real mystery, but it doesn't do anything to help casting. Doesn't hinder either, though.'\n'I understand, but this ties to my—'\nMy personal affairs.\nI ordered the wand precisely to distance myself from that bothersome music. It and the fantastical melody that once played at the Afterglow Hall are all but the same. For each day that I use the wand, that night I dream of that scene again, and hear that melody.\nThe new wand successfully quietened my dreams, but the scene still laid before me, the silent struggle all the more wretched, the silent death throes all the more terrible.\nOnly once I took up my old wand again did I understand. That nightmare would run its way through my entire life—had already done so—and to try and forget was mere futility.\nI couldn't flee it, and couldn't reconcile with it either. I was forced to concede that it was a part of me, and that I would fight it for the rest of my days.\nAs now well demonstrated. I was the one who ordered the wand, and the one who gave up on it.\nGraf Urtica simply walked away from it all, and left all the trouble and anger to others, but Ebenholz could not.\nOf course, Ebenholz could denounce those morons who thought themselves so lofty; however, faced with a craftsman who he'd offended, did he truly have the right to send them packing with but a few vile words?\nIf it were... him, what would he do? What would he want me to do?\nThe answer couldn't be any clearer.\nWith difficulty, I cleared my throat, unsure if I would offend the craftsman once again with this.\n'The story is a little long, but... if you're willing to listen, I can explain in full detail.'"
    },
    {
      "moduleId": "uniequip_004_ebnhlz",
      "moduleName": "Lineage of Decay",
      "desc": "'Are you that attached to this place?'\nSunlight streams in through the window, glass filtering it clean of its warmth, turning it as frigid and dirty as the panes.\n'This parlor is just as I remember it—not very big. The only difference is, the mold is ever ranker now, isn't it?\nEbenholz paces through the deserted parlor. The expensive furnishings that once filled it have now either been stolen to sell by retainers fleeing the spire, or simply left behind due to their sheer value. He spies that someone tried to move the excessively large piano, but gave up for whatever reason, their attempt having left a visible scratch on the floorboards. Comical, and loathsome. The walls are thick with dust and mildew, no longer showing any sign of the patterns beneath. The only familiar sight is the fireplace sunk into the wall. The timbers' ashes lie under a fresher layer of grime, but they're still there in the hearth, just as Ebenholz had left them.\n'It's been a long while since you left, and no one's lit the fireplace in the meantime, hence the dust and rot. That's been the story of this room, yes, ever since you left.'\nEbenholz approaches the fireplace. He can still almost remember how it used to burn. There was a fire here. There was warmth. Now, though, it is an ugly yawning chasm, and all he finds in its maw is darkness. Ebenholz lifts a hand to brush away the stale air, and refreshes himself if only for a moment.\n'Will that even help? Five seconds, ten, and the foul air will fill your nostrils once more.'\nEbenholz draws his wand. The Originium dice float, circling in a steady orbit, letting off light and heat.\n'Of course you could do that. Raise a gust of wind, summon a ball of fire, those are simple feats for you. They can blow away the dust, burn off the rot. You've tried as such before. You've seen some results.'\nSilent, Ebenholz puts away his wand, and the Originium dice fall back into his hand. He bends over, the darkness inside the fireplace staring out at him.\n'But they always come back, don't they? You can resist, you can refuse, you can do everything you can to keep the darkness at bay. You've contended with it all for far too long. You can choose to brush away the miasma, you can choose to leave Urtica, you can choose to hide, and the further the better. Light your glimmering lights until you lose count, but you will never keep the long night from becoming day.'\nEbenholz reaches into the ashes, and pulls out a wizened branch, not wholly consumed.\n'Decay will keep creeping over this parlor with endless arms, until it clambers into your mind and body, just as it ate at your parents, and all the masters of this spire before them.'\n'No!' In an instant, the dizziness born from the depths of his brain takes hold of his entire consciousness. Ebenholz's vision blurs. The voice sneers, loudly and clearly.\nFrom the scorched branch protrudes a bud, just as black and burnt, and it pierces through Ebenholz's palm, and winds about his wrist, binding his arm. It grows thorns, pricking his skin, stabbing into his marrow. Fresh blood springs forth, trickling down the branch's length, falling into the darkness and mingling with the embers.\n'Urtica's veins are the branches of the dark. The decay and withering are nigh. You cannot break free.'\nEbenholz opens his eyes. The branch is not in his hand; his arm has landed in a layer of fine ash. No wounds, the blood still flowing beneath his skin. The beating of his pulse seems to suggest all that happened just now was an illusion. An illusion—I want no more illusions.\n'No.' Ebenholz finally breaks his silence. 'I know decay and withering will take Urtica's every branch and leaf. I know that so long as your soul still lingers throughout my body, this nightmare will never end.\n'But this rot, this shambling corpse of trite rhetoric, has lingered for too long now.'\nEbenholz stares back into the dark within the fireplace. The charred branch lies upon the embers there, stained with fresh blood, permeating the black soil. Its blood seeps into the cracks, with first heat, then a spark, and then flashes are crackling about the branch's tip. In an instant, they gather together into a black flame, engulfing the entire branch. Once more, the embers begin to burn.\n'So it will conclude. So it will end, full stop.'\nThe fireplace is lit with a flame blacker than the dark itself, the glow from the charred branch filling the whole parlor. The voice finally ceases to jeer, ceases to respond.\n'How about I go meet that so-called Austere Authority for myself.'"
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "I'll be your assistant today, Doctor... I will disclaim. I have absolutely no secretarial experience. Thus, so I'm not hindering you, I will be doing nothing at all.",
      "voiceAsset": "char_4046_ebnhlz/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "You'd like to see Leithanien, you say? Heh, it's a fine place. The Empresses regard their subjects like their own children, the healthy regard the Infected as brethren, the faces of the people brim with blessing—lies? That's true, they are lies. Contemplate visiting Leithanien again once you can sit through the whole game with a straight face.",
      "voiceAsset": "char_4046_ebnhlz/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Routine health inspections? Allow me a moment to ready my—hold on, isn't Hibiscus the one on duty today? I'd rather avoid her if I can. I'm sure I needn't explain why... I'm not frightened of her! I'm just not quite prepared for—could you amend my timeslot? Thank you!",
      "voiceAsset": "char_4046_ebnhlz/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Please relay to the Medical Department that my headaches and physical condition are no matter, and no cause for such alarm. There's nothing to examine—what? They're already expecting me? They've even made the consultation room available? I... You tell them that my headache has flared up and I'm not going anywhere—ugh.",
      "voiceAsset": "char_4046_ebnhlz/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "Social etiquette of Leithanian nobles? Hah, it's an endless subject. Shaking off commoners, spreading rumors of other nobles behind their backs—not to go on, but it all demands a cheek I find slightly hard to conjure myself. You'd best consult an expert, not me.",
      "voiceAsset": "char_4046_ebnhlz/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "There'll always be a cohort eager to associate me with the previous Graf Urtica. I can't blame them though, I simply wish to live as a regular Infected. Abhorring inequality ... You say I'm faking to be common? Whatever you say. Even if I am faking, I prefer to keep it that way till the very end.",
      "voiceAsset": "char_4046_ebnhlz/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "You noticed as much, Doctor? Indeed, I like to repeat what others have said in times of stress... it's the safest method I—no—Graf Urtica has of buying time to think. So long as he doesn't speak his own mind, he won't bear blame for what he says.",
      "voiceAsset": "char_4046_ebnhlz/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "It's Hibiscus on duty again—should I reschedule my examination? Nein, never mind. I'm deeply grateful for your help in avoiding her days, but I can't hide forever. Even after so long, I still close my eyes and see the wretched misery of that concert... perhaps it's time I face it.",
      "voiceAsset": "char_4046_ebnhlz/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "Evening on the deck reminds me of the spiretop in Urtica—it had just as fine a breeze. I used to fantasize there how happy life must be, down on the ground. I only understood later that up there, freedom was the one thing stripped from me, while so many in the land had, save for freedom, nothing at all.",
      "voiceAsset": "char_4046_ebnhlz/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "No issue dozing off in this sort of place? Hmph, I suppose it's times like these when the assistant does the work. Pain in the neck—agh, I'm misspelling. Never mind, never mind. Let's find out what music's on the Doctor's headphones...",
      "voiceAsset": "char_4046_ebnhlz/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "I extend my sincere gratitude to you, Doctor of Rhodes Island. Thank you for sheltering an insignificant down-and-outer. If such mediocrity as even mine can benefit Rhodes Island's cause, then I couldn't be more relieved.",
      "voiceAsset": "char_4046_ebnhlz/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "A very fascinating recording. Hm? I don't say that with irony. Nobody ever thought to buy video tapes for Graf Urtica save for himself, and he couldn't leave the spire.",
      "voiceAsset": "char_4046_ebnhlz/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "Promotion? Allow me to decline. No, not for lack of necessity, but of knowledge of who is being recognized. Is it myself... or the Witch King's remnants lodging within me?",
      "voiceAsset": "char_4046_ebnhlz/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "Graf Urtica fears his ego's engulfment by the Witch King, yet has to employ powers inherited from the tyrant. But now, he is dead. Now, I am first and foremost an operator of Rhodes Island, and only after that am I the Witch King's botched replica. That suffices for me—that suffices.",
      "voiceAsset": "char_4046_ebnhlz/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "This power is not mine. However, Rhodes Island has need of it, so I will employ it to its fullest.",
      "voiceAsset": "char_4046_ebnhlz/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "I hate it when I'm ordered around without rhyme or reason, but ordering others sits just as badly with me.",
      "voiceAsset": "char_4046_ebnhlz/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Prolonged casting makes my headaches flare up, and I even hallucinate if I'm unlucky. Let's make it a Blitzkrieg, shall we?",
      "voiceAsset": "char_4046_ebnhlz/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "I am at your command.",
      "voiceAsset": "char_4046_ebnhlz/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Stronger dynamics?",
      "voiceAsset": "char_4046_ebnhlz/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Faster tempo?",
      "voiceAsset": "char_4046_ebnhlz/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Careful of music on the battlefield, especially when you face a Leithanian.",
      "voiceAsset": "char_4046_ebnhlz/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "The performance will begin soon, but it seems our audience can't contain themselves?",
      "voiceAsset": "char_4046_ebnhlz/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "As graceful as three-four.",
      "voiceAsset": "char_4046_ebnhlz/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "As startling as a tritone.",
      "voiceAsset": "char_4046_ebnhlz/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "As doleful as a clarinet.",
      "voiceAsset": "char_4046_ebnhlz/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Gah! Get out of my head!",
      "voiceAsset": "char_4046_ebnhlz/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "If you're lacking an appreciator to applaud and call for encore, then allow me to fill the role. Congratulations, Doctor.",
      "voiceAsset": "char_4046_ebnhlz/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Is it over? Very well, I need somewhere to rest for a moment before my headache gets any worse.",
      "voiceAsset": "char_4046_ebnhlz/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "An unsatisfactory performance'... No, it's fine, it's just something I often heard not so long ago. You can ignore it.",
      "voiceAsset": "char_4046_ebnhlz/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "We can hardly call this ending good. Are you the one who just got a headache, not me?",
      "voiceAsset": "char_4046_ebnhlz/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "This place might be far from a Leithanian spire, but I still prefer the feeling of standing on solid ground.",
      "voiceAsset": "char_4046_ebnhlz/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Agh, here it is aga—huh? It's you, Doctor? That wasn't the headache?",
      "voiceAsset": "char_4046_ebnhlz/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Doctor, if you want to learn an instrument, I'd say ask someone else. A lot of my understanding has little to do with myself.",
      "voiceAsset": "char_4046_ebnhlz/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights",
      "voiceAsset": "char_4046_ebnhlz/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "I'm not omitting myself from the New Year celebrations for any special reason. I'm just not accustomed to that sort of harmonious atmosphere... You'd like to invite me to perform a song? Forget it, my music would be a horrible match for this mood.",
      "voiceAsset": "char_4046_ebnhlz/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "How did you rest, Doctor? I used to love staying up myself, until one time I went a full night without closing my eyes, and had splitting headaches for a week after... It was a horrifying experience.",
      "voiceAsset": "char_4046_ebnhlz/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Would you like to listen to a dark, terrifying, head-splitting Birthday Variation?—I'm joking. Happy birthday, Doctor. Sheesh, there's no need to be *that* surprised. Can't I joke every once in a while?",
      "voiceAsset": "char_4046_ebnhlz/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "Every day passed at a crawl in Urtica, but now a year's silently flown by since coming to Rhodes Island... It feels like time's sped up. I imagine that's just proof life is more blessed now.",
      "voiceAsset": "char_4046_ebnhlz/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "trade_ord_spd_bd_n1[000]",
      "buffName": "Musicianship",
      "desc": "When this Operator is assigned to a Trading Post, for every <@cc.kw>1</> Operator in the Dormitories, <$cc.bd_a1><@cc.rem>Perception Information</></> <@cc.vup>+1</>, and every <@cc.vup>1</> <$cc.bd_a1><@cc.rem>Perception Information</></> is converted to <@cc.vup>1</> <$cc.bd_B><@cc.rem>Soundless Resonance</></>",
      "skillIcon": "bskill_tra_bd_n1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "trade_ord_spd_bd[000]",
      "buffName": "Lingering Melody",
      "desc": "When this Operator is assigned to a Trading Post, for every <@cc.vup>4</> <$cc.bd_B><@cc.rem>Soundless Resonance</></>, <@cc.vup>+1%</> order efficiency",
      "skillIcon": "bskill_tra_spd_bd1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "trade_ord_spd_bd[010]",
      "buffName": "Harmony Astray",
      "desc": "When this Operator is assigned to a Trading Post, for every <@cc.vup>2</> <$cc.bd_B><@cc.rem>Soundless Resonance</></>, <@cc.vup>+1%</> order efficiency",
      "skillIcon": "bskill_tra_spd_bd2",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}