{
  "id": "char_1011_lava2",
  "meta_info": {
    "name": "Lava the Purgatory",
    "appellation": " ",
    "voiceActor": {
      "en": "Díana Bermudez",
      "jp": "Kaori Mizuhashi",
      "kr": "Kim Ha-young",
      "cn": "Ying Xie"
    },
    "rarity": 5,
    "profession": "Caster",
    "subProfessionId": "Splash Caster",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "DPS"
    ],
    "nationId": "Rhodes Island",
    "isNotObtainable": false,
    "itemObtainApproach": "Event Reward",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Lava the Purgatory\n[Gender] Female\n[Combat Experience] Undisclosed\n[Place of Birth] Victoria\n[Date of Birth] June 22\n[Race] Sarkaz\n[Height] 158cm\n[Infection Status]\nOriginium crystals distributed across the surface of her body, confirmed Infected by medical examination.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Standard\n[Mobility] Standard\n[Physical Resilience] Normal\n[Tactical Acumen] Standard\n[Combat Skill] Excellent\n[Originium Arts Assimilation] Excellent",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Born in Londinium, Victoria, Lava is the younger twin sister of her fellow Operator, Hibiscus. It has been a few years since she contracted Oripathy and came to Rhodes Island for treatment. She has remained ever diligent during her time in Rhodes Island and never wasted even a moment in her quest to hone her Originium Arts prowess.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests have shown the outlines of her internal organs to be indistinct due to abnormal shadows. Originium granules have been detected in her circulatory system, confirming her to be infected with Oripathy.\n\n[Cell-Originium Assimilation] 12%\nMild crystallization visible on her left arm.\n\n[Blood Originium-Crystal Density] 0.28u/L\nThe extended, high-intensity training; high-risk Originium Arts research; and the frequent field operations that Purgatory has taken part in have naturally taken their toll on her condition. Thanks to the meticulous care of her instructor, Pith, and Medic Operator Hibiscus, Purgatory's condition, though deteriorating, is still kept at manageable levels.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Ever since our Originium Arts instructors took note of Lava's unparalleled talent for Arts, the instructors have formulated a full-fledged curriculum to allow Lava to master her Originium Arts more efficiently and systematically. The results were remarkable, and Lava herself has also become obsessed with her studies in Originium Arts and being able to put them into actual use, to the point that she neglects rest during her own free time. She has had the opportunity to study under the tutelage of many of our casters, including some particularly exceptional elite operators. This has been a source of pride to Lava, and it has given her all the more reason to spend time to improve her skills.\nLava has slowly come to realize that there is much more to Originium Arts than the physical damage you inflict on the surface; and they go much deeper than damage alone. Originium Arts is an academic discipline that is constantly being studied by casters, be it the research of the myriad of Arts there is or their origins. Operator Lava is particularly talented in this field of study, and she sought to seek out the truth and the meaning of this power by taking on the calamities that plague our world herself. During her pursuit and her participation of the neutralization of those countless crises, she slowly discovered her destiny, hidden behind the tragedies of Oripathy and war, and she is trying to take control of it.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Although she may seem to be a rebellious young woman, ignorant of world affairs, Operator Lava is actually very scrupulous. She empathizes with society's underdogs and the insignificant yet most important wishes they have, and she takes it upon herself to help them. As she becomes more powerful, the responsibility she shoulders also becomes greater—This is not limited to the missions that she must complete as a Rhodes Island operator, but also what she asks from herself, her refusal to turn her back on those in need, and her strong desire to correct society's injustices. As Lava was raised in a normal family, poverty and unfairness were never on Lava's mind, yet after she started to live on her own, as a Sarkaz and an Infected, Lava gradually came to be aware of the immense, uncalled-for hatred that society has toward the 'oppressed.'\nBecause there are limits to her power, there are bound to be those who seek her aid that she cannot save. Because of her status as a Sarkaz and an Infected, she will always be antagonized by certain intolerant strangers. In her pursuit of justice, Lava has gradually come to understand that the 'right way' she has read in books is nothing like the reality she faces. Having gone through so many incidents during her time at Rhodes Island, she has slowly come to understand its ideals, even choosing to firmly stand on its side. This is a choice that she has made herself—Rhodes Island showed her the way, and she has long become an inseparable member as she continued to grow. In the future, she will undoubtedly be an important key to Rhodes Island's growth and leadership.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Just as Operator Lava's power continued to improve, so too did her combat equipment. Along with the gradual improvement in its performance, the appearance of her combat uniform is one of the aspects that she pays the most attention to. As can be seen in her language and the way she interacts with others, Lava has become much more mature and approachable. Perhaps this is why she's become somewhat apprehensive about revealing her interests.\n'What's that? You're kidding! Lava spent her pay on tweaking her combat outfit again? She always spends her allowance on weird stuff like this, but I really just don't see the difference. Well... Now that you mention it, compared to when she just started out, her outfit's changed quite a bit. She changes it little by little, though. How is anyone supposed to notice?! Last time, she got so mad just because of this, saying I didn't care about her as a sister. That I forced all those healthy meals on her, but I never paid attention to her hairstyle and how she changes her outfit... Sheesh, of course I care about her. I care about her so much, I know what kinds of food she eats, how many times she goes to the bathroom, and when exactly she goes to bed and wakes up each and every day,' said Operator Hibiscus, her arms confidently crossed as she unwittingly confessed to abusing her privileges to our record keeping personnel.\n'That 'costume?' Eh, that's no costume in the first place, and I definitely didn't make her wear it. That's just what girls like to do. We want to know if anyone notices what's changed about us. That's why she went through all that trouble putting that movie together all while not leaving even a trace. She wanted to show all that off to everyone. It turned out okay. Everyone seemed to like the way she looked. That's why she keeps all those outfits and works on her hair, adding new elements she comes up with bit by bit. Don't you think Lava was boring when she spent all her time picking up those simple Arts tricks? Hobbies like this are what make girls cute,' quipped a certain laid-back operator as she waved her fan around, joining in on the message's recording on her own accord.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Having demonstrated her prowess in our evaluations, Lava left Reserve Op Team A1 she was assigned to after she became a full-fledged member. To Lava, her time as an on-the-job trainee is irreplaceable. She had a group of kind and caring partners she could open her heart to; the effect this has had on her growth is simply beyond measure. Her relationship with Hibiscus has also finally been repaired, and the two sisters have learned to tolerate and understand each other. What a great ending.\n'What do you mean, 'what a great ending?' Do you know how what she did right after I 'compromised' with her? Healthy meals, healthy meals, and healthy meals! Not only that, she even gets in the way of my training and makes me go to bed before it's even dark out so to keep me from pulling all-nighters! Hmph, I'm not gonna let her push me around anymore. We get along better than we used to, but I'm not gonna spend any more than time her than I have to.'\nAhem... After that, Lava began to take part in operations of greater importance, becoming a powerful and dependable Caster.\nWe must take care to not underestimate the dangers and ploys that may harm us as we battle the many injustices in our world. This applies not only to Lava, but also Rhodes Island as a whole. Both have faced many seemingly unsurmountable dangers, and often sacrifices had to be made. During the ■■■■ Incident—\n[Log Partially Missing]\n—Having worked together for so long, this was undoubtedly the most difficult part of the whole incident to those teammates. After the ■■■■ Incident, it was as though Lava became a mature, full-grown adult in the span of a night, having learned to remain calm when it's time to part ways and to treasure the moments when we meet.\nI just wish that... the children who grew up in such difficulties and hardships would know how to cherish their own lives after they come to understand the pain of loss.\n[Addendum 1]\nPermission has not been granted to access information on related incidents.\n[Addendum 2]\nOut of respect for the wishes of the parties involved, access to certain information pertaining to the operator and the pertinent incidents has been restricted.\n[Addendum 3]\nCurrently, Operator Lava's psychological condition remains mostly stable.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "As with all Rhodes Island operators, Lava is required to regularly undergo psychological evaluations and counseling. One point worthy of note is that Lava's mental health values are not particularly stable. After she finds herself involved in sudden, unexpected major incidents, Operator Lava always comes out demonstrating a stronger resolve and determination. In contrast, her mental health also deteriorates by a demonstrable degree. The value she sees in her own life decreases after each incident, just as the sacrificing herself to protect others becomes more and more of a viable strategy to her. The braver and stronger she gets, the higher the price she has to pay for her power.\nThis has been a source of concern to Medical Operator Hibiscus, who frequently misuses her permissions to retrieve the relevant data.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1203,
      "atk": 670,
      "def": 96,
      "magicResistance": 20,
      "blockCnt": 1,
      "baseAttackTime": 2.9,
      "respawnTime": 80,
      "cost": 35
    }
  },
  "skins": [
    {
      "skinId": "char_1011_lava2#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_1011_lava2",
      "portraitId": "char_1011_lava2_1",
      "illustId": "illust_char_1011_lava2_1",
      "modelName": "Lava the Purgatory",
      "drawerList": [
        "下野宏铭"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_1011_lava2#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_1011_lava2_2",
      "portraitId": "char_1011_lava2_2",
      "illustId": "illust_char_1011_lava2_2",
      "modelName": "Lava the Purgatory",
      "drawerList": [
        "下野宏铭"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_1011_lava2@nian#6",
      "skinName": "Dusk Wisteria",
      "skinGroupName": "0011 Productions/V",
      "skinGroupId": "2022#nian",
      "avatarId": "char_1011_lava2_nian#6",
      "portraitId": "char_1011_lava2_nian#6",
      "illustId": "illust_char_1011_lava2_nian#6",
      "modelName": "Lava the Purgatory",
      "drawerList": [
        "下野宏铭"
      ],
      "description": "<color name=#ffffff>0011 New Release / Dusk Wisteria. Handmade in Lungmen, tailor-fitted with special consideration to exotic design elements. The outfit has been improved in accordance with the customer's preference to incorporate Yan's novel trends.</color>",
      "rarity": 60
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "2-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 692,
            "atk": 370,
            "def": 46,
            "magicResistance": 10,
            "cost": 32,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.9,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 962,
            "atk": 522,
            "def": 70,
            "magicResistance": 10,
            "cost": 32,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.9,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 70,
      "rangeId": "3-6",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 962,
            "atk": 522,
            "def": 70,
            "magicResistance": 15,
            "cost": 35,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.9,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 1203,
            "atk": 670,
            "def": 96,
            "magicResistance": 15,
            "cost": 35,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.9,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3251",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30012",
          "count": 6,
          "type": "MATERIAL"
        },
        {
          "id": "30052",
          "count": 3,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 80,
      "rangeId": "3-6",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1203,
            "atk": 670,
            "def": 96,
            "magicResistance": 20,
            "cost": 35,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.9,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1543,
            "atk": 798,
            "def": 115,
            "magicResistance": 20,
            "cost": 35,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.9,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3253",
          "count": 3,
          "type": "MATERIAL"
        },
        {
          "id": "30074",
          "count": 8,
          "type": "MATERIAL"
        },
        {
          "id": "30093",
          "count": 13,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_lava2_1",
      "skillName": "Flame Quenched Dagger",
      "desc": "Attack Range <@ba.vup>+{ability_range_forward_extend}</> tile, ATK <@ba.vup>+{atk:0%}</>, and attack up to <@ba.vup>{attack@max_target}</> targets simultaneously",
      "iconId": "skchr_lava2_1",
      "spCost": 50,
      "initSp": 10,
      "duration": 35,
      "blackboard": [
        {
          "key": "atk",
          "value": 0.2
        },
        {
          "key": "ability_range_forward_extend",
          "value": 1
        },
        {
          "key": "attack@max_target",
          "value": 2
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30053",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_lava2_2",
      "skillName": "Ring of Hellfire",
      "desc": "Stops attacking and targets the ally with the highest HP within range, enveloping them and herself within a ring of fire. Each ring of fire deals <@ba.vup>{atk_scale:0%}</> ATK as Arts damage every second to all enemies in the surrounding 8 tiles",
      "iconId": "skchr_lava2_2",
      "spCost": 70,
      "initSp": 30,
      "duration": 40,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 0.5
        },
        {
          "key": "interval",
          "value": 1
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30063",
              "count": 2,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_lava2",
      "moduleName": "Lava the Purgatory's Badge",
      "desc": "Lava the Purgatory has demonstrated a remarkable aptitude for inflicting Arts casualties on multitudes of enemies.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Caster Operator during field operations to exercise Splash Caster responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_lava2",
      "moduleName": "Sarkaz's Knife",
      "desc": "The hammering comes to a halt in the foundry. Taking the heavy tongs from the artificer, Lava submerges the red-hot dagger into the ice cold water. As bubbles and white smoke erupt uncontrollably out of the water, in unison with an intense searing sound, she finds herself unable to take her eyes away.\nThe cooled dagger sits atop a smithing table, and Lava herself personally etched a crude depiction of her own horns on it.\n\n'That's so sick! Miss, I want one too!'\nThe children of the slums rarely get to eat anything tasty, and they have certainly never seen the sweet treats that Lava is so fond of.\nEver since Lava removed the small, sweet-smelling pouch dangling from her waist and carefully divvied the snow-white, delicious treats evenly among all the timidly outstretched hands, the children here forgot all about the stories their parents had told them about 'Devils'. They even began looking forward to this super cool lady coming to play with them.\nWhen she sees that the animosity in the children's black eyes has faded bit by bit, from both time and her displays of goodwill, Lava finally asks a question that she's wanted to ask for a very long while.\n'Do you guys know what Arts are?'\nLava starts to manifest red, burning flowers one after another, their branches glowing beautifully under the night sky.\nThe children want to approach, but are too scared to. Lava then takes their hands and crouches down to teach them the basics of Arts.\nLava has never seen them imitate her so excitedly, and, surprisingly, she finds a few of them managing to eke out a few sparks. Their Arts may be crude and imperfect, but they certainly lit up their elated faces.\nLava decides to do something that she's always wanted to do.\nEven just for material reasons, it's a good idea to learn Arts. It helps you find a stable job and fills your stomach. You won't have to starve in the cold slums anymore. It's how you escape the fate that's haunted you your whole life.\n\nAs time goes by, one day after another, the world hasn't gotten any better. Nor has it gotten any worse. It yet fosters both misfortune and joy, as well as life and death.\nThe children here have learned the Sarkaz's Arts. They haven't become any better or worse, and they continue to live here, peacefully as ever. But their future has already started to change.\nBy passing this newly forged dagger around from one tiny, curious hand to the next, Lava is slowly changing things her own way."
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "I have some free time, so I guess I could help you out... What's this? This has got nothing to do with disasters and Arts, just some normal paperwork? Hey!",
      "voiceAsset": "char_1011_lava2/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "You wanna try some fortune-telling? Well, that brings me back. I haven't done it for a while. I could take a look at your fortune to kill some time, I guess. Hmm, if your luck isn't beyond words as always... Well, you're gonna have to prove my results wrong.",
      "voiceAsset": "char_1011_lava2/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "I do research on Arts because it's part of my responsibilities as a Caster. If I can't even do that, how am I supposed to protect those who... Huh? You got sweets? For me? Uh, thanks...",
      "voiceAsset": "char_1011_lava2/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Hibiscus... My sister always helps people whenever they need, even if it's not part of her mission. It's like she's not a Sarkaz at all, what with how kind she is. She treats this world with kindness, but how many people know to repay it?",
      "voiceAsset": "char_1011_lava2/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "Why I'm not into fortune telling anymore? 'cause the fear and curiosity that people have about the future usually has to do with natural phenomena. That, and I've realized the results you get with fortune telling don't really mean much, having come face to face with so many cruelties.",
      "voiceAsset": "char_1011_lava2/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "In terms of performance, books and staffs are just about the same as Arts conductors. If you ask me, I think knives are much more practical. When you run short of your Arts and have to throw yourself into a melee, or you're out in the wilderness, just trying to survive, all those words in the books aren't going to do you much good.",
      "voiceAsset": "char_1011_lava2/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "It's a pain to fight as a team, but when I look back on those times I fought side by side with my Reserve Ops teammates now... It brings back memories, I guess. If I get the chance to fight alongside them again... No, never mind.",
      "voiceAsset": "char_1011_lava2/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "I wasn't that grumpy and curt now, was I? How come Hibiscus still treats me like a kid who hasn't grown up yet? It's like she's doing it to pick on me! We finally managed to make up, but it just ticks me off when I see her act so calm about it!",
      "voiceAsset": "char_1011_lava2/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "The times we live in are so messed up, there's just way too much malevolence going around in this world. We have to change that. I can't stand all those rotten hypocrites acting all kindhearted treating my fellow Sarkaz like that... just because of who we are.",
      "voiceAsset": "char_1011_lava2/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Sheesh... You always look so peaceful in your sleep.",
      "voiceAsset": "char_1011_lava2/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Hey, what's the big idea? Who let you come in without knock—Oh, it's you, Doctor. Why am I wearing this? Well... I'm hitting the training grounds to test my limits once more. Wanna come watch, Doctor?",
      "voiceAsset": "char_1011_lava2/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "I got it all down.",
      "voiceAsset": "char_1011_lava2/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "There are lots of talented Casters out there, but I'm not so lucky. That's why I have to get stronger if I want to be able to save the world. Thanks for helping me out, Doctor.",
      "voiceAsset": "char_1011_lava2/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "I've got the hang of fire Arts now. If I keep working on this, I might just make it to the boundaries of modern Arts theory... I might even be able to manipulate space and matter.",
      "voiceAsset": "char_1011_lava2/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "I've got a good idea of the enemy's weaknesses. Let's go.",
      "voiceAsset": "char_1011_lava2/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "I'm not good at this kinda stuff... Just gotta get this over with quickly, right?",
      "voiceAsset": "char_1011_lava2/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "I'm counting on you to have my back while I take care of the enemies.",
      "voiceAsset": "char_1011_lava2/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "You've strayed from the path of righteousness. Your sinful souls deserve no mercy.",
      "voiceAsset": "char_1011_lava2/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "No time to hesitate.",
      "voiceAsset": "char_1011_lava2/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "It's time!",
      "voiceAsset": "char_1011_lava2/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Let's get this started.",
      "voiceAsset": "char_1011_lava2/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Prepare to cast.",
      "voiceAsset": "char_1011_lava2/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Hah!",
      "voiceAsset": "char_1011_lava2/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Tear them apart!",
      "voiceAsset": "char_1011_lava2/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Too weak. There's no point in hiding!",
      "voiceAsset": "char_1011_lava2/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Your tricks won't work here!",
      "voiceAsset": "char_1011_lava2/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "It's only by overcoming challenges that we manage to accomplish something.",
      "voiceAsset": "char_1011_lava2/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Hmph... Accept your defeat in pain and fear. Evil will always be defeated.",
      "voiceAsset": "char_1011_lava2/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "This shows how powerful we are now. It's far from enough, though. I know I can do better than this. I have to do better.",
      "voiceAsset": "char_1011_lava2/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Gah... I gotta... eradicate all evil...",
      "voiceAsset": "char_1011_lava2/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "I still have lots to do. Let me stay here.",
      "voiceAsset": "char_1011_lava2/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "D-Don't pat my head!",
      "voiceAsset": "char_1011_lava2/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "I'm reading. There's still a lot I need to learn... It's time for tea already? Let's get going, then.",
      "voiceAsset": "char_1011_lava2/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_1011_lava2/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Helped yourself with the desserts there, Doctor? You can't run for the hills on an empty belly, and we need sugar to replenish ourselves. Why run for the hills, you ask? See that ominous red tint looking over here from the corridor? If you don't want to get caught and tortured with crap movies, you need to move your legs fast!",
      "voiceAsset": "char_1011_lava2/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Morning, Doctor.",
      "voiceAsset": "char_1011_lava2/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "You've already been waiting here? Tch, you got me this time. Anyway, you can thank me for the present later, for I have something to show you, so quiet now. Just to let you know, we fortunetellers have found a way to boost one's luck. And look no further for its inventor because she's standing right before you. I see... I see... See that? My divination says you'll get even cooler in the future. Also, Happy birthday.",
      "voiceAsset": "char_1011_lava2/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "Where are we making our next stop? Seems the truth of this world always extends far beyond the catastrophes we've learned from papers, just as this dagger in my hand turns out to be more helpful than those words in the books. One day, after I've turned the last page of them, I'll be out there, finding out the truth myself.",
      "voiceAsset": "char_1011_lava2/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "control_mp_cost&faction[900]",
      "buffName": "Alternate Operator",
      "desc": "When this Operator is assigned to the Control Center, each <$cc.g.sp><@cc.kw>Alternate Operator</></> increases the Morale of all Operators in the Control Center by <@cc.vup>+0.05</> per hour",
      "skillIcon": "bskill_ctrl_sp",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "power_rec_spd[022]",
      "buffName": "Heat Charge γ",
      "desc": "When this Operator is assigned to a Power Plant, increases the drone recovery rate by <@cc.vup>+20%</>",
      "skillIcon": "bskill_pow_spd3",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}