{
  "id": "char_297_hamoni",
  "meta_info": {
    "name": "Harmonie",
    "appellation": " ",
    "voiceActor": {
      "en": "Lexi Fontaine",
      "jp": "Yumi Kakazu",
      "kr": "Lee Myeong-ho",
      "cn": "Elaine"
    },
    "rarity": 5,
    "profession": "Caster",
    "subProfessionId": "Mystic Caster",
    "position": "RANGED",
    "team": "dublinn",
    "tagList": [
      "DPS"
    ],
    "nationId": "Victoria",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Harmonie\n[Gender] Female\n[Combat Experience] 9 Years\n[Place of Birth] Victoria\n[Date of Birth] May 13\n[Race] Feline\n[Height] 160cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Standard\n[Mobility] Normal\n[Physical Resilience] Standard\n[Tactical Acumen] Excellent\n[Combat Skill] Standard\n[Originium Arts Assimilation] Excellent",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Harmonie, former Victorian military intelligence agent, now a high-ranking officer for the forces of Dublinn. Stationed aboard Rhodes Island as diplomatic ambassador to the Duke of Wellington, and partially assists Rhodes Island with affairs within Victoria's borders.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Harmonie shows no signs of Originium infection.\n\n[Blood Originium-Crystal Density] 0.12u/L\nOperator Harmonie leads a life of minimal contact with Originium or the Infected.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Due to safety concerns, we have carried out an inspection of the staff Harmonie wields, and can presently confirm it bears no extraneous videotaping nor messaging functionality. Additionally, we have seen the Originium Arts she casts with it, similar in nature to waves of water, and have experienced the induced illusory side-effect of making it difficult to breathe. I went in assuming a Caster of such excellence would be using a more refined staff as an Arts Unit, but found it to fall short of even regulation Victorian military standards. This, plus the fact our records show she almost never visits the training grounds, may be an indicator that she much prefers to grapple with others with her words, pulling strings and building bridges behind the scenes, and makes no habit of setting foot into true, live combat.\nThat said, touching on the several field missions Harmonie has undertaken, her teammates frequently describe her in their reports as 'unforgiving' along with 'swift and decisive,' while those she's helped out are often left feeling like they've made some kind of mistake—not that she actually tells them as such; she simply continues to carry out her orders, completing her mission in a rote manner.\nIt goes without saying, but just as Harmonie herself is typically lax, her own reports are every bit as sloppy.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Prior to entering Victoria, Rhodes Island was fully prepared for the complex situation it'd be involving itself in, and we understood our actions in Londinium would unavoidably draw scrutiny from certain powers. Despite that, the vast majority in the loop were set on edge by Operator Harmonie, envoy to the dukes, boarding the Rhodes Island landship.\nAs far as the lofty dukes go, the fact that they'd explicitly notify us that they were sending an envoy to observe Rhodes Island, rather than employing force to obstruct our continued operations, counts as goodwill in its own right. More crucially, Harmonie voluntarily informed HR of her years of history with intelligence work when submitting her registration data, and provided us with a few classified documents, even (intentionally or not) exposing how she'd been forced on the run until now. She clearly sought to win Rhodes Island's trust by being candid, but what exactly could motivate her to do it like this? And does it represent her own will, or the inclination of the powers that back her?\nSoon after, we investigated Harmonie's background and any matters she'd been involved in. We ascertained that she had previously served as a Victorian Army intelligence officer for a long period, and then elected to serve as a double agent shortly following contact with Dublinn in its early formation, dancing the line between two mutually antagonistic sides. In recent operations, she had inadvertently exposed her identity, was made the target of a covert Victorian Army manhunt, and had no choice but to seek refuge.\nConsidering all the roles she's played in her personal history, as well as the political hazard her relationship with the dukes backing her poses, Rhodes Island put forward strict limitations on her actions during her time stationed here. For her part, she gladly accepted our proposals and reached an agreement with us that she would provide us aid in non-sensitive affairs.\n\nI'm loathed to imagine the risk Rhodes Island is put in by accepting a duke's envoy aboard. Victoria's powers are a tangled web, and the more we investigate the more danger we find hidden in our operators' histories... It seems we've all grown accustomed to it, bit by bit.\n—An HR Operator who declined to be named\n\nIt's true that Operator Harmonie has described being given the cold shoulder within Dublinn following her failures, but beware—this is a trick spies love to use when feigning defection. We will be continuing to monitor her attitude carefully.\nDoes she pose a thorn in our side? Maybe her mixing of fact and fiction is a little irritating. Still, we know her A-to-Z, and possess intelligence that could put her in peril. Someone as clever as her is going to work with us.\n—■■■",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Since passing her file review and employment test, Harmonie has ceased to make mention of her identity, neither touting herself as a Victorian ducal emissary, nor displaying any ties to Dublinn or the Victorian Army. To the vast majority of operators, she's just a new Victorian Rhodes Island arrival with a brisk step and a rather cultured upbringing. They'll often find her on their rest days attending little dance parties and pressing a glass of bubbly into their hands, or run into her cradling a pile of books at the library to check out one after another, skimming everything from assorted national histories to collections of fashion magazines.\nDespite effortlessly striking up conversations with others, Harmonie leaves most operators with neither a friendly nor kind impression—in fact, thoughts such as 'is she having fun with me?' or 'she was lying just now, right?' are the instinctive reaction. 'Y'see, there was this new model of control console in a brochure and she was telling me if I was interested, I should send in a purchase form lickety-split. And, well, just a few days later, the manufacturer's trade route got locked down. Listen, honest, I could've sworn she was messing with me the way she acted. But here I am now, one of the last lucky buyers,' said an operator from Engineering. Whether or not Operator Harmonie is intentionally distancing herself from others as a way of proving she has no intention of causing trouble here, we simply cannot say.\nIn observing this ducal envoy's movements, we were surprised to find that several children have shown a degree of trust in Harmonie. We note that she had little to do in her first days aboard Rhodes Island other than borrow publicly available books from the repository, and the young patients in question, permitted to leave Medical, just happened to have a fledgling interest in history, and would have gladly asked her to teach them about it.\nAmusingly, after some time, the children have very naturally taken to addressing her as 'Miss' like one would a teacher, though Harmonie—who has always taken others' evaluations of her in stride—outright rejects this appellation, stating 'How would I ever be a good teacher?'",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Rhodes Island's operator roster currently contains some persons who have a history with Harmonie. On account of Victoria's ongoing and highly divisive chaos, she has proactively suggested that her contact with said persons be avoided. Needless to say, she also expressed that if Rhodes Island was willing to work with her, she would be very eager to know of Operator Reed's present movements.\nDespite her request for intel pertinent to Reed being principally of benefit to Dublinn, she also claimed, 'I admit I'm just quite curious, knowing how Loughshinny's come so far.' We learned that when Reed was serving in Dublinn as the Leader's body double, Harmonie may well have been the one to have the most contact with her, keeping her company in a role analogous to a tutor or mentor. Reed had minimal contact with her sister, and was unwilling to actively participate in Dublinn's schemes; when Dublinn first began reaching out to nobles with an interest in supporting her, her behavior during their talks was likewise left extremely wanting. In regard to this issue, Harmonie offered all the help she could.\n'What do you think? Give her more reading time alone, give her less pressure, less responsibility? Is that all it would've taken to do good by her? I certainly wouldn't say so. It would always have been hell for her, you see, situated where she was. And it's a shame—her in that position is exactly what Dublinn wanted, so she could play the part of her sister like a good girl.'\nRE: Reed's sister, the other Draco to guide Dublinn's flames, who has now taken center stage—Harmonie has not told us much on this subject, but during an idle chat she seemingly inadvertently mentioned that she is by no means loyal to Dublinn, only hoping to see how far the Leader's endeavors will take her.\n'The batch of personal records I gave you was the truth. I haven't a tie to the Draco royal family nor the Tarans, and the Duke of Wellington? No one in my family's ever had the prestige to serve under, well, His Excellency. I do have some old Gaulish blood in me, though it's an awful pity I have absolutely no interest in the Gaulish irredentist or Draco restoration movements. Rotten old bygones, all of it, you know.\n'I'm just curious to see powers I've never seen, ones that will smash convention into tiny little pieces.'",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "I've asked her about it, and she said she was drunk.\nAn unlikely story, of course, even to herself. The lights weren't on in the AV room, save for the projector, and the table was strewn with drinks and snacks from the viewing party, but she didn't knock anything over, didn't so much as bump anything. She was just... there, dancing away gracefully on top of that tiny little coffee table.\nNo, you're right, it's not important. Maybe I just wanted to ask what was on the projector at the time. I know she borrowed some Rhodes Island combat records along with two Leithanian concert tapes, and I just don't think it was the latter she was watching.\nOr maybe... it's how she turned to the security camera at the end and held out her hand... maybe that's what got me.\nSay, someone just so happened to visit the control center last night, right? Three in the morning? Who could that be?",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1252,
      "atk": 1008,
      "def": 112,
      "magicResistance": 20,
      "blockCnt": 1,
      "baseAttackTime": 3,
      "respawnTime": 70,
      "cost": 24
    }
  },
  "skins": [
    {
      "skinId": "char_297_hamoni#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_297_hamoni",
      "portraitId": "char_297_hamoni_1",
      "illustId": "illust_char_297_hamoni_1",
      "modelName": "Harmonie",
      "drawerList": [
        "STAR影法师"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_297_hamoni#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_297_hamoni_2",
      "portraitId": "char_297_hamoni_2",
      "illustId": "illust_char_297_hamoni_2",
      "modelName": "Harmonie",
      "drawerList": [
        "STAR影法师"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_297_hamoni@epoque#24",
      "skinName": "Invitation",
      "skinGroupName": "EPOQUE/XXIV",
      "skinGroupId": "2023#epoque#6",
      "avatarId": "char_297_hamoni_epoque#24",
      "portraitId": "char_297_hamoni_epoque#24",
      "illustId": "illust_char_297_hamoni_epoque#24",
      "modelName": "Harmonie",
      "drawerList": [
        "STAR影法师"
      ],
      "description": "<color name=#ffffff>EPOQUE Collection New Arrivals/Invitation. A set of formalwear Harmonie wears while enjoying the afternoon in her study. The smart tailoring makes her skirt move in a beautiful curve, and the fabrics are specially chosen to hide any stray fur stuck on her clothes.</color>",
      "rarity": 39
    },
    {
      "skinId": "char_297_hamoni@unveiling#1",
      "skinName": "Decoration",
      "skinGroupName": "Unveiling of Devotion/I",
      "skinGroupId": "2024#unveiling",
      "avatarId": "char_297_hamoni_unveiling#1",
      "portraitId": "char_297_hamoni_unveiling#1",
      "illustId": "illust_char_297_hamoni_unveiling#1",
      "modelName": "Harmonie",
      "drawerList": [
        "STAR影法师"
      ],
      "description": "<color name=#ffffff>Unveiling of Devotion Series New Arrivals/Decoration. A cute dress Harmonie rarely wears. With its adjustable fit and flexible materials, it can accentuate the body's natural curves better than any other. The accessories are all from her beloved private collection.</color>",
      "rarity": 169
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "3-13",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 674,
            "atk": 543,
            "def": 48,
            "magicResistance": 10,
            "cost": 22,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 964,
            "atk": 776,
            "def": 81,
            "magicResistance": 10,
            "cost": 22,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 70,
      "rangeId": "3-14",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 964,
            "atk": 776,
            "def": 81,
            "magicResistance": 15,
            "cost": 24,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 1252,
            "atk": 1008,
            "def": 112,
            "magicResistance": 15,
            "cost": 24,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3251",
          "count": 4,
          "type": "MATERIAL",
          "name": "Caster Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_CST1"
        },
        {
          "id": "30062",
          "count": 3,
          "type": "MATERIAL",
          "name": "Device",
          "rarity": 2,
          "iconId": "MTL_SL_BOSS2"
        },
        {
          "id": "30032",
          "count": 3,
          "type": "MATERIAL",
          "name": "Polyester",
          "rarity": 2,
          "iconId": "MTL_SL_RUSH2"
        }
      ]
    },
    {
      "maxLevel": 80,
      "rangeId": "3-14",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1252,
            "atk": 1008,
            "def": 112,
            "magicResistance": 20,
            "cost": 24,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1546,
            "atk": 1245,
            "def": 125,
            "magicResistance": 20,
            "cost": 24,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3253",
          "count": 3,
          "type": "MATERIAL",
          "name": "Caster Dualchip",
          "rarity": 5,
          "iconId": "MTL_ASC_CST3"
        },
        {
          "id": "30104",
          "count": 6,
          "type": "MATERIAL",
          "name": "RMA70-24",
          "rarity": 4,
          "iconId": "MTL_SL_RMA7024"
        },
        {
          "id": "30043",
          "count": 15,
          "type": "MATERIAL",
          "name": "Oriron Cluster",
          "rarity": 3,
          "iconId": "MTL_SL_IRON3"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_hamoni_1",
      "skillName": "Lithe Steps",
      "desc": "Attack range <@ba.vup>changes</>, attack interval is <@ba.vup>significantly reduced </>, and each attack deals <@ba.vup>{attack@atk_scale:0%}</> ATK as Arts damage",
      "iconId": "skchr_hamoni_1",
      "spCost": 15,
      "initSp": 5,
      "duration": 5,
      "blackboard": [
        {
          "key": "attack@atk_scale",
          "value": 0.5
        },
        {
          "key": "base_attack_time",
          "value": 0.2
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30093",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_hamoni_2",
      "skillName": "A Disastrous Drowning",
      "desc": "When activated, attacks only blocked enemies. Attack interval <@ba.vup>reduces</>, and creates a pool of water in attack range, which causes ground enemies to have <@ba.vup>-{-move_speed:0%}</> Movement Speed and take <@ba.vup>{damage_value}</> Arts damage per second.",
      "iconId": "skchr_hamoni_2",
      "spCost": 30,
      "initSp": 20,
      "duration": 30,
      "blackboard": [
        {
          "key": "damage_value",
          "value": 250
        },
        {
          "key": "base_attack_time",
          "value": 0.6
        },
        {
          "key": "move_speed",
          "value": -0.6
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31013",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30155",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_hamoni",
      "moduleName": "Harmonie's Badge",
      "desc": "Operator Harmonie has demonstrated a perennial commitment to Originium Arts.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Caster Operator during field operations to exercise Mystic Caster responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_hamoni",
      "moduleName": "The Spy's Dossiers",
      "desc": "Personnel: Hamilton\nColonel and commanding officer of County Hillock Barracks, an ordinary citizen with no involvement in any power struggles. Holds a firm and aggressive stance towards people of Taran background. He is on high alert, and decapitation operations are not advised.\nOn the evening of the 12th, he dined with two Messengers at the Waterside Restaurant, lip reading reveals that they were dispatched by a certain Count.\n...\nAs expected, all attempts at communication have failed. It can now be confirmed that the Oripathy crisis in County Hillock has been artificially exacerbated. Someone is stoking his hatred behind the scenes and using his stubborn and self-centered personality to test the Duke of Wellington's stance. The battle plan has taken shape, and the image contains a telegram sent to the barracks on an outlying plate.\nThis calls for a requisite disclosure of information to him in order to reduce suspicion on me from within the military apparatus.\n\nPersonnel: Count Mourning\nIntends to defect to the Duke of Wellington. His demesne is near to Londinium, and a large quantity of Originium product orders have been flowing in. Based on the volume, he has the military prowess to stand firm against the various units outside Londinium.\nHe and his wife share a love of Bolívarian coffee, taking regular trips to purchase the beans in person. His children are not yet of age, and his eldest daughter attended a private secondary school in the Auchterigg Borough of Londinium until departing last year.\nSignature and handwriting can be seen in the image.\n...\nHe is on good terms with the Skamandros family, and most of his trusted aides also have respect for the White Wolf Count. Rita may be a crucial bargaining chip. If Mandragora brings Rita with her to negotiate a collaboration, the process should go smoother. After all, he would not want to see anything happen to his friend's daughter. Time is limited, we will need to push him to make a decision and agree to help Dublinn infiltrate Londinium.\n\nOrganization: 'Rhodes Island'\nThe medical organization that made off with Loughshinny. They're registered in Victoria and have four drug patents pertaining to Oripathy.\n...\n\n'The remaining pages are all about you, so you've no need to scrutinize them any further, right?'\n'I've been at it for nearly a year now, and this is the only information I've gathered. I have to compliment your clandestine work.'\n'The intelligence I'm offering you is only the lovingly curated fraction that is beneficial to the both of us. Whether or not I've fabricated anything is up to you to determine.'\n'...Come now, have I not been sufficiently pacifist in my methods?'\n'After all, I've never picked anyone out as an enemy, and I don't particularly enjoy seeing people sacrifice themselves.'\n'I just like to push people in the right direction and listen as those contradictory bits form their own harmony.'"
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "If you didn't have the time to get to all these files, why didn't you come ask me for help? I would've been more than glad.",
      "voiceAsset": "char_297_hamoni/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Don't worry, there wouldn't be anything in it for me if I left Rhodes Island, at this point. You're free to get up to whatever it is you usually do, never mind the fact I'm here. And as recompense for your trust, I won't leak a single detail of your work. Now come on, chop-chop. I'm deathly concerned for you, what with that doorstopper of a document.",
      "voiceAsset": "char_297_hamoni/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "'Darling Rita.' I assume you're curious, if you bring it up? You know those certain few students who always leave their mark on you in your school years? I took quite a fancy to one of them—such an excellent soldier she turned out to be. Still, we have the space to keep out of each other's ways here, and that suits my fancy just as well.",
      "voiceAsset": "char_297_hamoni/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Anything you'd like of me, Doctor of Rhodes Island? If it's in my power to deepen our bilateral trust, then I <i>would</i> be willing to stop gazing out at the window scenery, and focus a little instead on whatever it is that's vexing you.",
      "voiceAsset": "char_297_hamoni/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "Shame you're short on people with a shrewd eye for Londinium affairs—I was quite curious what they'd think of me. After all, a medical organization like Rhodes Island, unaffiliated with any nation, opting to work with us? Either you did it out of sheer idiocy, or if not, then you must've known a little too much.",
      "voiceAsset": "char_297_hamoni/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "So what's your next step? Keep throwing yourself into the maelstrom of Victoria, or continue to build the peaceful paradise that Rhodes Island hopes for? The Leader once gave me a display of land torched to ash by her fires, and I'm ever so curious. If you had flames, what color would they be?",
      "voiceAsset": "char_297_hamoni/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "'Reed.' Such a darling codename—I can practically guess what was on her mind when she came up with it. Still, I'd be more the fool for claiming the prospect of a book club partner drove me here. She just happens to be somebody very useful, hence my need to protect her.",
      "voiceAsset": "char_297_hamoni/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Just making a little bookside conversation, but... how do you regard the act of dancing? You know, when hands rest on collars, and gazes lock, and involuntary reactions let slip the true intentions of you or I—my my, your heart's hardly fluttering at all. No wonder The Leader's so interested in you.",
      "voiceAsset": "char_297_hamoni/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "I've gone through the files on my desk. Not at all surprised Rhodes Island would be going after my true reasons for coming here. That said, you were kind enough to drop the papers off with me? You must not be planning to boot me out any time soon, let alone hand me off to a duke. So, what is it you want me to do for Rhodes Island, or perhaps, for you?",
      "voiceAsset": "char_297_hamoni/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Hm-hmm, time to paint my nails. What pattern shall we go with?",
      "voiceAsset": "char_297_hamoni/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Pleased to meet you, and my codename is Harmonie. Here's a dossier on Victoria for Rhodes Island's perusal, as a gesture of goodwill. Don't umm and ahh about it, now—that's basic etiquette for when someone thanks you. May we get along smashingly in the days to come, Doctor.",
      "voiceAsset": "char_297_hamoni/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "Oh, what a splendid war command.",
      "voiceAsset": "char_297_hamoni/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "Ah, well, thank you very much. It's my honor to receive your endorsement.",
      "voiceAsset": "char_297_hamoni/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "What you're doing here has me startlingly curious. What could you be up to, placing me in this position?",
      "voiceAsset": "char_297_hamoni/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "What would you have me do for Rhodes Island?",
      "voiceAsset": "char_297_hamoni/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "I thank Rhodes Island for its trust.",
      "voiceAsset": "char_297_hamoni/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "I do hope none of you turn on the waterworks anytime soon.",
      "voiceAsset": "char_297_hamoni/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Get yourselves ready.",
      "voiceAsset": "char_297_hamoni/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Present.",
      "voiceAsset": "char_297_hamoni/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Received.",
      "voiceAsset": "char_297_hamoni/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Operation commencing.",
      "voiceAsset": "char_297_hamoni/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "On your command.",
      "voiceAsset": "char_297_hamoni/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Take a breath, go on. It's not as if I'm crushing your throat.",
      "voiceAsset": "char_297_hamoni/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Stop flailing about, and do as I tell you.",
      "voiceAsset": "char_297_hamoni/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Now now, close your eyes.",
      "voiceAsset": "char_297_hamoni/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "This'll all be over before you're bored of it.",
      "voiceAsset": "char_297_hamoni/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "If I hadn't seen the battle for myself, I just might have been shocked by your command style.",
      "voiceAsset": "char_297_hamoni/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "I'm sure if The Leader saw you now, she'd be delighted.",
      "voiceAsset": "char_297_hamoni/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Oh, there's a rare sight. Maybe you have other things on your mind?",
      "voiceAsset": "char_297_hamoni/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Right, what else can I do here?",
      "voiceAsset": "char_297_hamoni/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Minimalistic, but not at all design-deficient. I have to laud your tastes.",
      "voiceAsset": "char_297_hamoni/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Tut...! Ah. Was something the matter, Doctor? Do tell.",
      "voiceAsset": "char_297_hamoni/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "If you're free, we could always chat about your bookshelf.",
      "voiceAsset": "char_297_hamoni/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_297_hamoni/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "It's a day worthy of celebration, and I'm here on a certain noble's behalf to gift you this. I will say, though, I've been watching this entire scene unfold, and it makes me think back to my student days, dancing with my classmates at whatever functions the school put on. Those were indeed times...",
      "voiceAsset": "char_297_hamoni/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Hello, Dr. {@nickname}. Cup of tea?",
      "voiceAsset": "char_297_hamoni/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "I'm not here unprepared, let me say that. It'd be incredibly rude of me to have forgotten the date. I'm sure the typical gift-giving fare wouldn't have piqued your interest, so I have some choice pieces of intel I assume you'll like—if, of course, you're willing to believe me.",
      "voiceAsset": "char_297_hamoni/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "You really do seem to have the utmost confidence in the future you're cooking up. A paradise, is it? You starry-eyed people and I may only be together so long, but make no mistake, the way your endgame will pan out makes me very curious.",
      "voiceAsset": "char_297_hamoni/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "dorm_rec_oneself[000]",
      "buffName": "Solitude",
      "desc": "When this Operator is assigned to a Dormitory, self Morale recovered <@cc.vup>+0.7</> per hour",
      "skillIcon": "bskill_dorm_one2",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "meet_spd&cost_condChar[000]",
      "buffName": "Double Agent",
      "desc": "When this Operator is assigned to the Reception Room, if no other Operators are working in the Reception Room, increases Clue search speed by <@cc.vup>50%</>, and Morale consumed per hour <@cc.vdown>+2</>",
      "skillIcon": "bskill_meet_spd&cost_condChar",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}