{
  "id": "char_4093_frston",
  "meta_info": {
    "name": "Friston-3",
    "appellation": " ",
    "voiceActor": {
      "en": "John Kassir",
      "jp": "Shuichi Ikeda",
      "kr": "Lim Chae-bin",
      "cn": "Dong Shengzhang"
    },
    "rarity": 1,
    "profession": "Defender",
    "subProfessionId": "Protector",
    "position": "MELEE",
    "team": "",
    "tagList": [
      "Robot",
      "Defense"
    ],
    "nationId": "Rhodes Island",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Model] Friston-3\n[Gender Assignment] Male\n[Time in Service] Less than 1 year\n[Manufacturer] Rhodes Island\n[Place of Production] Rhodes Island\n[Date of Release] Nov 13\n[Height] 145cm\n[Weight] Classified\n[Inspection Results]\nSmall amount of wear on outer casing, structure intact, exceptional durability. Generator and chassis in good condition. Energy barrier systems operating normally, database up to date. Service normal. ECU in good condition.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Top Speed] 24km/h\n[Climb] Standard\n[Brake] Standard\n[Mobility] Standard\n[Endurance] Standard\n[Structural Integrity] Excellent",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Friston 3 is an S-C Model four-wheeled Operation Platform, the first product of the Rhodes Island Smart Operation platform R&D Team's efforts. Closure personally led the team throughout the development process, from concept design to assembly and testing. Friston-3 is also based on PRTS, achieving a new comprehensive standard for operation platforms, from the underlying source code to the external modules. He weighs less than the other retrofitted operation platforms on Rhodes Island, while being more versatile and stable, and currently participates in operations as a Defender Operator.\n[Classified Log]\nThe source code for Friston-3's core, compiled ideations, and other design details are temporarily unavailable to Operators, so please contact Closure directly if you have any questions.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Being Rhodes Island's very first smart operation platform developed fully in-house, Closure worked so hard on Friston-3 that she ended up 'over-designing' him——\n'He should have the best combat equipment,' so Friston-3 has been equipped with the latest energy barrier generator developed by the engineering department; 'He should have deep learning and adaptive capabilities,' so Friston-3 has an auto-updating database app, the ability to read and scan data, and a floating navigation module installed; 'He should have a rich symbolic language system not inferior to humans,' so Friston-3 has a built-in set of simple but striking emoticons that are updated quarterly; 'He should have an auto-adjusting conscious need to be entertained,' so Friston-3 has an instant camera attached onto him so he can 'snap some pics,' and requests to Procurement for films have doubled... More add-ons like these are implemented every time he undergoes maintenance, which Closure takes great joy in while Friston-3 himself is extremely opposed to these modifications.\nWhen asked why they're no longer simply retrofitting operation platforms from Raythean Industries, Rhodes Island's Chief Engineer Closure answered as such: 'Because we should have done this a long time ago! I hate having to depend on other people's core technologies! And I always had a hunch that those Columbian companies would sneak in some backdoor plug-ins into their smart devices... And as for why we started doing this with Friston-3? It's because we've finally nailed down the skills we need in Engineering, ever since we started with Lancet-2. Also, Kal'tsit brought back Friston-3's core data from Trimounts, so it doesn't feel right to let him go through Columbian hands again for any step of the process... there's just too many complexities to consider. Alright, our chat ends here. Next up is testing his morale-raising song playback module. Where's the remote control? With me, of course.'",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'THRM-EX is super passionate, while big brother Castle-3 has the wisdom of experience, and Lancet-2 is like a timid yet earnest girl who often shoots herself in the wheel... Chiave aside, we all know it's just for appearance, but Friston-3 really, really seems like a human, for real!'\n——Windflit\n\n'Lancet-2 and the others have become frequent visitors to the Lutra Workshop after Friston-3 showed up. Why? He keeps earnestly trying to teach the other robots just how advanced true AI has gotten, how to consider different prospects, what societal opinions are, and prodding them to reflect on their own existence with stuff like 'Instrumentalism' and 'what consciousness means'... he's already overloaded Lancet-2's cognitive module three times by now!'\n——Mayer\n\n'I invited Mr. Friston-3 here to act as a special consultant for the Rhodes Island Bioengineering Lab, and I did this after thinking it over carefully. He holds an astonishing amount of knowledge in biology, bioengineering, neuroscience, information science, and all that knowledge is surprisingly not in any of the databases he's connected to... His forward-looking understanding of how life and societal patterns evolve regularly leaves us mind-blown. Everything he says sounds completely plausible, but also makes you think of a parallel world, a place faintly familiar and yet completely alien to us... it does make you feel a little uneasy.\n'He's not easy to talk to, though. He's pretty prejudiced, overly aggressive, a perfectionist, wants full control over his scientific research, and doubts the basic models academics currently use to verify their experimental data. And most of the time, you can't convince him otherwise. Though fortunately for us, he's equally curious about how our various technological fields are developing, so we can still manage some form of effective communication. But you know how the smarter the scientist, the harder they are to get along with... so it isn't that surprising for a scientist robot to be a little eccentric.'\n——Weedy\n\nThe above are all excerpts from operators' submissions to the Rhodes Island Smart Operation Platform Service Research Survey\n\n'They're definitely not having a friendly chat, because he's not the friendly sort to begin with. Don't worry about it though, it's par for the course with him. And it's so rare to see Kal'tsit stunned and speechless by a robot, haha... Well, it's not actually that funny. He's angry, feels humiliated, and will never run out of questions to ask her... but what can we really do? I warned Kal'tsit about this long ago.'\n——Recording from the Engineering Department of Closure's response to some operators asking about Friston-3's frequent visits to Kalt'sit",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Classified Log]\n......\n'But, Kal'tsit. I'm being serious here, do you really want to go through with this? I studied the data you brought back, and even though there's only a little bit of the personality program left, it's still pretty intact. In fact, it's so intact I can't completely decipher it. At this point, I wouldn't even call him a robot more intelligent than Lancet-2, but an actual person with amnesia...'\n'Do you think it's cruel, to stuff a person's soul into a machine?'\n'I have to admit, I did feel a little excited at the prospect... but is this really appropriate?'\n'I'm not actually sure myself.\n'He did express a willingness to travel through the Terra of today in the last moments of his 'life,' but I'm not sure this counts as a new life for him. He would find himself in a shell, on a ship, in a land, all completely alien to him...\nHis memory will be stuck at that moment from tens of thousands of years ago, and as he looks forward to his upcoming odyssey...\n'I will tell him that his journey has long ended.'\n'Well, who could even bear a change this drastic? Currently, we're still testing out the core components we developed, and it's hard to tell just how well his personality program will adapt to the modules we made in-house. If his 'mood swings' fluctuate beyond what PRTS can regulate with our Engineering Department's tech, or to be more precise, with Terra's current tech...\n'Simply put, I can't guarantee he won't lose control, Kal'tsit.'\n'...I'll shoulder the responsibility.'\n'I can't believe you'd act on something you're not even sure of...'\n'We need Trevor Friston's knowledge. What he knows of humanity, of crises, of Terra, and everything beyond this great land... We need him even if this will be the second time in his life he must accept such a cruel fate. I'll convince him, he's that kind of person after all.'\n'Alright, alright. If you're so set on this, I'm happy to work on it. I promise you he'll be my masterpiece!'\n'...Don't let too many people disturb him.'\n'Relax, I've marked down his info as 'confidential.' But since he's our very first platform developed in-house, there's still some publicity to do..'\n......\n——Recordings from the Engineering Team's Smart Operation platform Laboratory, marked to be destroyed",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 921,
      "atk": 158,
      "def": 188,
      "magicResistance": 0,
      "blockCnt": 3,
      "baseAttackTime": 1.2,
      "respawnTime": 200,
      "cost": 3
    }
  },
  "trait": [],
  "skins": [
    {
      "skinId": "char_4093_frston#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_4093_frston",
      "portraitId": "char_4093_frston_1",
      "illustId": "illust_char_4093_frston_1",
      "modelName": "Friston-3",
      "drawerList": [
        "过失帝国"
      ],
      "description": "A mechanical body, some programs, a new look. He cannot find what he has forgotten, and cannot remember much either. But he can still witness, record, and analyze, and still has the right to face his cruel fate.",
      "rarity": -50
    }
  ],
  "phases": [
    {
      "maxLevel": 30,
      "rangeId": "0-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 921,
            "atk": 158,
            "def": 188,
            "magicResistance": 0,
            "cost": 3,
            "blockCnt": 3,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 200,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 30,
          "data": {
            "maxHp": 1152,
            "atk": 198,
            "def": 235,
            "magicResistance": 0,
            "cost": 3,
            "blockCnt": 3,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 200,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    }
  ],
  "skills": [],
  "skills_1to7": [],
  "potentialRanks": [
    {
      "type": "CUSTOM",
      "description": "Improves Talent",
      "buff": {}
    },
    {
      "type": "CUSTOM",
      "description": "Improves Talent",
      "buff": {}
    },
    {
      "type": "CUSTOM",
      "description": "Improves Talent",
      "buff": {}
    },
    {
      "type": "CUSTOM",
      "description": "Improves Talent",
      "buff": {}
    },
    {
      "type": "CUSTOM",
      "description": "Improves Talent",
      "buff": {}
    }
  ],
  "favorKeyFrames": [
    {
      "level": 0,
      "data": {
        "maxHp": 0,
        "atk": 0,
        "def": 0,
        "magicResistance": 0,
        "cost": 0,
        "blockCnt": 0,
        "moveSpeed": 0,
        "attackSpeed": 0,
        "baseAttackTime": 0,
        "respawnTime": 0,
        "hpRecoveryPerSec": 0,
        "spRecoveryPerSec": 0,
        "maxDeployCount": 0,
        "maxDeckStackCnt": 0,
        "tauntLevel": 0,
        "massLevel": 0,
        "baseForceLevel": 0,
        "stunImmune": false,
        "silenceImmune": false,
        "sleepImmune": false,
        "frozenImmune": false,
        "levitateImmune": false,
        "disarmedCombatImmune": false,
        "fearedImmune": false
      }
    },
    {
      "level": 50,
      "data": {
        "maxHp": 100,
        "atk": 0,
        "def": 70,
        "magicResistance": 0,
        "cost": 0,
        "blockCnt": 0,
        "moveSpeed": 0,
        "attackSpeed": 0,
        "baseAttackTime": 0,
        "respawnTime": 0,
        "hpRecoveryPerSec": 0,
        "spRecoveryPerSec": 0,
        "maxDeployCount": 0,
        "maxDeckStackCnt": 0,
        "tauntLevel": 0,
        "massLevel": 0,
        "baseForceLevel": 0,
        "stunImmune": false,
        "silenceImmune": false,
        "sleepImmune": false,
        "frozenImmune": false,
        "levitateImmune": false,
        "disarmedCombatImmune": false,
        "fearedImmune": false
      }
    }
  ],
  "talents": [
    {
      "candidates": [
        {
          "unlockCondition": {
            "phase": "PHASE_0",
            "level": 1
          },
          "requiredPotentialRank": 0,
          "prefabKey": "1",
          "name": "Persevere I",
          "description": "For 10 seconds after deployment, friendly units on surrounding tiles take 50 less damage",
          "blackboard": {
            "duration": 10,
            "damage_resistance": -50
          },
          "tokenKey": null,
          "isHideTalent": false
        },
        {
          "unlockCondition": {
            "phase": "PHASE_0",
            "level": 1
          },
          "requiredPotentialRank": 1,
          "prefabKey": "1",
          "name": "Persevere II",
          "description": "For 10 seconds after deployment, friendly units on surrounding tiles take 55 less damage",
          "blackboard": {
            "duration": 10,
            "damage_resistance": -55
          },
          "tokenKey": null,
          "isHideTalent": false
        },
        {
          "unlockCondition": {
            "phase": "PHASE_0",
            "level": 1
          },
          "requiredPotentialRank": 2,
          "prefabKey": "1",
          "name": "Persevere III",
          "description": "For 10 seconds after deployment, friendly units on surrounding tiles take 60 less damage",
          "blackboard": {
            "duration": 10,
            "damage_resistance": -60
          },
          "tokenKey": null,
          "isHideTalent": false
        },
        {
          "unlockCondition": {
            "phase": "PHASE_0",
            "level": 1
          },
          "requiredPotentialRank": 3,
          "prefabKey": "1",
          "name": "Persevere IV",
          "description": "For 10 seconds after deployment, friendly units on surrounding tiles take 65 less damage",
          "blackboard": {
            "duration": 10,
            "damage_resistance": -65
          },
          "tokenKey": null,
          "isHideTalent": false
        },
        {
          "unlockCondition": {
            "phase": "PHASE_0",
            "level": 1
          },
          "requiredPotentialRank": 4,
          "prefabKey": "1",
          "name": "Persevere V",
          "description": "For 10 seconds after deployment, friendly units on surrounding tiles take 70 less damage",
          "blackboard": {
            "duration": 10,
            "damage_resistance": -70
          },
          "tokenKey": null,
          "isHideTalent": false
        },
        {
          "unlockCondition": {
            "phase": "PHASE_0",
            "level": 1
          },
          "requiredPotentialRank": 5,
          "prefabKey": "1",
          "name": "Persevere VI",
          "description": "For 10 seconds after deployment, friendly units on surrounding tiles take 75 less damage",
          "blackboard": {
            "duration": 10,
            "damage_resistance": -75
          },
          "tokenKey": null,
          "isHideTalent": false
        }
      ]
    }
  ],
  "modules": [],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "If I become your assistant, Closure won't be able to touch me anymore, yes? I'm aware of her extreme interest in me, but her planned modifications on my body are both ridiculous and unacceptable. They're an insult to a scientist, and I won't allow it even in my current form.",
      "voiceAsset": "char_4093_frston/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Why would humanity grow horns and tails? This stage of biological evolution is past my parameters of understanding... I know tens of thousands of years have passed— Kal'tsit has mentioned this countless times. Hmm, I will need a bit more time to formulate my deduction.",
      "voiceAsset": "char_4093_frston/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Closure wanted me to sound like a 'thirty-year-old rock band vocalist with a raspy voice,' but my original body was already twice that age... at least, that's what my final memories tell me.",
      "voiceAsset": "char_4093_frston/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Let's stop here for today, Doctor. I have to go over to Kal'tsit's office. She must be needlessly burning the midnight oil again. A soul, driven by her sheer sense of mission to trudge on for tens of thousands of years, just to stop what exactly? It would be better for her to get more sleep.",
      "voiceAsset": "char_4093_frston/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Doctor, don't look at me the same way you do Castle-3 and the others. They are very... cute. But my robot body is just like your hood, merely a sort of costume... a style. I know who I am, and thus you and I are more alike.",
      "voiceAsset": "char_4093_frston/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "I'm not arrogant, but I am angry at your ignorance and lack of self-awareness, angry at your self-righteousness, all of you. Yes, I've lost all my knowledge, so you can take this anger as merely a 'result' of my 'calculations,' and a very clear result at that.",
      "voiceAsset": "char_4093_frston/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "My wife, daughter, and the rest of my people are eternally resting in those sarcophagi, and will never wake up again. I've made many decisions, I'm well aware. But all I remember is that final dinner, where everyone bid me farewell, and prayed that the subsequent odyssey would go smoothly...",
      "voiceAsset": "char_4093_frston/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Doctor, are you free? I hope you might take me out for a walk.",
      "voiceAsset": "char_4093_frston/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Hello there, I am Friston. That's right, just 'Friston,' not 'Friston-3' or whatever. I am not a replica, and very much less a reproduction of a replica. I hope you understand.",
      "voiceAsset": "char_4093_frston/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "This is valuable research material. I shall require a copy for myself.",
      "voiceAsset": "char_4093_frston/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Doctor, which sector do you need me to take charge of?",
      "voiceAsset": "char_4093_frston/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Am I to lead everyone and find a new direction...? Very well, I won't let them down this time.",
      "voiceAsset": "char_4093_frston/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Let's go. This is also a new journey.",
      "voiceAsset": "char_4093_frston/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Danger detected!",
      "voiceAsset": "char_4093_frston/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "I will relay our combat strategies to THRM-EX and Lancet-2.",
      "voiceAsset": "char_4093_frston/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "I am naturally capable of more than THRM-EX and the others. I will shield them on the front line.",
      "voiceAsset": "char_4093_frston/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "As long as I'm still standing, no one will come to harm.",
      "voiceAsset": "char_4093_frston/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "I will not fall.",
      "voiceAsset": "char_4093_frston/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Are you all staring at my expression doodle?",
      "voiceAsset": "char_4093_frston/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Your behaviors have been recorded and archived.",
      "voiceAsset": "char_4093_frston/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Where's your leader? I need to talk!",
      "voiceAsset": "char_4093_frston/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "What a disgrace... these ugly creatures.",
      "voiceAsset": "char_4093_frston/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Doctor, your thinking routines and command style are very much distinct and different from the others... I guess some things never change.",
      "voiceAsset": "char_4093_frston/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "I still remember the duty I bear, but I must admit, I am no longer able to fulfill it, let alone execute it as well as you do. You have my respect, Doctor.",
      "voiceAsset": "char_4093_frston/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "An odyssey will always have nigh-avoidable accidents, and a plan might always go wrong. They may be painful to accept... but what else can I do except accept them?",
      "voiceAsset": "char_4093_frston/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "If the worst possible outcome is turning into something like me, then there is nothing to be afraid of. Doctor, you should evacuate first, and leave the rest to me.",
      "voiceAsset": "char_4093_frston/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "I would like to stack all of my borrowed ecological research materials over here. I trust there will be no issues with that?",
      "voiceAsset": "char_4093_frston/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "You should have observed my expression doodle. Currently, it's 'anger'.",
      "voiceAsset": "char_4093_frston/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "I've taken a photo of you, Doctor. You want to see it? Sorry, I've already saved it to my archives.",
      "voiceAsset": "char_4093_frston/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_4093_frston/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "The point of festivals is to wallow in nostalgia and longing. I wish you happiness, Doctor. It's a pity that I no longer have a past to miss, and no future worth anticipating... Oh? 'Justice Knight,' THRM-EX, what you doing? Doctor, did you call them over?",
      "voiceAsset": "char_4093_frston/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "How do you do, Doctor?",
      "voiceAsset": "char_4093_frston/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Happy birthday, Doctor. Now, I would like to use this chance to once again declare the following: Do <i>not</i> celebrate my birthday on the 13th of November, that is the production date of 'Friston-3,' not the birthday of Friston.",
      "voiceAsset": "char_4093_frston/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "I know that Kal'tsit keeps bringing up these 'incidents' I have no recollection of, hoping that I will gradually come to accept them. I understand my current situation, and I will stay with Rhodes Island. But for the future, I hope that I can find the answer myself... and not just through a 'calculation.'",
      "voiceAsset": "char_4093_frston/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "power_rec_spd[000]",
      "buffName": "Backup Energy",
      "desc": "When this Operator is assigned to a Power Plant, increases the drone recovery rate by <@cc.vup>+10%</>",
      "skillIcon": "bskill_pow_spd1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "power_rec_spd_P[000]",
      "buffName": "'Pleasant Conversation'",
      "desc": "When this Operator is assigned to a Power Plant, if <@cc.kw>Kal'tsit</> is assigned to the Control Center, increases the drone recovery rate by <@cc.vup>+5%</>.",
      "skillIcon": "bskill_pow_spd_P",
      "phase": "PHASE_0",
      "level": 30
    }
  ],
  "tokens": [],
  "patch_info": {}
}