{
  "id": "char_1029_yato2",
  "meta_info": {
    "name": "Kirin R Yato",
    "appellation": " ",
    "voiceActor": {
      "en": "Jessica Mcdonald",
      "jp": "Saki Fujita",
      "kr": "Woo Jeong-sin",
      "cn": "Fifi"
    },
    "rarity": 6,
    "profession": "Specialist",
    "subProfessionId": "Executor",
    "position": "MELEE",
    "team": "",
    "tagList": [
      "Fast-Redeploy",
      "Nuker"
    ],
    "nationId": "Rhodes Island",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Yato\n[Gender] Female\n[Combat Experience] 8 years\n[Place of Birth] Higashi\n[Date of Birth] May 14\n[Race] Oni\n[Height] 161cm\n[Infection Status]\nInfection confirmed by medical examination.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Excellent\n[Mobility] Excellent\n[Physical Resilience] Standard\n[Tactical Acumen] Standard\n[Combat Skill] Excellent\n[Originium Arts Assimilation] Standard",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "After brief treatment, Yato has returned from Higashi back to her post, continuing to fulfill her role as captain of Rhodes Island Op Team A4. Clad in all-new equipment forged by the Felynes, she is now set to take on further high-risk operations, her willpower even stronger than it once was.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests show the indistinct outlines of internal organs, obscured by abnormal shadows. Originium granules detected in the circulatory system. The subject is confirmed to be infected with Oripathy.\n\n[Cell-Originium Assimilation] 9%\nNo surface-level Oripathy symptoms visible as of yet.\n\n[Blood Originium-Crystal Density] 0.27u/L\nAfter returning from Higashi, Yato's infection has intensified, and is now effectively under control following treatment.\n\n'Operator Yato had fairly frequent contact with Originium during her mission, with her condition degrading to some degree compared to before. But she has firmly requested that we only provide conservative treatment and regular checkups to avoid affecting her work. Also, I'd like her not to go rushing out before her checkup's done next time!'\n—A Medical Department Operator",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Once back at Rhodes Island from her trip to Roka Village in Higashi, Yato caused quite a sensation. However, this was not due to her encounter with an unknown lifeform, but rather the peculiar gear she was dressed in from head to toe.\nPreliminary tests of her equipment's functions showed the defensive gear—made from special materials—able to produce bursts of white light from nowhere that could intercept attacks, while the weapons exhibited a terrifying power akin to thunder. Further, the set as a whole displayed mysterious properties during testing, such as empowering the wearer's bodily functions, or causing the monitoring values to drop drastically without warning during an impact test. Though the mechanisms remain unclear, we can confirm that these properties are closely related to the materials comprising it.\n'This is insane! I've never seen a material like this before!' an Engineering Operator fervently exclaimed, before trading copious quantities of Felvine with the Felynes to learn the keyword 'Kirin.' Reportedly (and buoyed by a connection to a real name), she later snuck into Leizi's room, the consequences of which are left as a trivial exercise for the reader.\nAccording to Yato herself, while this new equipment improves her combat ability, it has also affected her daily life in a way somewhat difficult to articulate. This has included a steep uptick in gazes from people nearby, and frequent low sighs that suddenly vanish as she approaches. However, given her personality, these changes only confounded her for a brief while, and were very soon mentally filed away as 'not important' and ignored.\nEngineering recently pushed a new update to its equipment analysis report, which in particular aimed to verify the 'you don't get hurt no matter how high you fall from' functionality the Felynes have spoken of. Final test results showed this functionality does not exist whatsoever. When Yato received this report, her disappointment was, to put it mildly, audible.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "In recent mission reports, all operators working with Yato have mentioned the same particular point: her modus operandi is now quite different.\nA few have indicated that on missions, she has surprisingly taken the initiative to ask their opinions, a once fleetingly rare occurrence. According to them, she now makes decisions after gathering and considering multiple suggestions, making a concerted effort to take each of her teammates' ideas into account. Furthermore, she is no longer absorbed in completing missions as fast as possible, beginning to incorporate the concepts of avoiding excess damage and minimizing unnecessary sacrifices into consideration.\nTrue, Yato's style is still swift as lightning, and she craves combat even more than before, but it's plain to see she is striving to learn to minimize costs and achieve more perfect results, and this applies to more than missions. However, it is also true that the aforementioned changes have reduced her overall mission efficiency, even causing crises in certain situations; she clearly hasn't fully adapted to this way of thinking yet.\nYato's transformation has privately garnered wide approval from operators, and though she won't personally admit it, all are of the belief that her experiences at Roka Village moved her in some way, leading directly to how she is now. Many operators hope to be of help to her in this time of trouble, but having her accept their goodwill is a new conundrum in itself.\nRegardless, there is one thing nobody doubts. When Yato faces critical life or death situations, she is bound to take the lead, resolutely making the charge with no fear of bloodshed. No challenge can shake her willpower, a fact that remains the same as ever.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Voice Log 1]\n'HUGE discovery! Last time in the field, I saw Noir Corne's bento box next to Yato's and the designs were EXACTLY the same! And their bentos were both omurice too! They've GOTTA have been made by the same person!'\n'That's not all I saw either. See, I went to the Training Room one time, and found Yato maintaining a sword all serious. Didn't think anything of it at first, but when I got a closer look I was like, isn't that Noir Corne's new long sword she's working on?'\n'Also, also! Sometimes I go out to the deck for some fresh evening air after I drink a little too much at the bar, and this one time I saw Yato and Noir Corne up there from way far away, the two of them together, shoulder to shoulder ON THE DECK, gazing up at the night sky... I sobered up INSTANTLY, it was such an image!'\n'I heard that on the way back from a mission, they suddenly changed their route, and the two of them went off alone to who-knows-where, and only came back way later. I mean, do you think maybe they really <i>are</i>...'\n'What're you chatting about?'\n'Er, *coughing*, Yato, good evening—'\n[Voice Log 2]\nNoir Corne? Like I've said, I don't hate him.\nI've known him forever, after all. He helps me out plenty during work, and looks out for me during off-time too. A lot of times, I've only made the right decision thanks to him reminding me of something I didn't consider. He can piss you off sometimes, but I suppose I'm used to it, personally speaking.\nI've definitely been thinking about the past more, since we got back from that mission. The old days when I wielded my sword like some kind of machine, my time on the run with Noir Corne, those sleepless nights, the pain of regret and blaming myself, and... the day I met him for the first time. That's when it all started. That's when the course of my life actually began to change. I suppose he deserves some credit for who I am today.\nYes, of course I know the reason he used to wear a mask. Back then, I was always focused solely on work and ignored everyone around me, and now I look back on it, there were things I could've done for him that I should've, I think.\nUh... do I have to find a word to describe him? Well... I guess for me, 'irreplaceable' is about right. I don't think I can imagine a day when I'd have to go on without him.\nWait, why so close up? What... me, to him? Directly? Uh, no... I... no, I don't understand what you're talking about. Oh! Look at the time, I've still got work, see you!",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Classified Log]\nI read their entire mission report.\nAn unknown creature invading, mountain wildlife going berserk, excessive Originium mining triggering a Catastrophe... I admit, it took me by surprise that even a region as remote as Roka Village could be host to such things.\nAmid all this danger, Yato was tormented in a way the layperson could never imagine. The sheer willpower it must have taken to persevere until mission completion stuns even me. Still, I must recognize that the incident at Roka Village is but one of the many threats that this land faces. The future does not bode well.\nYato's missions will only grow more arduous from here on out, with the handling of further threats that defy prediction, and contending with enemies whose danger goes beyond simple numbers. She will bleed again, be wounded again, be plunged into the abyss countless more times, and can only climb back out by her own two bloodied hands.\nDo I feel guilty? No, there will always be someone ready to do these things. If not Yato, then others among our roster will tread the same path.\nHere is what is worth celebrating: Despite the fact that we can envision this future, warriors like Yato still choose to stand on our side. They leave their pasts behind, shoulder grave responsibilities with unyielding will, continue to fight with incredible bravery, and carry out the mission we all share. Perhaps they will fall, but they will not cower. It is their existence that paints Rhodes Island in its fundamental colors, and casts our impregnable armor.\nThat is my belief. The cornerstones of Rhodes Island will be the cornerstones of its tomorrow.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Doctor, this is something you need to know about! This is already the third time we've notified Operator Yato about the whole Training Room issue!\nThe first time, that new weapon of hers wrecked every target in the room, and cut the wall and ceiling into shreds too! Her explanation was she was learning some new move from the Palico, but I spent three solid days and nights getting just the wall fixed!\nThe second time, she dragged half a wooden stump into the Training Room again, because apparently the Felynes found it and called it 'The Stump That Never Breaks'. She was going to demonstrate some combat skill called 'Demon Mode,' and that drew in a whole bunch of operators ready to take notes. And you know how things turned out? I hope you do, because the state of the place was so miserable I can't even describe it with words.\nThe third time, I saw her and the Felynes myself, lugging this ginormous monster dummy made of wood into the room to give Op Team A4 a drill on dealing with giant lifeforms, before closing the doors. I could've been a hundred meters out and still heard the ruckus in there... I'm gonna be honest, I've lost the guts to even set foot in that room anymore.\nDoctor, I know her combat strength's shot through the roof since getting that new gear, and it's great and all that she's sticking to her training, but if this keeps up the upkeep costs are gonna throttle me!\nLook, if all else fails, find her an open-air training ground!",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1270,
      "atk": 440,
      "def": 267,
      "magicResistance": 0,
      "blockCnt": 1,
      "baseAttackTime": 0.93,
      "respawnTime": 18,
      "cost": 10
    }
  },
  "skins": [
    {
      "skinId": "char_1029_yato2#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_1029_yato2",
      "portraitId": "char_1029_yato2_1",
      "illustId": "illust_char_1029_yato2_1",
      "modelName": "Kirin R Yato",
      "drawerList": [
        "一千"
      ],
      "description": "Yato obtained this in a chance encounter in Higashi.\nMade from materials obtained from the Phantom Beast Kirin, a creature from another world, and imbued with the power of thunder.",
      "rarity": -50
    },
    {
      "skinId": "char_1029_yato2#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_1029_yato2_2",
      "portraitId": "char_1029_yato2_2",
      "illustId": "illust_char_1029_yato2_2",
      "modelName": "Kirin R Yato",
      "drawerList": [
        "一千"
      ],
      "description": "A white flash cuts through the attack. The dual blades send lightning to all four corners.\nShe charges towards the night like the thunder, as she always has.",
      "rarity": -10
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 762,
            "atk": 218,
            "def": 143,
            "magicResistance": 0,
            "cost": 8,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 0.93,
            "respawnTime": 18,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1016,
            "atk": 321,
            "def": 205,
            "magicResistance": 0,
            "cost": 8,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 0.93,
            "respawnTime": 18,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1016,
            "atk": 321,
            "def": 205,
            "magicResistance": 0,
            "cost": 10,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 0.93,
            "respawnTime": 18,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1270,
            "atk": 440,
            "def": 267,
            "magicResistance": 0,
            "cost": 10,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 0.93,
            "respawnTime": 18,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3281",
          "count": 5,
          "type": "MATERIAL",
          "name": "Specialist Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_SPC1"
        },
        {
          "id": "30062",
          "count": 5,
          "type": "MATERIAL",
          "name": "Device",
          "rarity": 2,
          "iconId": "MTL_SL_BOSS2"
        },
        {
          "id": "30032",
          "count": 5,
          "type": "MATERIAL",
          "name": "Polyester",
          "rarity": 2,
          "iconId": "MTL_SL_RUSH2"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1270,
            "atk": 440,
            "def": 267,
            "magicResistance": 0,
            "cost": 10,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 0.93,
            "respawnTime": 18,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 1629,
            "atk": 565,
            "def": 318,
            "magicResistance": 0,
            "cost": 10,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 0.93,
            "respawnTime": 18,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3283",
          "count": 4,
          "type": "MATERIAL",
          "name": "Specialist Dualchip",
          "rarity": 5,
          "iconId": "MTL_ASC_SPC3"
        },
        {
          "id": "30155",
          "count": 3,
          "type": "MATERIAL",
          "name": "Nucleic Crystal Sinter",
          "rarity": 5,
          "iconId": "MTL_SL_SHJ"
        },
        {
          "id": "30054",
          "count": 6,
          "type": "MATERIAL",
          "name": "Keton Colloid",
          "rarity": 4,
          "iconId": "MTL_SL_KETONE4"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_yato2_1",
      "skillName": "Demon Mode",
      "desc": "ASPD <@ba.vup>+{attack_speed}</>, attacks hit <@ba.vup>2 times</>, and every third attack on the same target while the skill is active becomes a <@ba.vup>6-hit combo</>",
      "iconId": "skchr_yato2_1",
      "spCost": 0,
      "initSp": 0,
      "duration": 20,
      "blackboard": [
        {
          "key": "attack_speed",
          "value": 100
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31053",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_yato2_2",
      "skillName": "Blade Dance",
      "desc": "Talent 1 effect increased to <@ba.vup>{talent_scale_display:0.0}</>x, ATK increased to <@ba.vup>{atk_scale:0%}</>, and slashes all enemies in the frontal tile 16 times. <@ba.vdown>More likely to be targeted by attacks for the duration</>",
      "iconId": "skchr_yato2_2",
      "spCost": 0,
      "initSp": 0,
      "duration": -1,
      "blackboard": [
        {
          "key": "talent_scale",
          "value": 3.75
        },
        {
          "key": "atk_scale",
          "value": 1.5
        },
        {
          "key": "taunt_level",
          "value": 1
        },
        {
          "key": "talent_scale_display",
          "value": 2.5
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31013",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 9,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_yato2_3",
      "skillName": "Midair Spinning Blade Dance",
      "desc": "Rushes forward 2 tiles, slashing all surrounding enemies for <@ba.vup>{atk_scale:0%}</> ATK for every step moved; every enemy attacked in the process <@ba.vup>extends</> distance of the rush (max. 5 tiles, <@ba.vup>can hit aerial units</>)",
      "iconId": "skchr_yato2_3",
      "spCost": 0,
      "initSp": 0,
      "duration": -1,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 3
        },
        {
          "key": "min_dist",
          "value": 2
        },
        {
          "key": "max_dist",
          "value": 5
        },
        {
          "key": "dist_interval",
          "value": 0.2
        },
        {
          "key": "dist_unit",
          "value": 0.3
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30013",
              "count": 9,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30155",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_yato2",
      "moduleName": "Kirin R Yato's Badge",
      "desc": "Outfitted with a custom-craft kit, Operator Yato has demonstrated a remarkable aptitude in repeated battlefield penetration.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Specialist Operator during field operations to exercise Executor responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_yato2",
      "moduleName": "Training Dummy",
      "desc": "I hate the wooden dummy.\nIt's too big, too heavy, doesn't change in any way, and can't move on its own. No matter how you slash at it, it never hits back. As a training prop, it's stupidly ineffective, and doesn't fit most training purposes. They should throw anything with that little practical value straight in a trash bin.\nStop laughing. Believe me, inefficiency sickens me more than anyone else sitting here. Yes, I train on a wooden dummy every day, but I've had enough of even seeing it.\nOn the day I first wielded a katana, my first training target was half of a gigantic wooden dummy, taller than I was, so wide I couldn't pick it up. The grounds were covered in snow. They put the dummy dead center, in conditions where your only option for keeping your body temperature up was to brandish your katana as fiercely as you could. The order they gave me was that I wasn't allowed back inside to warm up by the heater until I cut it in half.\nThat day, I shattered six katanas, and cut through eight dummies.\nSince then, practically every day, I've faced off with my katana against dummy after dummy, throwing in the next once I've cut the last one to pieces. I still have the habit today.\nYou're sharp. Yes, it was 'practically' every day, and that's because I did stop once. Not long after I joined Rhodes Island, after participating in my first field mission.\nJust like you, I was hungry for victory on my first mission, but during it we hit an enormous snag. We were facing off against a highly experienced Caster. He was small, and with others covering for him, he was casting Arts like a ghost. We could barely put up a fight against it, and my katana couldn't threaten him in the slightest.\nIt was a painful defeat we swallowed. I was bitter about it as I came back, blaming my blade's helplessness for our loss. So I abandoned my routine, and spent the whole night reviewing recordings and deriving strategies to deal with the Caster's every move. Once I thought I was ready, I stowed away my katana, and took along a huge collection of new weapons to confront the Caster alone.\nBut in the end, I was defeated. It wasn't because my strategies were flawed, or because those new weapons were ineffective on him. It was because I hadn't spent nearly enough time training those strategies or using those weapons. All I did was assume it'd work, watch the recordings a few times, and head off for battle. Reality proved that hopelessly inefficient, and with a large chance of failure.\nAfter I came back, I restored the wooden dummy and began my routine again. It was just a plain dummy, and though I was sick of it, it was able to support me as I drilled my fundamentals and trained newly imagined moves, and that was enough.\nEveryone sitting here is an excellent operator about to take part in their first field mission. As Op Team A4 Captain, I, Yato, warn you all: never stop polishing your skills. That's the one and only path to high efficiency. Acting on assumptions is undesirable. Anything can happen on a fluke, but luck won't always have your back.\nA wooden dummy, a target, a mannequin, anything... smash it to pieces, and never stop. That's what you should be doing.\nAlright, I'm done... anything else?\nOh? You looked up the mission log? That's right, I did take out that Caster in the end.\nI said I failed—I did fail, with those new weapons. In the end, my final plan to settle things was to pull out my katana again, and with the most fleeting of chances, I slashed like I was slashing a dummy.\nAnd I cut that Caster down. End of story."
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "I'm to assist you? One moment, then. I'll go and change into more appropriate uniform... What? No need?",
      "voiceAsset": "char_1029_yato2/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "I'll be honest, even now I'm not used to life with my mask off—it always feels like there's something missing from my face. Still, it seems I can operate freely in daylight now. Please, give me more daytime missions, Doctor.",
      "voiceAsset": "char_1029_yato2/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "The combat style the Felynes have taught me is like nothing I've known before. Unbroken strings of attacks as a defense, swift evasive maneuvers, different styles combining to achieve completely differing effects... Even though I've been training day and night, I still can't say I've mastered it.",
      "voiceAsset": "char_1029_yato2/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "These clothes have your attention, Doctor? They confused me just as much when I first put them on—they have a startling defensive capacity, despite their obvious design. How it's achieved is completely beyond me.",
      "voiceAsset": "char_1029_yato2/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "There's a strange force in these dual blades. They attack with thunder, but without the use of Arts... Is it the materials that cause it? I was definitely more proficient with my old katana... but when it comes to protecting us all, I'll shy away from no weapon.",
      "voiceAsset": "char_1029_yato2/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "The Felynes never cease to mention monsters even more fearsome than Rathalos—the kind that could bring about Catastrophe-scale disasters with the flap of a wing. If Rhodes Island ever faced such a threat... no. After all we've been through, I wouldn't fear an enemy like that anymore.",
      "voiceAsset": "char_1029_yato2/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Though I've changed my loadout and gained new skills, I'm still the same Yato you know. Just give the order, and I'll take on whatever role Rhodes Island needs of me, Doctor.",
      "voiceAsset": "char_1029_yato2/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Noir Corne's always been this way, fussing over minor details, dragging down the mission. Still, I admit he's occasionally helpful... okay, a little more than occasionally. The point is, I don't hate him.",
      "voiceAsset": "char_1029_yato2/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "Operators are often worried about the way I do things, wondering if I'm putting myself in harm's way. Honestly, the concern's unnecessary. Thinking too much on my situation would only slow me down, but when it comes to what my friends are going through, trust me, I will care.",
      "voiceAsset": "char_1029_yato2/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "It seems you need some rest, Doctor. You can try this, if you want. It's a Felyne blend of a remedial plant they call Sleep Herb and some kind of mushroom. I hear it works very well, sleep-wise.",
      "voiceAsset": "char_1029_yato2/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Hey, Doctor. That's right, it's me. Op Team A4 Captain Yato, back and reporting in. As for where I got all this new equipment, you have the whole story from me in the mission debrief.",
      "voiceAsset": "char_1029_yato2/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "Hold on, I had notes on the locale. Let me find them...",
      "voiceAsset": "char_1029_yato2/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "Whatever role I'm in, I'll bring everything I have.",
      "voiceAsset": "char_1029_yato2/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "Another medal for me? I'd love to wear them, but I don't think this outfit has anywhere for them to go. Still, thank you, Doctor.",
      "voiceAsset": "char_1029_yato2/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Leave it to me, Doctor.",
      "voiceAsset": "char_1029_yato2/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Alright, it's in my hands now. The success of our mission is assured.",
      "voiceAsset": "char_1029_yato2/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Target confirmed. They won't know what hit them.",
      "voiceAsset": "char_1029_yato2/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Op Team A4 Yato in position.",
      "voiceAsset": "char_1029_yato2/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Standing by…",
      "voiceAsset": "char_1029_yato2/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Finally, am I up?",
      "voiceAsset": "char_1029_yato2/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Engaging.",
      "voiceAsset": "char_1029_yato2/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "So that's our target?",
      "voiceAsset": "char_1029_yato2/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Hnf! Haah!",
      "voiceAsset": "char_1029_yato2/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "That all you got?",
      "voiceAsset": "char_1029_yato2/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Flurry!",
      "voiceAsset": "char_1029_yato2/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Fight or flee, it's no use!",
      "voiceAsset": "char_1029_yato2/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "We owe this victory to your fine command. I still have a long way to go.",
      "voiceAsset": "char_1029_yato2/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Take victory as a whetstone to hone the cutting edge.",
      "voiceAsset": "char_1029_yato2/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Was this your mercy? Understood.",
      "voiceAsset": "char_1029_yato2/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "This falls on me. You make a retreat, and grant me one more attempt.",
      "voiceAsset": "char_1029_yato2/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "I'd like more dangerous or challenging work, but if these are your orders, I'll gladly accept, Doctor.",
      "voiceAsset": "char_1029_yato2/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "What is it, Doctor? Intrigued by the materials for this outfit?",
      "voiceAsset": "char_1029_yato2/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Oh, hey, Doctor. I guess I'm not used to dropping the mask after all.",
      "voiceAsset": "char_1029_yato2/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_1029_yato2/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Hey, Doctor. You're the same as ever. I wonder if I'm any better than I used to be?",
      "voiceAsset": "char_1029_yato2/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "control_mp_cost&bd2[010]",
      "buffName": "Endurance Recovery",
      "desc": "When this Operator is assigned to the Control Center, self Morale loss per hour <@cc.vdown>+0.5</>, <$cc.bd_felyne><@cc.rem>Felvine</></> <@cc.vup>+8</>",
      "skillIcon": "bskill_ctrl_cost_felyne",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "control_token_prod_spd2[000]",
      "buffName": "Leading By Example",
      "desc": "When this Operator is assigned together with other <$cc.tag.mh><@cc.kw>Soubo Adventurers</></> Operators to the Control Center, all Factories' productivity <@cc.vup>+2%</> (Only the strongest effect of this type takes place)",
      "skillIcon": "bskill_ctrl_token_p_spd2",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}