{
  "id": "char_300_phenxi",
  "meta_info": {
    "name": "Fiammetta",
    "appellation": " ",
    "voiceActor": {
      "en": "Ina Marie Smith",
      "jp": "Fumiko Orikasa",
      "kr": "Kim Bo-na",
      "cn": "Xiaowen Xu"
    },
    "rarity": 6,
    "profession": "Sniper",
    "subProfessionId": "Artilleryman",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "DPS"
    ],
    "nationId": "Laterano",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Fiammetta\n[Gender] Female\n[Combat Experience] 4 Years\n[Place of Birth] Laterano\n[Date of Birth] Apr 3\n[Race] Liberi\n[Height] 171cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Standard\n[Mobility] Excellent\n[Physical Resilience] Excellent\n[Tactical Acumen] Standard\n[Combat Skill] Excellent\n[Originium Arts Assimilation] Standard",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Fiammetta is a senior special correspondent of the Lateran Notarial Hall. At her request, her job title will be withheld here. She currently provides Rhodes Island with relevant services while receiving provisions from Rhodes Island in accordance with our cooperation agreement with the Lateran Church.\nApocalypse Punisher? And this is gonna get updated every month, too? If I'm supposed to add this stuff to the terminal archives, you might as well kill me now.\n— HR Operator",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Fiammetta shows no signs of Originium Infection.\n\n[Blood Originium-Crystal Density] 0.12u/L\nOperator Fiammetta frequently ventures into dangerous environments with her coworker, camping in ruins or the barrenlands. Thankfully, she is in excellent physical condition. Perhaps she could take some time off for a holiday to improve her mental health, too.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "As everyone knows, Operator Fiammetta can often be found working with Mostima. She claims to be Mostima's overseer and that she is in charge of making sure Mostima does not leak any critical confidential information about Laterano as she liaises with the outside world. However, we have observed that not all Apostolic Nuncios working outside Laterano have such an 'overseer' assigned to them. There is reason to believe that Fiammetta and Mostima's team-up is an exception rather than the norm, and there is no doubt that this has to do with Mostima's status as an fallen angel.\nThat said, Mostima alone is in charge of all the formal diplomatic responsibilities assigned to her as a Nuncio. As the 'overseer', Fiammetta never participates in the negotiations or discussions, instead standing by outside the venue. It seems her only diplomatic role is to demonstrate through her identity that the Sankta with horns can be trusted. Their relationship may be more complicated and ambiguous than the 'superior and subordinate' and 'overseer and executor' they appear on the surface. In her Operator tests, Fiammetta demonstrated impressive combat abilities and mobility. Considering Mostima's extraordinary destructive power, we cannot help but wonder what sort of diplomatic missions require the participation of members such as these.\nWhen questioned further by HR about her responsibilities at the Notarial Hall, Fiammetta refused to answer on the grounds of papal confidentiality.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Workshop Use Logs:\nA couple days ago, Fiammetta brought a Sankta firearm here and asked us to help repair it. It's not one of her two weapons registered as standard equipment, but her knowledge in firearms was really beyond my expectations. Personally, I'm not very fond of guns, but Fiammetta understood its structure, principles, and how to wield it like the back of her hand. Where'd a Liberi learn all that? With how knowledgeable she was, I wouldn't have been surprised if she'd picked it up and shot down three practice target drones right then and there. Of course, it's also nothing more than knowledge. It's obvious that she can't actually use a Sankta firearm in battle. As to where the gun came from, Fiammetta said it was entrusted to her by someone. She also said something pretty ominous about how this is a kind of 'price' that he would have to trade his life for. I didn't want to dig too deep into that. Everyone's got their obsessions.\nWhat's really messed up, though, is that I know this gun. Back when I studied in Laterano all those years ago, I read about it in a book. This is a heritage gun. Or at the least, a very fine replica of one. I can't say for sure. It's been maintained very well. There's a high chance that the internal parts have been replaced before, but it likely isn't used very often.\nThe gun's original owner was very famous. If this is this real deal, it was once held by the saints themselves. The saint that wielded it was known for his generosity and piety. It was supposed to be sealed away under the Lateran Basilica after he passed away, but its whereabouts have been unknown ever since for whatever reasons. Until today, that is. Assuming it's real, I can't fathom how its owner found this old boy, or how Fiammetta got her hands on it, but I feel compelled to at least leave this on record.\nI just hope this isn't some kind of stolen artifact, since it definitely belongs in a museum.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'Old friend, we agree with your opinion. Now that it has come to this, there is indeed very little chance of salvaging the situation. My intention was to simply give her an opportunity to hone her Arts and to get some achievements under her belt. That way, she would at least have some sway in the future and our two braindead colleagues would shut up. None of us could have predicted that incident, or her choices afterwards, but I still think you're a little too worried nonetheless. This isn't necessarily a bad thing. We were never going to be able to keep an eye on her forever.\nI still support Lemuen's proposal of dispatching her to the pharmaceutical company. She's proven over the last several years that she can take care of most things herself. The best way to assuage your worries would be to give her greater support and a reliable guardian angel. Don't forget. She overcame her racial handicap and became a Gun-Knight candidate solely because she's one of our finest students. We should trust in her, and I hope you can reconsider and retract your opinion.\nYou should rejoice. We would've let her parents down if she'd grown up the way Laterano had intended. We must repay that favor, of course, but not this way. Give her time. She will surprise us both. We're old, and she's still young.\nAlso, you should pick her next codename. Something badass. Show Lemuen who's boss when it comes to picking names.'\nThis letter, written on a particularly dignified-looking sheet of paper, was found in the large stack of Lateran Church–Rhodes Island paperwork. It was unsigned.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "From Fiammetta's infrequent mentions of the fallen angel incident and the clues we obtained via other channels, we have managed to piece together a decent picture of what happened during that operation.\nThe elite squad she belonged to was sent to carry out a cleanup mission, aiming to deal with the Sarkaz bandits that had been repeatedly ambushing Sankta caravans. Consisting of four of Laterano's elites, this tactical squad should've easily completed its objective. They followed the trail left behind by the bandits and tracked them down to the remnants of a building. The bandits were clearly using the ruins as a bunker, or perhaps some kind of defensive structure. Yet the team was unable to find any sign of the enemy there. The place was much more eerie than they expected. There were a large number of corpses present, at various stages of decay. The bodies were all in front of a sealed door, as though they came seeking something, only to never find the answer they sought. The deceased were of different races, ages, and even eras, but they all had one thing in common. In Fiammetta's words, 'They were all frozen in their own moment in time.'\nThere isn't a reliable report as to what happened afterwards. Fiammetta herself claims to have left the scene because of a fake transmission—later found to be a trap set by the bandits—and therefore wasn't present at the crucial moment when events unfolded. What we do know is that squad member Lemuen was bedridden in the hospital until recently, while Mostima became a fallen angel and left Laterano, followed by Fiammetta herself. Relevant intelligence suggests that the squad was led by a Sankta named Andoain at the time, but no information on such a person is contained in any official Lateran documents.\n[Classified Log]\nThere is a rumor that once circulated among the gossip peddlers of Kazdel: somewhere in the barrenlands, there is someone who has exceptional insight into the past and future. His forbidden power and knowledge can guide you beyond the door of the truth, so long as you can pay the price.\nAfter a certain point, this rumor abruptly stopped being spread. Evidence suggests that its source was very likely a certain Sarkaz gang that was suddenly annihilated.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Fiammetta seems to be weirdly hostile towards certain kinds of movies, especially the high budget, totally rotten flicks made in Wrankwood. The selling point of these movies are the pretentious titles, the excessive explosions, and 'Under 17 requires accompanying parent or adult guardian.' At a classic movie night held by Nian, Lava, and Robin, Fiammetta—who was just passing by—had some really strong criticisms and unkind words for these movies. Still, it was pretty obvious from the conversation that she had a deep understanding of the genre and had seen an impressive number of films. Her disdainful insight into these trashy films is on another level. She could be complaining about how this kind of cultural filth is having an immeasurable negative influence on people's taste one minute, then reciting classic movie lines the next. She's even got a pretty amazing repertoire of villain quotes.\nThat said, she ultimately refused Lava's invitation to become the movie lover group's special commentator.\nIt doesn't matter whether she admits it or not, she knows her stuff.\n—Lava",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1540,
      "atk": 671,
      "def": 132,
      "magicResistance": 0,
      "blockCnt": 1,
      "baseAttackTime": 2.8,
      "respawnTime": 70,
      "cost": 29
    }
  },
  "skins": [
    {
      "skinId": "char_300_phenxi#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_300_phenxi",
      "portraitId": "char_300_phenxi_1",
      "illustId": "illust_char_300_phenxi_1",
      "modelName": "Fiammetta",
      "drawerList": [
        "幻象黑兔"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_300_phenxi#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_300_phenxi_2",
      "portraitId": "char_300_phenxi_2",
      "illustId": "illust_char_300_phenxi_2",
      "modelName": "Fiammetta",
      "drawerList": [
        "幻象黑兔"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_300_phenxi@witch#4",
      "skinName": "Divine Oath",
      "skinGroupName": "Witch Feast/IV",
      "skinGroupId": "2023#witch",
      "avatarId": "char_300_phenxi_witch#4",
      "portraitId": "char_300_phenxi_witch#4",
      "illustId": "illust_char_300_phenxi_witch#4",
      "modelName": "Fiammetta",
      "drawerList": [
        "三目YYB"
      ],
      "description": "<color name=#ffffff>Witch Feast Role-Playing Script 'Dominions & Dogma' Custom Line/Divine Oath. This player shall be the apostolic knight who takes charge in times of crisis. She is the crimson fury spilling forth from the Holy Spirit's palm, bearing the eternal burden of seeking the land of salvation.</color>",
      "rarity": 108
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "3-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 985,
            "atk": 375,
            "def": 80,
            "magicResistance": 0,
            "cost": 25,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1232,
            "atk": 536,
            "def": 104,
            "magicResistance": 0,
            "cost": 25,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "3-8",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1232,
            "atk": 536,
            "def": 104,
            "magicResistance": 0,
            "cost": 27,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1540,
            "atk": 671,
            "def": 132,
            "magicResistance": 0,
            "cost": 27,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3241",
          "count": 5,
          "type": "MATERIAL",
          "name": "Sniper Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_SNP1"
        },
        {
          "id": "30062",
          "count": 6,
          "type": "MATERIAL",
          "name": "Device",
          "rarity": 2,
          "iconId": "MTL_SL_BOSS2"
        },
        {
          "id": "30022",
          "count": 4,
          "type": "MATERIAL",
          "name": "Sugar",
          "rarity": 2,
          "iconId": "MTL_SL_STRG2"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "3-10",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1540,
            "atk": 671,
            "def": 132,
            "magicResistance": 0,
            "cost": 29,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 1926,
            "atk": 861,
            "def": 156,
            "magicResistance": 0,
            "cost": 29,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3243",
          "count": 4,
          "type": "MATERIAL",
          "name": "Sniper Dualchip",
          "rarity": 5,
          "iconId": "MTL_ASC_SNP3"
        },
        {
          "id": "30145",
          "count": 3,
          "type": "MATERIAL",
          "name": "Crystalline Electronic Unit",
          "rarity": 5,
          "iconId": "MTL_SL_OEU"
        },
        {
          "id": "30094",
          "count": 6,
          "type": "MATERIAL",
          "name": "Grindstone Pentahydrate",
          "rarity": 4,
          "iconId": "MTL_SL_PG2"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_phenxi_1",
      "skillName": "'Provocate'",
      "desc": "Attack range <@ba.vup>+{ability_range_forward_extend}</>, ATK <@ba.vup>+{atk:0%}</>",
      "iconId": "skchr_phenxi_1",
      "spCost": 10,
      "initSp": 5,
      "duration": 30,
      "blackboard": [
        {
          "key": "atk",
          "value": 1
        },
        {
          "key": "ability_range_forward_extend",
          "value": 1
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30073",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_phenxi_2",
      "skillName": "'Paenitete'",
      "desc": "Fires scorching bullets that leave incendiary marks at fixed distances as they travel. The bullets explode upon reaching maximum attack range, dealing <@ba.vup>{atk_scale:0%}</> Physical Damage and causing incendiary marks to explode in sequence, dealing <@ba.vup>{atk_scale_2:0%}</> Physical Damage",
      "iconId": "skchr_phenxi_2",
      "spCost": 7,
      "initSp": 0,
      "duration": 0,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 4
        },
        {
          "key": "atk_scale_2",
          "value": 2
        },
        {
          "key": "dist",
          "value": 0.66
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30083",
              "count": 9,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_phenxi_3",
      "skillName": "'Reponite'",
      "desc": "Continuously barrages a fixed area in front of this unit at max range, <@ba.vup>expanding</> explosion area and increasing ATK to <@ba.vup>{attack@atk_scale_2:0%}</>. Enemies closer to the impact site in a smaller area will instead take <@ba.vup>{attack@atk_scale:0%}</> ATK as damage. \n<@ba.rem>Unlimited duration, can manually deactivate skill</>",
      "iconId": "skchr_phenxi_3",
      "spCost": 15,
      "initSp": 0,
      "duration": -1,
      "blackboard": [
        {
          "key": "attack@atk_scale",
          "value": 2.2
        },
        {
          "key": "base_attack_time",
          "value": 0
        },
        {
          "key": "attack@dist",
          "value": 1.1
        },
        {
          "key": "attack@atk_scale_2",
          "value": 1.25
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31013",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_phenxi",
      "moduleName": "Fiammetta's Badge",
      "desc": "Operator Fiammetta has demonstrated a remarkable aptitude for inflicting physical casualties on multitudes of enemies.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Sniper Operator during field operations to exercise Artilleryman responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_phenxi",
      "moduleName": "'Out-Law' Special Ammunition Surplus",
      "desc": "It was a beautifully sunny afternoon years past, when the old man pushed a box before the still-young Liberi girl.\nShe hadn't even had time to wipe the soot off her face. She'd never had the finest control over firearms, though the Sankta her age used guns as naturally as their own limbs.\n'Fia. I'm not going to say 'it's just a racial gulf' or whatever to try to comfort you, and I'm not going to proclaim that wielding guns is a Sankta-exclusive glory, like SOME cardinals. Practice will yield results, and you've as good as brushed shoulders with those results, even if it's not gone how you'd want.'\n'But there's still a different way, or maybe you could say a different TOOL that could help you move forward. This box holds something one of my mechanics tutors left to me. He's not coming back to Laterano, ever. He violated the law.'\n'But, child, law is not our everything. Now don't look at me like that—yes, you might go 'big whoop,' but nobody would say our everything ends at food and water either, right? They're just things we're forced to rely on to survive. There's always something that transcends the law, sits beyond it, and everyone has a different idea of what it is. Some call it righteousness, some call it sensibility, and some call it a vague hope.'\n'Don't panic, and don't worry. There will be times when wanting to do something will make you unstoppable.'\n......\nThe Liberi is no longer a girl; she's been more places than can be imagined, and seen more sights than can be believed, but afternoons in Laterano will never change. The sun is as fine and beautiful as ever.\nThese two weapons have been by her side for longer than can be described; they have ensured her safety through danger, and mercilessly shot down the absurd aspirations of others.\nShe carefully cleans the grime from her old friends, oils them, inspects the pressure in every last piece of ammo, and affirms again and again their ordering by type. She'll soon face her pursuer, her enemy of eight years, and there's no such thing as being overly prepared.\nThere is always something that transcends the law.\nThere's no vengeance in her heart, and no pity either. Only this: what must be settled will be settled, and those who must bear the cost will pay the price. She understands—this is an obsession, nothing more.\nShe slots the final shell into her magazine."
    },
    {
      "moduleId": "uniequip_003_phenxi",
      "moduleName": "A Long Journey",
      "desc": "'Relax for once, Fiammetta. Look on the bright side... next time, we can report to Lemuen about our work.'\nVelliv's poring closely over the papers, but tosses the remark out anyway, like she can read her mind. Fiammetta sighs—this is what she hates about Velliv. The Sankta get in on each other's emotions thanks to their empathy, and she's no Sankta, but she's never felt like Velliv couldn't see straight through her anyway.\nVelliv abruptly lifts her head, as if some thought has struck, and looks at her.\n'Speaking of which, Fiammetta, now's your chance.'\n'What?'\n'At independence.'\n'......'\n'The team you and Mostima had going was a real exception, organizationally speaking—basically a custom set-up just for you two, not much flexibility. But now that Lemuen's joining, we've gotta shake up how it's structured. Perfect opportunity.'\nVelliv interlaces her fingers, props her chin up, and throws her a sunny grin.\n'Who's saying this? Her? Lemuen? His Holiness? Or is it just you?'\n'I'm not the type to stick my neck out. But it's not something I <i>haven't</i> thought about, you know.' She stoops down to pull a document out from the cupboard by her foot, which Fiammetta knows at a glance is the file on Andoain. 'After the incident at the Summit of Nations, they upped the risk level on Andoain a notch. If there was any hunter out there willing to devote her heart and soul to catching him, I'd sleep better at night for it.'\n'Sometimes, I wish other Laterans would care for Laterano as much as you do.' It's not a lie. Even on the work front, Fiammetta considers Velliv an admirable example.\n'So, what do you say?'\n'I refuse.'\n'Why? There's way more efficient ways to capture Andoain than working alongside Mostima, you know that.'\n'It's because Mostima's worse.'\n'Worse as in... Andoain's always gonna be there, but Mostima's the woman who might just vanish without a trace one day?'\n'No. I haven't heard her actually speak her mind even once since His Holiness gave her her mission. I don't care if it feels like I'm the only idiot still clinging to the whole Andoain thing, and I don't blame her or Lemuen for having other ideas. <i>But,</i>' and she speaks that 'but' like she tore it off and spat it out, 'whatever she saw in that staff, whatever she's thinking, whatever the hell it is Lemuen forgives or pardons Andoain for—she can tell me, Lemuen can tell me, but they have to tell me <i>something.</i> They have to tell me everything... they owe me that much.'\n'And what if they never ever tell you?'\n'I can wait. As long as I'm their friend, as long as they're my friends.'\n'I see. Well... it's looking to be a real long road, then.'\n'Way ahead of you.'"
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "Stay sharp. Focus, finish your work. If everyone could just get their own work done, it might as well not help at all, but it's not going to make anything worse either. Lecturing? Who am I to lecture you, I'm just... reminding myself.",
      "voiceAsset": "char_300_phenxi/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Whatever it is you want, it can wait until I get my hands on Mostima! It has to be that damn idiot who spiked my finballs with chili! Get to the side and make sure you stay there, this day's not done until I put a bolt in her—",
      "voiceAsset": "char_300_phenxi/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "I tried using guns before, but it didn't pan out, so I gave up. What, are you surprised? Guns aren't some huge mystery, but they need practice... and maybe you practice until you're smooth, or you blow yourself up in a burst.",
      "voiceAsset": "char_300_phenxi/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "If it's deemed necessary, taking measures to block intel leakage is part of my work. ...Hey, stop staring at my back! Those idiots at the Notarial stuck those wing stickers there, they're not coming off! *cough* Anyway, don't count on me telling you anything. Keeping secrets is my job.",
      "voiceAsset": "char_300_phenxi/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "Too much curiosity's never good. That goes for Lemuen's sister, and it goes for you too, Doctor. Am I worried about you? ...Hardly. I'm just tasked with making sure *someone* doesn't leak secrets or make trouble, and anything else is beyond my care.",
      "voiceAsset": "char_300_phenxi/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "I've been to plenty of nations before. It's not like nowhere moves me more than Laterano, but I'm all too clear about what I have to do right now. I've got no intent of letting anybody harm this city of Laterano. There's no more answers I need to seek from anyone.",
      "voiceAsset": "char_300_phenxi/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "...Don't call me 'Suffering.' And don't call me 'Chosen Overseer' or 'Flaming Envoy' either! That's it, no matter what that Mostima-on-low told you, I want you to forget all of it right now! Immediately! On the double!",
      "voiceAsset": "char_300_phenxi/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Thanks to a certain *someone*, I couldn't be more familiar with all the food streets around. I seriously don't know what's so good about this place. See the shooting gallery at the entrance? I could hit their targets from the roof of the skyscraper opposite. You want me to bring you along next time? ...I'll consider it.",
      "voiceAsset": "char_300_phenxi/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "Can people really cut everything loose without looking back, even shatter the order that was there, all to chase ideals? That's a dedication that... I can comprehend, but can't identify with. I know you all have your own beliefs at Rhodes Island, too. Here's hoping we don't come into direct conflict one day, Doctor.",
      "voiceAsset": "char_300_phenxi/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Beats me how you sleep while standing up... and you even look pretty normal. It's a cut above everyone back then who sneaked naps in class.",
      "voiceAsset": "char_300_phenxi/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "My duty's to monitor Mostima, so I'll be acting alongside her here, if you don't mind. You need a codename? ...Just call me Fiammetta. I've had enough of those codenames my bosses keep giving me.",
      "voiceAsset": "char_300_phenxi/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "Keeping battle records is a pretty good habit.",
      "voiceAsset": "char_300_phenxi/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "A promotion? Let me get this out of the way—this is my chance to use my own name, and you *cannot* give me any more weird job titles.",
      "voiceAsset": "char_300_phenxi/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "Laterano code says whoever breaks it, pays for it, but reasonable loss of property in missions can be expensed. You order my actions, thus compensation fees naturally land with you too... what? You can't be regretting it now.",
      "voiceAsset": "char_300_phenxi/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Less dawdling, come on.",
      "voiceAsset": "char_300_phenxi/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Fine. But I'm not waiting for anyone who falls behind.",
      "voiceAsset": "char_300_phenxi/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "We're heading up. It'll be faster by rooftop.",
      "voiceAsset": "char_300_phenxi/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Don't make too big of a show.",
      "voiceAsset": "char_300_phenxi/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Sights locked.",
      "voiceAsset": "char_300_phenxi/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Boring.",
      "voiceAsset": "char_300_phenxi/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "I only do what I need to.",
      "voiceAsset": "char_300_phenxi/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "What, you've got time to take in the sights?",
      "voiceAsset": "char_300_phenxi/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Anyone in front of me who still feels like blinking?",
      "voiceAsset": "char_300_phenxi/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Sorry, forgot to hold that back.",
      "voiceAsset": "char_300_phenxi/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "I don't like damage—unless it's necessary.",
      "voiceAsset": "char_300_phenxi/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "There's no fluking between success and failure.",
      "voiceAsset": "char_300_phenxi/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "You did a better job than I imagined. The feeling of fighting in a squad... it's been a long time.",
      "voiceAsset": "char_300_phenxi/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Mission complete. Look, this much is granted—don't make a fuss over nothing.",
      "voiceAsset": "char_300_phenxi/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "If you're fine, we're fine. If something happened to you while I was on the job, I know *someone* would be laughing at me.",
      "voiceAsset": "char_300_phenxi/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Sorry, I was careless this time. I'll remedy it somehow.",
      "voiceAsset": "char_300_phenxi/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Ventilation's fine, visibility's excellent. Good, that's conducive to getting my work done.",
      "voiceAsset": "char_300_phenxi/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Don't touch that. It'll explode.",
      "voiceAsset": "char_300_phenxi/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Doctor... is that your job title? How normal. How nice.",
      "voiceAsset": "char_300_phenxi/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_300_phenxi/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Ever since I took on the task of monitoring Mostima, I've hardly gotten the chance to stop anywhere for long. I adapted to the runabout lifestyle a while ago, but having somewhere I can just take a breather on a day like this, it's nice. Happy New Year, Doctor.",
      "voiceAsset": "char_300_phenxi/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Same old, then?",
      "voiceAsset": "char_300_phenxi/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "About that food street I mentioned. You wanna go check it out? I've never seen you use a firearm before, so we can just play by the rules at that shooting gallery. You want to see me hit their targets from the roof of a skyscraper? Ugh, I shouldn't have told you that... Fine, today's your birthday. Special exception!",
      "voiceAsset": "char_300_phenxi/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": " 'Fluffy Top Buns?' Mostima you little... There was this Sankta kid who didn't know Liberi have ear plumage, so he thought my hair was— you know, buns. And thanks to another superior of mine playing eavesdropper, I got saddled with the name for a full month! No, you're NOT allowed to laugh!",
      "voiceAsset": "char_300_phenxi/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "dorm_recExcludeOther[000]",
      "buffName": "Self-Discipline",
      "desc": "When this Operator is assigned to a Dormitory, self Morale recovered <@cc.vup>+2</> per hour, and <@cc.vdown>cannot gain</> Morale recovery from any other source.",
      "skillIcon": "bskill_dorm_reborn",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "dorm_exchangeAp[000]",
      "buffName": "Communal Suffering",
      "desc": "When this Operator is assigned to a Dormitory, if this unit has <@cc.kw>Full Morale</>, swaps Morale with the <@cc.kw>previous</> Operator assigned to that Dormitory.",
      "skillIcon": "bskill_dorm_exchangeAp",
      "phase": "PHASE_0",
      "level": 1
    }
  ],
  "patch_info": {}
}