{
  "id": "char_466_qanik",
  "meta_info": {
    "name": "Qanipalaat",
    "appellation": " ",
    "voiceActor": {
      "en": "Kim Kasin",
      "jp": "GEN SATO",
      "kr": "Seok Seung-hoon",
      "cn": "Tongming Zhang"
    },
    "rarity": 5,
    "profession": "Caster",
    "subProfessionId": "Core Caster",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "DPS",
      "Crowd-Control"
    ],
    "nationId": "Sami",
    "isNotObtainable": false,
    "itemObtainApproach": "Voucher Exchange",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Qanipalaat\n[Gender] Male\n[Combat Experience] None\n[Place of Birth] Sami\n[Date of Birth] Dec 12\n[Race] Vulpo\n[Height] 169cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Standard\n[Mobility] Normal\n[Physical Resilience] Standard\n[Tactical Acumen] Standard\n[Combat Skill] Normal\n[Originium Arts Assimilation] Excellent",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Operator Qanipalaat has extensive experience in wilderness rescue, having functioned on a search and rescue team in the Sami region. Born to a Sami tribe, he knew very little about the outside world and left Sami in search of a higher standard of medical care. He now works as a field operator for Rhodes Island, supporting operations in extreme environments.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, the operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Qanipalaat shows no signs of Originium infection.\n\n[Blood Originium-Crystal Density] 0.13u/L\nOperator Qanipalaat is in good health and much stronger than he appears. His previous living conditions saw Originium only lightly utilized. He has not contracted Oripathy from exposure to Originium.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Upon arrival at Rhodes Island, Qanipalaat found everything terribly foreign.\nAt first, operators assumed that Qanipalaat was uncomfortable because it was his first time at a large corporation, or because he was unfamiliar with and had trouble adjusting to tedious paperwork. It was after some admittedly hilarious incidents that they realized he really knew nothing of life outside of Sami. The most infamous one being the 'nightlong battle between Qanipalaat and the access card.' Legend has it that Qanipalaat, who had just been assigned a dormitory, spent the whole night looking for a 'keyhole' on the door to insert his access card into. No one knows what really happened, beyond that the next morning, the assigned roommate returned from an operation to find him squatting in the chilly corridor before the dormitory door. Following his helpless gaze, the roommate saw a now legendary sight: a piece of the access card embedded deeply into the door.\nUpon arriving at Rhodes Island, Qanipalaat was given a full set of custom-made modern equipment, which in theory would allow him to make the most of his Arts talent. But the reality is that Qanipalaat's staff is a stick-shaped melee weapon. He spent a while in the training room until the poor staff broke in two. This incident led to the postponement of a scheduled field operation. But after that, Qanipalaat learned to study the manual in advance and ask for advice from senior operators. Serious about his studies, he eventually became familiar with all his equipment, and began to undertake field missions as expected. Now, while he still occasionally struggles with deeply-ingrained habits and old ways of thinking, he has developed a knack for adapting to life in the outside world.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "One of Qanipalaat's favorite pastimes, when he's not out on a field op or caring for his mother, is sharing stories of his home with the Rhode Islanders.\nSami is an ancient and mysterious land, and the tales that come out of it draw curious ears. Whether describing the unique customs of his tribe or regaling the people with his stories of rescue operations, our operators love to hear Qanipalaat talk. But what they love most are the old Sami fables that he always seems to tell at exactly the right time.\nAfter an operation that went less than ideal, and facing operators who were less than happy with its outcome, Qanipalaat told the story of a Sami boy who, in order to cure his ailing mother, embarked on a journey in pursuit of a brilliant light in the night sky. He only knew that at the end of the journey, the light would lead him to a gigantic, mute spirit that would grant him the medicine to cure all disease. He trekked through the wind and snow, until he reached the end of his journey, where he found only desolate ice fields.\n'So he came up empty-handed? That's so sad,' an operator sighed.\n'Oh, but it isn't.'\nQanipalaat shared the end of the story: Although the boy never got to meet the spirit, he happened to pick the unremarkable flowers of the tundra. When he returned to his tribe, he discovered that it was the very herb to cure his mother.\n'As long as we press forward with bravery, even if the sky we find is not what we hoped, appearing unnoticed beneath our feet just might be exactly what we need.'\nFor Qanipalaat himself, his stories are more than a simple desire to share. He loves seeing the eyes of our operators shine with inspiration after hearing his tales. They give him a tangible sense of accomplishment, having done a service for others. After all, he has always worked hard to help people.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "The vast majority of the Sami tribespeople undergo a kind of divination known as tsoavttsom to get an idea of what the future may hold. Qanipalaat is no exception to this tradition. 'Guolldo.' The light showed that he would encounter tremendous difficulties and trudge through a lifetime of adversity.\nOf course, as with all forms of divination, tsoavttsom is never limited to just one interpretation.\nQanipalaat's tribe is located near a bog. He encountered a Colombian expedition when he was a child, and that contact made him aware of the fragility of life at too early an age. In the harsh, unfamiliar lands of Sami, countless ambitious explorers find themselves flash-frozen into snow-covered mounds. The loss of life made him sad, and when he was grown, Qanipalaat insisted on joining the tribe's search and rescue team, using their skills to help those in need. The explorers had told him a little about the world outside of Sami, and he believed it was a peaceful place, far less dangerous than Sami.\nAt the time, he could not know that not all dangers to life were so apparent. Coming face-to-face with the invisible threat known as disease left him feeling helpless for the first time. Originium Arts could only alleviate symptoms, and while he could save people from snow and wind, he could not stop disease from consuming lives. It wasn't until Colombian explorers brought advanced medical equipment that many of the tribe's illnesses were cured under the care of the doctors who accompanied them. Since then, Qanipalaat has become aware that people outside Sami also suffer under various threats. They have developed different medical treatments over the course of their long struggles, warding off disease with the benefit of their experience. If only the tribe could have such medical prowess, how wonderful! Qanipalaat had the idea to reach out to the outside world, and later, his mother's illness pushed him out of Sami.\n'Contribute to the outside world and bring medical technology back to the tribe.'\nThat was the idea with which Qanipalaat stepped out of Sami. And things really did play out that way. Since joining Rhodes Island, he has traveled back and forth between the tribe and the outside world, working toward a better future for both sides. In a sense, the divination was right. 'Guolldo,' the snowstorm, does loom over Qanipalaat's path. But he has always broken through the guolldo, to open the way and bring in hope.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Qanipalaat's tribe is a favorite base camp for Colombian explorers, not only because of its proximity to the mysterious northern mountains, but also because of the tribe's search and rescue team. They are a group of warriors who battle against the dangers of nature, and with their knowledge of the ancient lands beneath their feet, they have rescued many imperiled explorers. To the northern explorers, the SAR team became a beacon of hope.\nBut that hope belies a high casualty rate among the team. Unless they decide to quit, they do the job for life. Many SAR team members end up sick and broken after years of trekking through the harsh environment. And if an operation encounters extreme conditions, the risk of injury or death to the team skyrockets. According to Qanipalaat, his two older brothers were both wounded and quit the team, while his father, also on the SAR team, went missing during an operation in a blizzard and never returned. The team operates under extreme danger for extended periods, no less than the expeditions.\nWhat is even more surprising is that such an organization was established among the Sami tribes. They do not ask anything in return, completely selflessly volunteering as rescuers. Qanipalaat's attitude towards the team he was once a member of is representative of the general attitude of the tribe, to a certain extent.\n'I often dream of the snow whistling in the north, the fear of it makes you want to run. Of course, I knew the danger, but this was my purpose.'\nHe spoke without fear, revealing the Sami qualities of courage, kindness, and respect for life. It is from these qualities that the Sami search and rescue team was born, an origin that is widely recognized by the outside world.\nHowever, a recently discovered clue has muddled the once-clear origins of the search and rescue team: a Colombian explorer recorded in his notes that when his expedition first came to the tribe, it had already seen organized rescue workers. This shows that the SAR team is not a product of the tribe's contact with the Columbians, and in fact has a much longer history. And so we have a mystery: why does such a group exist with a long history and such high risk? Does the rescue team truly exist only to rescue? And if not, what is their real purpose? What is it that makes them willing to risk their lives to bring back those in distress?\nMaybe their real purpose... is the very act itself?",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "A few days ago, a succession of operators received gifts from Qanipalaat.\nThe gifts were very sudden, and puzzled many of the recipients. Only later did they learn the reason behind them from Qanipalaat himself: after he came to Rhodes Island, his fellow operators helped him adapt, and at the same time Rhodes Island provided Sami with a large amount of medical equipment, which greatly improved the health of the tribe. Through these gifts, Qanipalaat hoped to convey his and his tribe's gratitude.\nThe first gifts were mostly Sami handicrafts, or musical instruments and botanical specimens unique to the land. Simple but fine, the gifts were well received by the operators. When they thanked Qanipalaat, the brightness in his eyes as he asked 'Do you really like it?' made a deep impression on them. Only a small number of the operators felt slightly creeped out, and none of them could have predicted what would happen next.\nSince then, Qanipalaat has become more and more enthusiastic about bringing back Sami specialties and offering ever more gifts, but the nature of these gifts is increasingly esoteric to our operators. Weirdly shaped amulets and knives decorated with animal bones are still within the acceptable range, but the most peculiar gift so far is a beautiful wooden box that gives off a foul smell. According to a note from Qanipalaat, the wooden box contains 'a food item made from a trapped fowlbeast fermented in the stomach of a dead burdenbeast,' which is recognized as a rare delicacy in the tribe. The note concludes with Qanipalaat noting that it must be eaten raw to truly appreciate the taste. Obviously, not all members of the tribe can afford to eat such delicacies. To this day, many operators would prefer not to recall the smell that came out of their forcibly closed dormitories that day.\nNevertheless, Sami styles became popular at Rhodes Island thanks to Qanipalaat's gifts. Sami wood carvings can be found in the cupboards, Sami-style delicacies grace the cafeteria menu, and Sami specialty fabrics that are as comfortable as they are beautiful are worn by operators on off days. Thanks to Qanipalaat's efforts, not only have his tribe's living conditions improved thanks to outside help, but the ancient Sami culture also shed its mysterious veneer and gradually became accepted for its pure and unique beauty.\nWe believe that Qanipalaat has become a bridge between ancient Sami and modern Terra, and he still has room to grow.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1215,
      "atk": 525,
      "def": 106,
      "magicResistance": 20,
      "blockCnt": 1,
      "baseAttackTime": 1.6,
      "respawnTime": 70,
      "cost": 20
    }
  },
  "skins": [
    {
      "skinId": "char_466_qanik#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_466_qanik",
      "portraitId": "char_466_qanik_1",
      "illustId": "illust_char_466_qanik_1",
      "modelName": "Qanipalaat",
      "drawerList": [
        "三目YYB"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_466_qanik#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_466_qanik_2",
      "portraitId": "char_466_qanik_2",
      "illustId": "illust_char_466_qanik_2",
      "modelName": "Qanipalaat",
      "drawerList": [
        "三目YYB"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_466_qanik@snow#6",
      "skinName": "Gratitude Gift",
      "skinGroupName": "Icefield Messenger/VI",
      "skinGroupId": "2023#xmas",
      "avatarId": "char_466_qanik_snow#6",
      "portraitId": "char_466_qanik_snow#6",
      "illustId": "illust_char_466_qanik_snow#6",
      "modelName": "Qanipalaat",
      "drawerList": [
        "三目YYB"
      ],
      "description": "<color name=#ffffff>Formal wear that Qanipalaat got on holiday/Gratitude Gift. Always one to gift Sami specialties, he's now received a gift in return. He smiled to learn that Victorian garb went well with his tail.</color>",
      "rarity": 119
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "3-6",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 654,
            "atk": 283,
            "def": 45,
            "magicResistance": 10,
            "cost": 18,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 935,
            "atk": 399,
            "def": 76,
            "magicResistance": 10,
            "cost": 18,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 70,
      "rangeId": "3-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 935,
            "atk": 399,
            "def": 76,
            "magicResistance": 15,
            "cost": 20,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 1215,
            "atk": 525,
            "def": 106,
            "magicResistance": 15,
            "cost": 20,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3251",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30052",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30022",
          "count": 2,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 80,
      "rangeId": "3-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1215,
            "atk": 525,
            "def": 106,
            "magicResistance": 20,
            "cost": 20,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1500,
            "atk": 625,
            "def": 119,
            "magicResistance": 20,
            "cost": 20,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3253",
          "count": 3,
          "type": "MATERIAL"
        },
        {
          "id": "30044",
          "count": 7,
          "type": "MATERIAL"
        },
        {
          "id": "30083",
          "count": 12,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_qanik_1",
      "skillName": "Frigid Wind",
      "desc": "ASPD <@ba.vup>+{attack_speed}</>, prioritizes attacking Aerial enemies",
      "iconId": "skchr_qanik_1",
      "spCost": 30,
      "initSp": 15,
      "duration": 30,
      "blackboard": [
        {
          "key": "attack_speed",
          "value": 90
        },
        {
          "key": "mode",
          "value": 1
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30063",
              "count": 1,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_qanik_2",
      "skillName": "Falling Snow",
      "desc": "Deals <@ba.vup>{trigger_atk_scale:0%}</> ATK as Arts damage to at most <@ba.vup>{max_target}</> Ground enemies within range once every <@ba.vup>{interval}</> seconds and causes targets to <$ba.levitate>Levitate</> for <@ba.vup>{levitate_duration}</> seconds; When a target's <$ba.levitate>Levitate</> effect ends, deals <@ba.vup>{critical_damage_scale:0%}</> ATK as Arts damage to all enemies in a small area around that target",
      "iconId": "skchr_qanik_2",
      "spCost": 30,
      "initSp": 10,
      "duration": 7,
      "blackboard": [
        {
          "key": "max_target",
          "value": 2
        },
        {
          "key": "interval",
          "value": 0.5
        },
        {
          "key": "trigger_atk_scale",
          "value": 0.75
        },
        {
          "key": "critical_damage_scale",
          "value": 3
        },
        {
          "key": "levitate_duration",
          "value": 7
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31023",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_qanik",
      "moduleName": "Qanipalaat's Badge",
      "desc": "Operator Qanipalaat has demonstrated a remarkable aptitude for inflicting Arts casualties on the enemy.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Caster Operator during field operations to exercise Core Caster responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_qanik",
      "moduleName": "Homemade Trekking Poles",
      "desc": "Ieddne and Áhttje pull up young Qanipalaat by the hands, and walk through the snow that barely reaches to the knees.\nMeasuring the tundra's breadth by their own two feet is a tradition of the sijdda's rescue team, handed down unchanged for several generations. It has been written into story, woven into folksong, taught by parents to their children while they still burble and babble, climb to their feet with a stagger, learning all the while.\nThere is a symbol that a child of the sijdda is young no longer, has become an adult who will weather the blizzards, and it is not by means of counting years, but by whether they can enter the tundra alone, and retrieve a knot of blessings that their parents tied to a pillar of ice in the snowy fields at their birth. His viellja and oabbá told him countless times, half in flaunting and half in earnestness, of being out there and what they saw, and it made young Qanipalaat look forward to it like nothing else.\nThe pillar, limpid crystal in its glimmer, stands upright and alone. Too wide for even ten to encircle, this frozen colossus shines in a pale blue. They drew the way they'd come on the bark of a massive tree upon the tundra, a tree that would stretch its branches further day by day, reaching for somewhere unknown.\nWhen he said with all the grand aspiration in his heart that he'd join the rescue team when he grew up, his áhttje gave him a miniature hiking cane carved of wood. All about did he run in excitement, and confidently tripped straight over in the snow. Lifting his head up to look, his áhttje laughed as he pulled him to his feet, and the stars in the sky shone with a flicker, snowflakes perching on his nose.\n\nAlone, he walks through the snow that barely reaches to the knees.\nHe's arrived at a place further than his viellja or áhttje have ever been, but he knows that's because the tundra is where his áhttje's life ultimately lingers, and his brother can no longer take on any assignments with his injured leg. The other members worry for Qanipalaat's young age, but he always stands at the very front.\nHe takes note of the peculiar phenomena, and when he returns, he describes them with care to those in his sijdda that compose folksong; in return for his lifesaving grace, the Columbian doctor accompanying him stays with the sijdda, and actively helps by examining people's ailments; Qanipalaat lies over the elder's lap and sweetly persuades, so the Liberi woman who often comes to see her mother may begin to converse with their most stubborn elder who nevertheless has witnessed the most of all, and in return she can share her newest discoveries.\nHe departs from his sijdda, and then returns bringing even more things. He runs on trip after trip, until finally, he falls straight to the ground as weariness takes its physical toll. And when those around him move to help him back up, worried, Qanipalaat wipes his face off and lies there on the ground, staring up at the snowflakes falling down from the sky.\n'If a blizzard blows past the tip of my nose, that's my áhttje come to see me.'\nAnd his áhttje's snowflake floats down."
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "Doctor! Do you want these files here? A Liberi lady just taught me how to use a printer! Look, I even learned how to print on both sides! This needs to be single-sided? Uh-oh, sorry! I'll print it again!",
      "voiceAsset": "char_466_qanik/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "My mother has gotten a lot better. That time, even divination showed a dark future. If not for the medical equipment we got from the explorers, she might have left us... Since then, I decided to go out into the world. I hope to bring more equipment like that back to the village. ",
      "voiceAsset": "char_466_qanik/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "I'm really grateful to Magallan. We've only met a few times during search and rescue operations, but she put me in touch with Rhodes Island after hearing my situation. And she's an incredible lady. Not many people dare to explore the ice fields like her. Even people in our tribe seldom set foot there. It's a place that's feared and revered.",
      "voiceAsset": "char_466_qanik/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "I'm part of my tribe's rescue team, helping people who accidentally wander into the bog, or get lost in the snowstorms. That's how I met a lot of explorers from Columbia. Woah, Doctor, how did you know they always compliment my tail?",
      "voiceAsset": "char_466_qanik/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "I never thought I would leave the tribe and come here. I was never interested in things from the outside world. But that shiny medical equipment blew me away. They went against our divination. That's a miracle to me.",
      "voiceAsset": "char_466_qanik/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "The explorers told me things I've never heard before, about 'corporations', 'timetables', 'entrepot'... we don't even have these words because we've never had a use for them. But I learned them quickly, thanks to my conversations with the explorers.",
      "voiceAsset": "char_466_qanik/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Can I see the future like Gitano? I suppose I could divine your future, but I'm not great at it. If you really want me to tell your fortune for the day, let's see... Okay, it says... the stars will fall from the sky, and eggplant must go on top of rice.",
      "voiceAsset": "char_466_qanik/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Doctor, Accounting says my 'reimbursement claim' has been delayed. What does 'reimbursement claim' mean? Sorry, but there's still so much I don't understand about paperwork…",
      "voiceAsset": "char_466_qanik/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "Doctor! I'm back from my field mission! We delivered some equipment to my tribe and taught them how to use it. Turns out aunt's leg pains were caused by bone spurs. Now that we know how to treat it, she won't have to rely on my cousin's Arts to relieve the pain.",
      "voiceAsset": "char_466_qanik/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Oh, the phone is ringing! What did the Doctor say I should do in this situation… Okay... He-hello? Um, nice to hear you. This is the Doctor's office.",
      "voiceAsset": "char_466_qanik/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "I forgot to ask the Perro man what I should call you. I only learned the word 'company' from the Columbians. Do you have a name? Oh, just 'Doctor'? I can do that!",
      "voiceAsset": "char_466_qanik/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "Is this one of your technologies? How do you manage to record everything like that?",
      "voiceAsset": "char_466_qanik/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "Doctor, is this what you call a 'contract'? It's very difficult to understand. Do I have to sign it? You say if I don't sign it, I'll be forced to work day and night by a cruel boss? But Doctor, you are not cruel… What? What do you mean don't be so sure?",
      "voiceAsset": "char_466_qanik/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "I won't make a fool of myself like before, Doctor! You've helped me so much. My mother's getting better, and my tribe is learning to use Rhodes Island medical equipment. I hope I can do even more for them in the future.",
      "voiceAsset": "char_466_qanik/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Don't worry, I've been on a lot of rescue operations.",
      "voiceAsset": "char_466_qanik/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Everyone, follow my orders and don't run off on your own.",
      "voiceAsset": "char_466_qanik/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Begin rescue operation!",
      "voiceAsset": "char_466_qanik/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Make sure you're well-prepared. That's the foundation of a successful rescue.",
      "voiceAsset": "char_466_qanik/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "A new rescue objective?",
      "voiceAsset": "char_466_qanik/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "I have the map here.",
      "voiceAsset": "char_466_qanik/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Don't worry, help is on the way.",
      "voiceAsset": "char_466_qanik/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Please save your strength, we will get you out!",
      "voiceAsset": "char_466_qanik/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Rescue targets identified.",
      "voiceAsset": "char_466_qanik/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Rescue location confirmed.",
      "voiceAsset": "char_466_qanik/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Formulating a rescue plan.",
      "voiceAsset": "char_466_qanik/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Don't worry. You're going to be fine!",
      "voiceAsset": "char_466_qanik/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "I was nervous, but my experience really came in handy!",
      "voiceAsset": "char_466_qanik/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "A well-planned and well-executed rescue operation, our target has been brought to safety.",
      "voiceAsset": "char_466_qanik/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "The victim was injured… Don't worry, I'll ease the pain for you.",
      "voiceAsset": "char_466_qanik/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Over here! We need backup!",
      "voiceAsset": "char_466_qanik/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Oh, so this is where I'm supposed to use this 'access card.'",
      "voiceAsset": "char_466_qanik/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Oh!",
      "voiceAsset": "char_466_qanik/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Doctor, you don't really want me to divine your future, do you?",
      "voiceAsset": "char_466_qanik/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_466_qanik/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Doctor! My mother divined Rhodes Island's future to thank you. She'll tell you the results herself. She also asked me to give you this, a feather that's only given to the strongest warrior or wisest sage among our people.",
      "voiceAsset": "char_466_qanik/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Boo! Did that scare you? Not at all? Aw, I used to spook lots of people in the snow.",
      "voiceAsset": "char_466_qanik/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "I've been practicing tsoavttsomav iednijn (divination with my mother). Do you want to have your fortune told again? Maybe start with easy questions, like how big you'll grow this year. Apparently, I'm going to grow a lot!",
      "voiceAsset": "char_466_qanik/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "I used to be scared of contracts and paperwork, but I can handle those now. My tribe has started calling me the 'oavdos unna rájadusásj' ('Wonderful Little Messenger'). I heard Magallan set a new record. People with dreams just don't stop.",
      "voiceAsset": "char_466_qanik/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "hire_spd_cost&clue[001]",
      "buffName": "Rescue Team - External Contact",
      "desc": "When this Operator is assigned to the HR Office, HR contacting speed <@cc.vup>+30%</>",
      "skillIcon": "bskill_hire_spd2",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "hire_spd_cost&clue[000]",
      "buffName": "Rescue Team - Preserve Strength",
      "desc": "When this Operator is assigned to the HR Office, HR contacting speed <@cc.vup>+35%</>, and for every recruit slot (excluding initial slot), Morale consumed per hour <@cc.vup>-0.1</>",
      "skillIcon": "bskill_hire_spd&cost3",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}