{
  "id": "char_1016_agoat2",
  "meta_info": {
    "name": "Eyjafjalla the Hvít Aska",
    "appellation": " ",
    "voiceActor": {
      "en": "Hollie Taylor",
      "jp": "Risa Taneda",
      "kr": "Kim Ha-ru",
      "cn": "Juniper Berry"
    },
    "rarity": 6,
    "profession": "Medic",
    "subProfessionId": "Wandering Medic",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "Healing"
    ],
    "nationId": "Leithanien",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Eyjafjalla\n[Gender] Female\n[Combat Experience] None\n[Place of Birth] Leithanien\n[Date of Birth] Oct 18\n[Race] Caprinae\n[Height] 153cm\n[Infection Status]\nOriginium crystals distributed across surface of body, confirmed Infected by medical examination.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Normal\n[Mobility] Normal\n[Physical Resilience] Flawed\n[Tactical Acumen] Normal\n[Combat Skill] Normal\n[Originium Arts Assimilation] Outstanding",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Eyjafjalla, Volcanologist and Catastrophe Messenger. In recent years, she has participated in the production of multiple documentaries and written and published multiple books on volcanoes. She continues to receive treatment at Rhodes Island and undertakes a variety of activities, including Catastrophe research, as needed.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests show the indistinct outlines of internal organs, obscured by abnormal shadows. Originium granules detected in the circulatory system. The subject is confirmed to be infected with Oripathy.\n\n[Cell-Originium Assimilation] 11%\nOccurrences of deafness and blurred vision have become more frequent.\n\n[Blood Originium-Crystal Density] 0.59u/L\nWith Rhodes Island having brought her condition under control, Operator Eyjafjalla's Blood Originium-Crystal Density has not seen a significant increase.\n\n'Dr. Keller... My numbers haven't gone up. I'm not lying! We can't delay this field survey... Please! Believe me!'",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "After returning from her trip, Eyjafjalla slowly recounted to her fellow operators all her experiences during her time away. And when telling those stories, each and every piece of volcanic rock has an interesting factoid behind it: rocks with lots of holes can float in water, and sometimes even make noise; the distribution of obsidian is closely related to magma activity, and their hidden luster has other meanings to it; etc.\nAt the same time, our operators have also noticed that, while her hearing loss used to be a barrier to communication, it has since become much easier to talk to her. Whenever they tell her that her condition must have improved, she just keeps smiling as she always does and tells them with a bit of pride that, while her hearing has deteriorated to the point where she can now only hear with hearing aids in a quiet environment, they're finding it easier to talk to her because she learned to read lips.\n'Hearing aids really don't help me understand that much anymore, so I usually rely on both them and lip reading to understand what everyone is saying. Is it that hard to tell if you're not watching for it?\n'Sometimes, after I tell others about my condition, they start to look at me kind of differently. It's not that I want to be treated differently or earn anyone's sympathy. All I really need is for everyone to interact with me as usual.'\nThe worrying thing is that we occasionally have operators visit Medical and tell us that they saw her talking alone by herself, and that she sometimes even seemed a little angry. They were afraid to interrupt her, but were nonetheless worried that perhaps her condition has worsened in some strange way...",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Few are aware of the concept of a 'Sovereign of Beasts.' When interacting with humans, they are usually treated as either a human with distinctive traits or some kind of supernatural ruler. The natural characteristics demonstrated by these Sovereigns are also quite distinct from Terra's existing creatures. Recently, there has also been a string of strange occurrences aboard Rhodes Island, and we surmise that this is the work of a Sov■■■ (A long string of sheep hoofprints can be seen here; the letters are illegible)\n—■■■(Another string of hoofprints}\n\n'Skyfire told me they were scared to death when I got lost in the wilderness again, but they didn't expect me to suddenly appear out of nowhere in the crossroads they were in, alone. But I had a pink, fluffy critter lead me there. It even took a bite out of my book!'\n'Pink, fluffy critters? They've been showing up whenever I play my guitar! Gotta say, they have great taste in music. Even when I'm jamming out in the wind, they stand out there with me, up against the gales and unleashing life! Wish they'd stop eating my strings, though.'\n'Outta the way, outta the way~ Metal Crabs coming through~ These chubby little guys seem to be having a lot of fun with somebody lately; their body weight is back to normal now! I even found these pink furballs stuck to their claws. Any of you know whose pet they belong to?'\n—Rhodes Island Cafeteria audio recording\n\nWarning\nFollowing the disappearance of instruction materials and food stockpiles in September, the instructors have found the following discipline violations during the October inspection:\nUsing Originium Arts to play with toys, suspending them midair and sending them flying around; the inexplicable disappearance of ice cream ingredients meant for classes; skateboarding on the deck outside of set hours and hiding as soon as the instructors arrive.\nOffending operators should report to the instructors' office immediately to acknowledge and rectify their mistakes, as well as uphold all rules and regulations to prevent further offenses.\n—Dur-nar\n\nGive me my motherf■■in' limited edition vinyls back!\n—■■ (Unknown penguin footprint on the wall)\n\nA few days later, after a significant increase in incidents involving 'strange pink silhouettes,' Eyjafjalla had no choice but to leave her laboratory and spend what little time and energy she has dealing with the problems caused by the stealthy sheep, apologizing to everyone one-by-one, and helping everyone touch those invisible mischievous animals.\nThat said, it's apparent that she's also enjoying this.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Dr. Kahn:\nYou have my sincerest gratitude.\nI know that if it weren't for your assistance in the beginning, I would likely not have received such quality healthcare. Over the past few years, I have persistently worked to complete the volcano expedition. I feel that as a volcanologist and a daughter taking over her parents' unfinished research, this is a life goal I must complete. In spite of your numerous letters, I have insisted on continuing down this path, and I apologize for making you worry.\nI also know that you have been trying to uncover the truth of all those years ago, and that you've been protecting me time and again by trying to keep me from getting too involved. If it weren't for your persistence and care, I would never have learned what actually happened back then. Although the vacation itself may have helped alleviate my worries, it was you, the truth that you worked so hard to give me, and Dr. Keller's frankness in the end that truly gave me the relief I needed.\nI will come visit you in Leithanien in the near future. My mother used to tell me that you would sometimes be upset when your experiments went wrong, and that you'd need my parents to bring a cake to your lab to comfort you... I really want to tell you that we can't completely prevent accidents. All we can do is hold on to every meaningful bit of time we have. I really hope you were able to finally calm down, and that you could tell me any old stories about my parents.\n—Adele\n\nAdele:\nI have given this a lot of thought, but I finally decided to write you this letter. I want you to know that I am truly grateful to you.\nI had decided many years ago that I would never again climb a volcano, and that this museum would be my final memento to Magna and Katia.\nAt first, I invited you to participate in the museum and Mt. Siesta's affairs because my work required it, and also because you are Magna and Katia's child. I had intended to retire from all research and work pertaining to volcanoes after bringing this matter to completion. I couldn't face you, nor could I face Kahn's question. I had been wondering: if I'd chosen to make them stay as well, would they not have been caught in that pyroclastic flow and lost their lives? However, I never expected you to have never questioned my involvement nor resented me.\nI'm sorry, Adele. I was too harsh on you before, and it was partly because I was afraid I'd be reminded of the time I spent with your parents. My memories with them were once a heavy burden to me, but thanks to you, I can finally bring myself to put them into words again, and share them with you as simply fun anecdotes.\nI await your next letter, and am preparing for our next expedition together.\n—Keller",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Upon her return to Rhodes Island, Eyjafjalla immediately began to gather all the data she had kept at Rhodes Island and send them to Siesta's Volcano Museum, as well as prepare for future joint research projects with Lady Keller.\nNaturally, we were a little worried. After all, she had been working with volcanoes both from closer distances and more often over the past few years, all to complete the project that her parents were unable to finish. This is no doubt detrimental to her health. Our Medical operators often tried to talk her out of participating in surveys, but she would always tell us a story she heard when she was still a child: of a sickly scientist bedridden with illness, but who didn't hesitate to spend what little strength she had left to continue her research. In the end, she reached a conclusion, and closed her eyes.\nShe asked us a question: If you were that scientist, at the final days of your life, would you rather climb a summit or spend your remaining time in bed, peacefully with your family?\nWe were unable to give Eyjafjalla an answer, but perhaps her answer would be to achieve both. Compared to others who've made significant breakthroughs in the field of volcanology, she is still very young. Some races can live past a hundred years, perhaps even longer, while others live a much more fleeting life. However, the length of one's life does not determine its worth. Judging from the data and research papers she's managed to put together in her dorm room, we can't help but be awestruck at how much she's already fit into her short life, and she is continually adding more.\n\n'There are many secrets hidden across the lands under our feet. Each insignificant rock has endured far more time than even the oldest Savra.\n'Underneath layers upon layers of strata, there is a chamber of magma that is ever flowing at unimaginable temperatures, while the strata themselves are slowly moving and constantly crushing one another. We once made the bold assumption that perhaps the seas were once tall mountains, and that the earth currently beneath our feet could perhaps have once reached even the clouds above. When, after traveling hundreds of thousands of miles, the earth that once saw the skies, or the bottom of the ocean, finally encounters its compatriot, they release a most radiant and blazing light.\n'Throughout this process, my parents lifted their heads and pondered just what exactly it is that boils our lands' bloodstreams. And now, I am following their footsteps and walking the path they once did, to seek an answer from the land. The footsteps of future generations will likewise trample over ours as they continue down this path.\n'This is the meaning of our lives.'\n—The opening monologue of the volcano documentary <i>One Step After Another</i>, as narrated by Eyjafjalla",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Eyjafjalla's health isn't the best right now, but she still insists on climbing the Unna Volcano.\nAs her assistants, there was nothing we could do to talk her out of it...\nEven before we reached the mountain, she was already starting to pass out from fatigue. She couldn't even hear us warning her. I know that Unna has seen a clear fluctuation across all indicators, and it's in prime observation condition, but pushing herself like that without regard for her own health is clearly against the most basic rules she taught us herself.\nWorried about her, we've been following her.\nThe residents of the village all seem to know her very well. While still at the foot of the mountain, we rested a little and reorganized. Perhaps I should've tried to talk to her again...\n......\nWe finally made it to the summit, but Eyjafjalla didn't start recording data right away.\nInstead she dug a shallow hole and buried... a small rock.\nIs something going to grow from this?\nThere are also the garlands of flowers she's been holding onto the whole time, and she kept hugging them tight even though she almost tripped a couple times. But suddenly, those two garlands just up and fluttered away. What a shame! Even though there wasn't any wind at all.\nStill, I don't think I've ever seen her look so gratified...",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1237,
      "atk": 339,
      "def": 87,
      "magicResistance": 10,
      "blockCnt": 1,
      "baseAttackTime": 2.85,
      "respawnTime": 70,
      "cost": 16
    }
  },
  "skins": [
    {
      "skinId": "char_1016_agoat2#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_1016_agoat2",
      "portraitId": "char_1016_agoat2_1",
      "illustId": "illust_char_1016_agoat2_1",
      "modelName": "Eyjafjalla the Hvít Aska",
      "drawerList": [
        "Anmi"
      ],
      "description": "Eyjafjalla's protective suit while surveying volcanoes.\nHer mother's old jacket fits her perfectly now. The past is no longer a burden, but a source of strength.",
      "rarity": -50
    },
    {
      "skinId": "char_1016_agoat2#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_1016_agoat2_2",
      "portraitId": "char_1016_agoat2_2",
      "illustId": "illust_char_1016_agoat2_2",
      "modelName": "Eyjafjalla the Hvít Aska",
      "drawerList": [
        "Anmi"
      ],
      "description": "Every scorch mark on the protective suit is like a piece of sage advice.\nThe warmth of the past surrounds her as she climbs one mountain of life after another.",
      "rarity": -10
    },
    {
      "skinId": "char_1016_agoat2@epoque#34",
      "skinName": "A Picnic Before A Long Trip",
      "skinGroupName": "Epoque/XXXIV",
      "skinGroupId": "2024#epoque#5",
      "avatarId": "char_1016_agoat2_epoque#34",
      "portraitId": "char_1016_agoat2_epoque#34",
      "illustId": "illust_char_1016_agoat2_epoque#34",
      "modelName": "Eyjafjalla the Hvít Aska",
      "drawerList": [
        "Anmi"
      ],
      "description": "<color name=#ffffff>EPOQUE Collection New Arrivals/A Picnic Before A Long Trip. Bam! Everyone's become teeny-tiny, must be another one of Dolly's pranks! Good thing the cream didn't stain her dress, because Eyjafjalla will need it for a dance of azure blue.</color>",
      "rarity": 49
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "3-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 789,
            "atk": 148,
            "def": 47,
            "magicResistance": 10,
            "cost": 14,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.85,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1039,
            "atk": 244,
            "def": 69,
            "magicResistance": 10,
            "cost": 14,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.85,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "3-17",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1039,
            "atk": 244,
            "def": 69,
            "magicResistance": 10,
            "cost": 16,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.85,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1237,
            "atk": 339,
            "def": 87,
            "magicResistance": 10,
            "cost": 16,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.85,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3261",
          "count": 5,
          "type": "MATERIAL"
        },
        {
          "id": "30012",
          "count": 12,
          "type": "MATERIAL"
        },
        {
          "id": "30032",
          "count": 5,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "3-17",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1237,
            "atk": 339,
            "def": 87,
            "magicResistance": 10,
            "cost": 16,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.85,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 1439,
            "atk": 424,
            "def": 109,
            "magicResistance": 10,
            "cost": 16,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.85,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3263",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30125",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30044",
          "count": 5,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_agoat2_1",
      "skillName": "Soundless Sustenance",
      "desc": "ATK <@ba.vup>+{atk:0%}</>, each heal can affect one additional target, and all friendly units within range will recover <$ba.dt.element>Elemental Injury</> equal to <@ba.vup>{agoat2_s_1[aura].ep_heal_ratio:0%}</> of Eyjafjalla the Hvít Aska's ATK\n<@ba.rem>Unlimited duration</>",
      "iconId": "skchr_agoat2_1",
      "spCost": 60,
      "initSp": 0,
      "duration": -1,
      "blackboard": [
        {
          "key": "atk",
          "value": 0.4
        },
        {
          "key": "agoat2_s_1[aura].ep_heal_ratio",
          "value": 0.08
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30053",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30155",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_agoat2_2",
      "skillName": "Cloudmist Shelter",
      "desc": "Immediately heals all friendly units within range and creates a<$ba.epbarrier> Protective Barrier</> for them that lasts <@ba.vup>{duration}</> seconds; Protective Barrier absorbs <$ba.dt.element>Elemental Injury</> for all friendly units equal to <@ba.vup>{agoat2_s_2[shield].atk_scale:0%}</> of ATK",
      "iconId": "skchr_agoat2_2",
      "spCost": 20,
      "initSp": 0,
      "duration": -1,
      "blackboard": [
        {
          "key": "agoat2_s_2[shield].atk_scale",
          "value": 9
        },
        {
          "key": "duration",
          "value": 20
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30033",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_agoat2_3",
      "skillName": "Volcanic Echoes",
      "desc": "Attack Range becomes global, and each heal is converted to a <@ba.vup>5</>- heal sequence that prioritizes different targets, each with <@ba.vup>{attack@heal_scale:0%}</> healing effectiveness and <$ba.dt.element>Elemental Injury</> recovery; the effect of the Second Talent is increased to <@ba.vup>{talent_scale}</> times",
      "iconId": "skchr_agoat2_3",
      "spCost": 60,
      "initSp": 40,
      "duration": 50,
      "blackboard": [
        {
          "key": "attack@heal_scale",
          "value": 0.6
        },
        {
          "key": "talent_scale",
          "value": 5
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30013",
              "count": 9,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_agoat2",
      "moduleName": "Eyjafjalla the Hvít Aska's Badge",
      "desc": "Operator Eyjafjalla the Hvít Aska has demonstrated a remarkable aptitude for wide-range healing in tandem with remedying Operators of their accrued Elemental Injurys.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Medic Operator during field operations to exercise Wandering Medic responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_agoat2",
      "moduleName": "Sounds I Want to Retain",
      "desc": "[Recording: Bubbling lava]\nTitle: Volcano's Breathing\nDescription:\nWhen the Mount Siesta stopped erupting, Professor Keller and I climbed up the volcano once again to finish our last data collection.\nAfter we recorded this sound of bubbling lava, Professor Keller suddenly suggested that we sit for a while at the mountaintop.\nShe gazed at the already ash-grey Siesta and I saw her eyes swell up with tears. She mentioned something about the future of the Volcano Museum of Siesta and her plans for retirement, which would very likely be delayed. I knew that she wanted me to visit Siesta as much as possible in the future—not just for research.\n\n[Recording: Singing with music]\nTitle: Singing at a Cake Shop\nDescription:\nIt's been a while since I last came back, and I had this feeling that this little town was stuck in time and nothing was ever going to change.\nHowever, I accidentally noticed that the cake shop Mom used to like so much had finished its renovation and reopened. A lot of musicians even came to the courtyard, holding impromptu performances.\nI heard a very familiar melody that day and went up close, and the singer invited me to join them! *Sighs* It was a pity I couldn't remember the lyrics and wasn't quite sure which part everyone was singing, so I just struggled to hum along... Hope I wasn't off-key too much.\n\n[Recording: An academic talk]\nTitle: On-campus Seminar\nDescription:\nI brought the data from Mount Siesta back to William University and met with Dr. Kahn and other scholars there. Dr. Kahn seemed a little unsettled. I told him it was not a big deal, but by the looks of it, that wasn't much help.\nThankfully, after some small talk, we started discussing research on volcanoes, and Dr. Kahn finally found peace and became more relaxed.\nThe seminar was exciting. No one seemed to care that we were not in a classroom, laboratory, or meeting room, but just standing on a path on campus.\nIt felt really nice.\n\n[Recording: Ripped audio from a childhood video]\nTitle: I Still Remember That Wish\nDescription:\nI left the university and came back home.\nI changed the curtains, threw away some old stuff I didn't need anymore, and found a childhood video in the process. It was a shame that most of the content was damaged. Fortunately, the soundtracks were intact, so I got to rip them and re-record them onto this tape.\nI heard Mom and Dad singing me the birthday song and encouraging me to make a wish. Of course, I didn't say it out loud, but I still remember it—\nNow I'm on my way to making it come true.\n\n[Recording: Friends' laughing]\nTitle: A Welcome Party For Me!\nDescription:\nI returned aboard for my regular check-up after settling everything at home. It'd been a long time since I last left Rhodes Island, and guess what? People held a welcome party for me!\nProvence and Angelina caused a little chaos when they set off the firework tubes and accidentally knocked down a huge pile of dolls. Then next thing I remember was little lambs coming from nowhere and rampaging all about... It was a disaster. But everyone was laughing so hard.\nI really hope these kinds of moments can last longer.\n\n[Recording: N/A]\nTitle: Untitled\nDescription:\nFor the next field investigation.\nI'd love to keep more recordings if I have the chance—the sound of lava, wind, rain, and the people around me."
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "Were you looking for these documents, Professor? Here you are. I personally believe that some of these theories aren't explained in enough detail. If you wanted a springboard for your ideas, I suggest referencing these two papers. I've added some of my own commentary, so feel free to look it over.",
      "voiceAsset": "char_1016_agoat2/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "The little lamb didn't go away even after the volcano erupted. It's actually been staying with me the whole time, and sometimes gets into trouble. H-Hey, you can't go standing on the Doctor's head! That's terribly rude! Sorry, Professor. Um, Can you see the little lamb? It's right here, hand to the right, and then down a little. Yeah, you're petting it right now.",
      "voiceAsset": "char_1016_agoat2/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "This coat was Mom's old protective gear. Professor Keller once told me, this mark came from a sudden burst of magma. It almost left a scar on her, but Mom just laughed, saying she had good luck. If I were to go on an expedition with her, I'd probably need to be the one to lead.",
      "voiceAsset": "char_1016_agoat2/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Shh. Here, Professor, I snuck these over! I saw it all – you were muttering about how badly you wanted some snacks earlier, right? I've actually gotten pretty good at reading lips. Not to brag, but I might be better than Rhodes Island's intelligence agents by now. But, just maybe.",
      "voiceAsset": "char_1016_agoat2/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "I'm getting ready to head out, Professor. Another volcano is about to become active. While luck is still on my side, I need to go a bit farther, a bit deeper. I want to wear the brightly-colored ornaments, and get to the truth in the hot magma, just like Mom and Dad did.",
      "voiceAsset": "char_1016_agoat2/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "Professor, in a few days, I'll be going to Leithanien to attend a press conference and the premiere of my documentary. Our research is too obscure for the ordinary people who want to learn about volcanoes. But I still hope that one day, I can use this method to show everyone the beauty of volcanoes.",
      "voiceAsset": "char_1016_agoat2/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Frostleaf has been going to Mousse's book club a lot these days. Earthspirit and Provence have been trekking far and wide. I've been exploring more volcanoes... Professor, I still remember those early days, when Mousse was so nervous she couldn't even talk, and Frostleaf was always alone. But look at them now... they're getting better.",
      "voiceAsset": "char_1016_agoat2/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Hehe, Mr. Kahn's letter just arrived. He says he's really mad that Professor Keller and I went rowing on a sulfuric acid lake without protective gear. Mom and Dad did crazy things just like that before they had me, and they didn't bring Professor Keller along. So this time, so I took her with me!",
      "voiceAsset": "char_1016_agoat2/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "One moment, Professor, I'm changing out my hearing aid battery. Hmm? You're... Did you forget, Professor? I can read lips now. Besides, the sign you want should be like this, then this. What you just did was 'I have been suppressed by the volcano.'",
      "voiceAsset": "char_1016_agoat2/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Phew... Even without my hearing aid, I can still pick up the little sounds of Professor's breathing…",
      "voiceAsset": "char_1016_agoat2/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Professor, I'm back, and I brought some souvenirs for you. I'll send them over to Dr. Kal'tsit and Amiya in a bit. I also managed to get a good amount of new data and specimens from Siesta's volcanic eruption. Would you like to come and take a look with me?",
      "voiceAsset": "char_1016_agoat2/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "A volcano's every change and movement is fleeting. Only by capturing them on camera are we able to preserve every last detail.",
      "voiceAsset": "char_1016_agoat2/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "Our documentaries are being taken seriously? That's great! During my inspections in recent years, I've seen a lot of governments that don't trust our judgment and won't allocate resources to evacuate the residents. I hope I'll be able to make a difference.",
      "voiceAsset": "char_1016_agoat2/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "I know what you want to say, Professor, but I've never made my expeditions hard for myself. Starting from the smallest example, I bet you've never fried a fowlbeast egg over lava before, but I have!",
      "voiceAsset": "char_1016_agoat2/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "How about a slice of lava cake before we head out? It was one of Mom's traditions.",
      "voiceAsset": "char_1016_agoat2/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Volcano field investigations are extremely dangerous. Everyone, please follow my instructions.",
      "voiceAsset": "char_1016_agoat2/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Please double check your protective gear. Also, remember to keep a safe distance from the lava, and give regular status reports.",
      "voiceAsset": "char_1016_agoat2/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Relax, volcano. We're just here to collect a few precious samples. Please don't get mad.",
      "voiceAsset": "char_1016_agoat2/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "This time, we can make up for the missing data in the last report.",
      "voiceAsset": "char_1016_agoat2/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Don't worry about me, Professor. I've scaled a lot more volcanoes than you can imagine.",
      "voiceAsset": "char_1016_agoat2/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Volcanic soot contains lots of Originium particles. Let's not stay too long.",
      "voiceAsset": "char_1016_agoat2/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Magma will dredge up Originium veins. Keep your distance.",
      "voiceAsset": "char_1016_agoat2/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Melt away, life-depriving stone...",
      "voiceAsset": "char_1016_agoat2/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Ashes from volcanoes, they consume and erase, then nourish and propagate.",
      "voiceAsset": "char_1016_agoat2/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Those particles have no place here. I'll send them away.",
      "voiceAsset": "char_1016_agoat2/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Oh, flowing magma, please slow your steps.",
      "voiceAsset": "char_1016_agoat2/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "We are one step closer to the truth of this land, Professor.",
      "voiceAsset": "char_1016_agoat2/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Perhaps there will still be people gazing across this volcano a century from now. Their footprints will cover ours, and the seeds buried beneath the ash will bloom into even more beautiful flowers...",
      "voiceAsset": "char_1016_agoat2/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Why…? I'm not seeing any errors in the formula or the data... Um? I think I see something surfing through the lava...?",
      "voiceAsset": "char_1016_agoat2/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Phew... Thankfully, the volcano didn't want to keep me that badly.",
      "voiceAsset": "char_1016_agoat2/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Professor, I brought the documents you asked me about.",
      "voiceAsset": "char_1016_agoat2/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "I heard you coming, Professor. I recognized your footsteps.",
      "voiceAsset": "char_1016_agoat2/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Professor, I know how good you are at learning. I can tell you're doing the wrong sign on purpose just to make me laugh!",
      "voiceAsset": "char_1016_agoat2/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_1016_agoat2/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "A pebble encounters countless other pebbles during its life. They will collide with each other, become magma, erupt when they reach critical temperature, and then finally turn into the ash that nourishes new life. We're just like these little pebbles, Professor– Huh? Why didn't you tell me the fireworks already started?!",
      "voiceAsset": "char_1016_agoat2/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Professor, the fault lines of mountain ranges and trenches are quietly moving beneath our feet. Little by little, they inch us closer to the volcanoes we hope to visit.",
      "voiceAsset": "char_1016_agoat2/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "The obsidian in this brooch comes from a volcano you haven't climbed yet. When you're not busy, we can go volcano-climbing, one by one. You'll know exactly which volcano I'm talking about once you get to the top. The scenery up there is magnificent, and the other half of your present is waiting up there.",
      "voiceAsset": "char_1016_agoat2/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "Professor, I read in a book that after thousands of years, we will all re-enter this land's cycle. Maybe I'll become a little plume of magma, reshaping the land along its rock formations. When that time comes, I'll be able to forever look out across the land, with those I nourished nestled up against me.",
      "voiceAsset": "char_1016_agoat2/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "train_spd&profession3[180]",
      "buffName": "Medic Expert α",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, <@cc.kw>Medic</> Operators' Specialization training speed <@cc.vup>+30%</>",
      "skillIcon": "bskill_train_medic1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "train_spd&profession3[181]",
      "buffName": "Combat Techniques: Wandering Medic",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, <@cc.kw>Medic</> Operators' Specialization training speed <@cc.vup>+30%</>; if the trainee's Job Branch is <@cc.kw>Wandering Medic</>, training speed will be further increased by <@cc.vup>+45%</>",
      "skillIcon": "bskill_train_wandermedic",
      "phase": "PHASE_2",
      "level": 1
    },
    {
      "buffId": "dorm_rec_all&profession[000]",
      "buffName": "Volcanic Hot Springs Bath",
      "desc": "When this Operator is assigned to a Dormitory, Morale recovery per hour of all Operators in that Dormitory <@cc.vup>+0.06</> for each <@cc.kw>Wandering Medic</> Operator in the Base (excluding Assistants and Activity Room users, caps at <@cc.kw>4</> Operators, strongest effect of the same type applies)",
      "skillIcon": "bskill_dorm_rec_all&profession",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}