{
  "id": "char_4117_ray",
  "meta_info": {
    "name": "Ray",
    "appellation": " ",
    "voiceActor": {
      "en": "May Charters",
      "jp": "Kaori Nazuka",
      "kr": "Kim Sung-hee",
      "cn": "Yanqi Sun"
    },
    "rarity": 6,
    "profession": "Sniper",
    "subProfessionId": "Hunter",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "DPS"
    ],
    "nationId": "Rim Billiton",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Ray\n[Gender] Female\n[Combat Experience] None\n[Place of Birth] Rim Billiton\n[Date of Birth] Jul 14\n[Race] Cautus\n[Height] 170cm\n[Infection Status]\nConfirmed Infected by medical examination.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Standard\n[Mobility] Excellent\n[Physical Resilience] Excellent\n[Tactical Acumen] Normal\n[Combat Skill] Standard\n[Originium Arts Assimilation] Standard",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Ray, a Rim Billitonian without stable employment who often works in mine safety and security, or as a 'pitsinker' in the local parlance. After running into Amiya, the Doctor, and Savage while they were revisiting old memories, she took the initiative to apply to Rhodes Island. As an operator aboard the landship, she participates in a variety of security, combat, and exploration missions.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests show the indistinct outlines of internal organs, obscured by abnormal shadows. Originium granules detected in the circulatory system. The subject is confirmed to be infected with Oripathy.\n\n[Cell-Originium Assimilation] 4%\nOperator Ray has no obvious crystals on the surface of her body.\n\n[Blood Originium-Crystal Density] 0.25u/L\nOperator Ray frequently enters dangerous environments, and her condition is much graver than she reports.\nIn other words, Miss Ray has incredibly high pain tolerance. Being able to endure such pain means that it is very easy for the patient to neglect their condition. We will need to monitor her closely.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "In the well-developed mining industry of Rim Billiton, 'pitsinker' was once a common occupation. Traditionally, every day before a mine opens for work, a lone pitsinker is dispatched down the shaft to inspect for hazardous conditions: water seepage, leaks both gaseous and liquid, areas at risk of cave-in, etc, all alongside suppressing any Infected creatures that thrive in mines. To ensure smooth operation, pitsinkers would also need to constantly patrol the tunnels and protect the miners from surprise attacks from said creatures. On paper, they are similar to modern security staff—with a greater focus on specialized knowledge and combat skills—but in practice there are practically zero requirements to become one. For the many vagrant children who lack the strength for long hours of mining work, it is the perfect job to make their way up in the world. At its core, pitsinking really is just going down a mine to check it for poison gas and cave-ins. At times, they will risk their bodies, even their very lives, to seek these answers. \nThat said, Rim Billiton's mining industry has long since moved on, with much of the work now being performed by machines. The technologies used to monitor and decontaminate the mineshafts are constantly being refined, with the safety of the workers increasing day by day. However, small-scale private mines can still be found all over the country, and some mine owners continue to use the old ways passed down for generations. Operator Ray seems to be of like mind. She doesn't think too much about it or herself, and hasn't given her future much thought either. Once, long ago, someone told her that she could make a living as a pitsinker, and she's been doing it ever since. As a fellow Rim Billitonian who's worked in mine security, Savage has given Ray a number of tests, confirming that she has qualifications to hold a security post at a modern large-scale mine. Ray had simply never considered the possibility.\nThankfully, she seems to have luck on her side, having managed to make it through life without major injury. However, perhaps she will be stuck with a pitsinker's mindset for a while yet: isolated, always on high alert, always raising her head to gaze up from the bottom of the shaft at the light from the entrance, not knowing whether she's alive or dead until she's hauled back to the surface and leaves the dark behind her.\n\n[A note jotted down after a test report]\nHer reflexes are ridiculous! Maybe even too good! She managed to completely avoid my hammer and the following lightning strikes, then evaded every last fragment of shattered roadblocks too! She even dodged my pat on the shoulder after the test was over! While she may not have any real experience, I think she's perfectly capable of participating in milder combat as she is. \nBy the way, don't leave this note in the copy of the report she gets. I praised her for her talent in combat, and how it took a lot more than luck to make it as far as she has, but she seemed... a little melancholy hearing that, crouching down to give her sandbeast a quick pat.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "For quite a while after joining Rhodes Island, nobody paid much attention to Ray. There's no shortage of operators who are very welcoming to newcomers, but neither the movie club, the tea club, nor the culinary club ever sent her an invitation. After all, she's never asked for directions, or even stopped to get her bearings on the landship. This made it very hard for anyone to tell that she was indeed a newcomer, even as she was calmly making her fifth loop on the same route.\nThey might also not draw the connection between her and that one sandbeast that showed up recently. Sandbeasts are notoriously hard to tame, with many preferring to starve to death than eat in captivity. Thus, most believed that the sandbeast popping up in the corridors had merely crawled in via a ventilation duct, and that in a day or two it would find its way back to the great outdoors. In time, everyone simply got used to it hiding away in comfy corners. It might occasionally chew through a cable beneath a pre-fab board, but they were always fixed in a jiffy, with no one the wiser as to its owner.\nOne day, thanks to a particular dish on the menu, several operators were discussing the migratory fowlbeasts of Terra in the cafeteria, and eventually reached a confusion as to whether the fowlbeasts that arrived in two different locations were the same species or not. At that point, Ray—who had never spoken a single word to them—slipped into their conversation as though she had known them their whole life and started asking each of the operators where they were from. Upon learning their hometowns, she would explain which species were typical of each region in easy-to-understand terms. This was how they got to know her, with many amazed at her knowledge in this area, as well as her incredible curiosity that she never showed at any other topic. She was the type of child who would flip through a picture book again and again, repeatedly devouring all the animal almanacs in her local library and unintentionally memorizing every last page.\nNaturally, everyone quickly realized that the mystery sandbeast was simply hanging out near Ray, and that she was the one fixing the wires it chewed through. Also, half of her single-occupancy dorm room was occupied by a giant sandbox. Not only did she make it herself, but when the landship made a stop in the wastelands, she took the chance to gather sack after sack of sandy soil to fill it.\nNobody knows how long she spent on the task, and she never mentioned it in the room renovation application form she handed in after-the-fact, but at least everyone is now aware that, of the many jobs she claims to have done, she wasn't lying about the heavy labor.\nWe should be glad that Ray is the only one aboard raising a sandbeast, because she never gave it a name. Most who raise a pet will try to condition them to respond to a specific word or phrase, but Ray simply whistles like a sandbeast to call hers. Perhaps she is simply not great at naming things. After all, the only reason her name was shortened to Ray—from Rayella—was because of a lazily-made temporary ID tag given to her by a worker who couldn't spell. Or perhaps she just thinks that 'sandbeast' has a nice ring to it. A special name, just like the 'Ray' she is so fond of.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "When other operators went to support Ray on her first solo field mission as scheduled, they found a small shed out in the wastes. It was built into a natural cave in the cliffside, made from lightweight discarded construction materials efficiently fitted together with simple joints, and lit night and day by a portable Originium generator. The Rhodes Island-issued tent she was provided with laid in the corner, still in its packaging.\nRay's way of doing things is pretty much the stereotype of a Rim Billitonian Cautus, but those traditions are as old as the first explorers from the nations of the centrum, who began showing an interest in Rim Billiton's Originium deposits decades ago. Before Rim Billitonians started building nomadic cities, they would combine easy-to-take-down buildings with solidly-constructed pits, using them to hide from the Catastrophes that plague the region especially frequently. After nearly a century though, the old ways have begun to fade. Cautuses these days still love their makeshift sheds, but will choose to build them away from the vicious wilds. Those who still make them out in the countryside like Ray are a dying breed.\nHer way of life stems from her childhood. She was born into a family of hunters, in particular a group that stayed away from civilized cities for years on end, wandering about the country and staying self-sufficient. She does not clearly remember what she learnt of hunting back then. The only clear memory she has is of a time when the group took heavy losses from a bout of severe weather. Several of her family members went missing in that sandstorm. After surviving that, she decided to follow a distant relative to seek a living in a nomadic city, engrossed in seeing just how far she could go on her own.\nInside the shed, which felt rather cramped with four people, the operators considerately asked her if she had built a traditional Cautus shed like from her youth because she was homesick.\nRay first shook her head, saying that she wasn't sure what that even meant. 'The comforts of home?' But after a while, when they were finishing up their check of the supplies and getting ready to tear down the shed and leave, she looked about at the operators all squeezed together and suddenly blurted out: 'Now isn't this nice and cozy?'\n\n'Those old Rim Billiton hunter stories she told us that day, like the Rim Billy Gloompincer with claws longer than a man is tall and so on... I don't think her love for animals comes from her childhood environment. I can tell that those memories are very, very far from mind.\nBut I can also tell that she really does recall something. Do you remember? When were getting ready to shut down the generator and turn off the lights, she looked so reluctant. Afterwards she said that she was saved by 'a ray of light'.'\n'Eh? Was she the sort of person to use metaphors like that?'\n——An excerpt from the post-mission chatter of two participating operators",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Ray's accounts]\nToday's expenses:\nSandbeast feed\nSandbeast electrolyte supplement (mix with water)\nSandbeast fur cream (Spare. Blended by Dr. Honeyberry. She's not 100% sure if it works, so remember to give feedback after using)\nMeal card recharge (Need more protein, doctor's orders)\nCompensation for Lanns's truck (Still got eleven months to pay her back in full)\nOripathy suppressants (Gray-ears has been eating hers on time every day this week, so I'd better too)\nToday's income:\nA bag of snacks\nOne notebook, two ballpoint pens (girl from HR said that if I needed new ones, I could find her and she'll give me more. Nice lady. Thanks)\n'True Accounts of Supernatural Phenomena' cassettes 17-20 (Rented, need to be returned. The librarian suggested that I swap it out for a more credible documentary series next time)\n\n'Look, I was just worried if you could keep your schedule straight, not if you could afford stuff—I've said it before, this payment deadline was your idea, and as close as we are, I wouldn't mind even if you delayed it indefinitely. Basically, no need to show me your tidy little accounts book. If anyone else ever asks you about this kind of thing, don't give them this little book, and definitely don't make them read it the whole way through. Got it?'\n'Mhm.'\n'Hmph, I never would've expected that behind my back, you'd manage to tidy up your room all spick and span, learn to cook alright, and got even better at mending clothes than me! I also hear your field mission went smooth as butter. They were going on about how you had all these plans and were super-reliable... You sure they're talking about the same Ray? Really?'\n'Mhm.'\n'Alright, I guess I better change my tune then. Can't keep calling you 'Truckjacker.' After all, what you did back then is our little secret. Best to let the Rhodes Islanders keep their impression of you as a friendly, reliable, occasionally smiling young lady.'\n'Mhm.'\n'Oh, right, considering that you've been keeping your accounts so nice and tidy, what are you actually planning to do with the money you save up?'\n'I'm thinking of looking for a type of big burdenbeast in the Columbian barrenlands, let them start to dance after the moon again.'\n'...Eh? You still on about that kind of thing?'",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Classified Log]\nAlright, Doctor. I won't mention what I know about Feranmuts to anyone else. Thanks for explaining more about what I experienced in that cave.\nMemories? My story helped you recall more from the past? ...I'm glad I could help you out.\nI know the feeling, having your past locked so very far away, and so indistinct, to the point where you can't even be sure it really happened to you or not. Maybe that's why I thought about seeing it one more time.\nRegrets? No, not for now.\nFear? No way.\nAll I'm thinking of is... illuminating the present. On careful consideration, I don't think it really matters whether or not that light was the ray of light from my memories.\nI'll cheer you on, Doctor, and I hope you'll be able to get your memories back without a hitch. Although I will say, being by you and Amiya is bright enough already.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1507,
      "atk": 900,
      "def": 180,
      "magicResistance": 0,
      "blockCnt": 1,
      "baseAttackTime": 1.6,
      "respawnTime": 70,
      "cost": 21
    }
  },
  "skins": [
    {
      "skinId": "char_4117_ray#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_4117_ray",
      "portraitId": "char_4117_ray_1",
      "illustId": "illust_char_4117_ray_1",
      "modelName": "Ray",
      "drawerList": [
        "Cenm0"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_4117_ray#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_4117_ray_2",
      "portraitId": "char_4117_ray_2",
      "illustId": "illust_char_4117_ray_2",
      "modelName": "Ray",
      "drawerList": [
        "Cenm0"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_4117_ray@shining#2",
      "skinName": "Dreaming High",
      "skinGroupName": "Shining Steps/II",
      "skinGroupId": "2024#shining",
      "avatarId": "char_4117_ray_shining#2",
      "portraitId": "char_4117_ray_shining#2",
      "illustId": "illust_char_4117_ray_shining#2",
      "modelName": "Ray",
      "drawerList": [
        "Cenm0"
      ],
      "description": "<color name=#ffffff>Monster Siren Records Idol Project 'Shining Steps' Promotional Costume/Dreaming High. With high-grade sandbeast feed on a Rim Billiton regional audition's prize list, Ray doesn't mind taking on a new challenge.</color>",
      "rarity": 162
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "3-12",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 904,
            "atk": 547,
            "def": 103,
            "magicResistance": 0,
            "cost": 17,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1190,
            "atk": 720,
            "def": 140,
            "magicResistance": 0,
            "cost": 17,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "4-9",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1190,
            "atk": 720,
            "def": 140,
            "magicResistance": 0,
            "cost": 19,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1507,
            "atk": 900,
            "def": 180,
            "magicResistance": 0,
            "cost": 19,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3241",
          "count": 5,
          "type": "MATERIAL"
        },
        {
          "id": "30032",
          "count": 8,
          "type": "MATERIAL"
        },
        {
          "id": "30042",
          "count": 4,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "4-9",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1507,
            "atk": 900,
            "def": 180,
            "magicResistance": 0,
            "cost": 21,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 1933,
            "atk": 1072,
            "def": 228,
            "magicResistance": 0,
            "cost": 21,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3243",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30125",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30014",
          "count": 8,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_ray_1",
      "skillName": "Parting Shot",
      "desc": "Fire a special bullet, dealing <@ba.vup>{atk_scale:0%}</> of ATK as Physical damage and pushing the target back <@ba.vup>significantly</>. If target is defeated, the next reload loads <@ba.vup>{cnt}</> additional bullet(s)\n<@ba.rem>Can store 2 charges</>",
      "iconId": "skchr_ray_1",
      "spCost": 10,
      "initSp": 10,
      "duration": -1,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 4.5
        },
        {
          "key": "cnt",
          "value": 2
        },
        {
          "key": "force",
          "value": 2
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31013",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31064",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_ray_2",
      "skillName": "Area Overwatch",
      "desc": "Passive: When the sandbeast retreats, recover all bullets that hit in the area\nAutomatic: Attack Range <@ba.vup>increases</>, ATK <@ba.vup>+{atk:0%}</>, sandbeast redeployment time <@ba.vup>{respawn_time:0%}</>\n<@ba.rem>Unlimited duration</>",
      "iconId": "skchr_ray_2",
      "spCost": 16,
      "initSp": 0,
      "duration": -1,
      "blackboard": [
        {
          "key": "atk",
          "value": 1.2
        },
        {
          "key": "respawn_time",
          "value": -0.4
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31043",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30155",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_ray_3",
      "skillName": "'See the Light'",
      "desc": "Immediately <@ba.vdown>stop attacking</> until fully loaded, reload interval <@ba.vup>greatly reduces</>, Attack Range <@ba.vup>increases</>, attacks deal <@ba.vup>{attack@atk_scale:0%}</> of ATK as Physical damage and bind the enemy for <@ba.vup>{attack@unmove_duration}</>s\n<@ba.rem>If an enemy is defeated while skill is active, gain {sp} SP when skill ends</>",
      "iconId": "skchr_ray_3",
      "spCost": 30,
      "initSp": 20,
      "duration": 16,
      "blackboard": [
        {
          "key": "reload_interval",
          "value": -1.2
        },
        {
          "key": "attack@atk_scale",
          "value": 3.3
        },
        {
          "key": "attack@unmove_duration",
          "value": 2
        },
        {
          "key": "sp",
          "value": 10
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30063",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31084",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_ray",
      "moduleName": "Ray's Badge",
      "desc": "Operator Ray has demonstrated a remarkable aptitude for storing and unleashing capacitance-based firepower to penetrative ends when facing the enemy.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Sniper Operator during field operations to exercise Hunter responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_ray",
      "moduleName": "Dancing Moonlight",
      "desc": "Human Resources Record File RF-099-47\nDay One\nOperator Ray has been reported missing this morning without submitting any official application to leave the ship. Human Resources is currently collaborating with Field Operations to investigate.\nDay Two\nWhile the Field Operations team conducts searches, we have also reviewed Ray's recent activities. On the night before her disappearance, she attended a private dance, which we consider to be abnormal behavior. We interviewed Alanna, Ray's friend and an intern at the Workshop, for more details. Below is an excerpt from our interview:\n'To think a weirdo like her went to a dance! I would never have believed it was her, but her cookie-shaped bangs were too iconic.'\n'What did she do at the dance?'\n'Umm... She just sat in a corner. Now that's more like something she'd do.'\n'Did she get into contact with anyone during the dance?'\n'Well, there was this old lady with a cane who sat in the corner with her.'\n'Did they interact in any way?'\n'That's the strange part! Neither of them spoke at all. It was as if they weren't at a dance, but sitting in a sauna house!'\nDay Three\nAccording to our investigation, the elderly woman whom Ray interacted with is a retired Operator from the Logistics Department currently on Rhodes Island for Oripathy treatment. She provided the following explanation for her attendance at the dance:\nShe used to be a dance teacher in her youth but had to end her career prematurely due to Oripathy. Now, severe crystallization of her left leg requires her to use a cane for walking.\nStatement from Retired Operator: 'All I wanted was to see young people dance.'\nDay Four\nAfter another futile day of searching, the search party witnessed two 'blue ghosts' as they were about to return. The Field Operators quickly assumed battle formations but broke formation after carefully probing said 'ghosts' with Arts: One of them was Ray.\nNext to Ray was a wasteland burdenbeast, its thick skin folds glistening with a blue hue as it heaved and twisted its massive body, as if dancing. Ray, also covered in a blue light, remained motionless. However, she was smiling like a child—a rare sight.\n[Supplementary Information]\nRay later learned that the blue light came from the dust pheromone of the Fluorescent Originium Slug, which causes intolerable irritation upon contact with the skin. This explained why the burdenbeast appeared to be dancing; in reality, it was writhing in itchiness. As for why Ray could remain unaffected by the itch... her 'excellent' rating in physical resilience is well-deserved. Below is an excerpt from our interview with her:\n'So, why did you suddenly leave the ship?'\n'I wanted to find the big burdenbeasts on the Colombian wasteland and make them dance to the moon again.'\n'Err... Did this have anything to do with the dance you attended? Was it because of the old lady who sat next to you?'\n'Yes. Her eyes showed me that she wanted to dance. So I suddenly felt that it was time to let the burdenbeasts dance again.'\n'... Huh?'\n'Yup.'\n'Well, umm, did you ever meet that old lady again? Maybe you'd like to tell her about your experience?'\n'No... but you're right, that'd be nice. If it's not too much trouble, could you tell her for me?'"
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "This animal almanac's a beauty. Right, from the bookshelves. I've washed my hands, so the pages'll be fine... Yeah, this is your office. Something wrong?",
      "voiceAsset": "char_4117_ray/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "I hear explosions. One min, I'll head down to check. Exhaust fans sound normal, then next is... No, right. Forgot I'm riding with Rhodes Island now. You don't get Originium slugs in the pipes here. Um... Must be Engineering running weapon tests. Sorry about that, breaking your door down.",
      "voiceAsset": "char_4117_ray/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "You can tell how the air's doing from a sandbeast's back, so that's why you see pitsinkers bring one down. If there's poison and it keels over... you buy a new one. But this one wasn't from the shop. I don't even own it, so I don't keep it on a leash.",
      "voiceAsset": "char_4117_ray/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Tales of the supernatural, these tapes said. Didn't really like watching them, but I do feel... Chills, from these? No. It's <i>hot</i> in the dark. The deeper down the pit, the hotter, harder to breathe. Always took yonks for the lift to bring us back up. I'd just stare at the lights in the ceiling, waiting.",
      "voiceAsset": "char_4117_ray/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "Got shooed out of the workshop by Lanns. She wasn't pissed though, just hauled me along to a doctor, then had me on Potlid-watching duty. And watching I love my own body more... That day she asked me what life was like catching Oripathy. But all that came to mind was being down in the pit, staring at the Infected creatures and thinking, 'we're more alike now.'",
      "voiceAsset": "char_4117_ray/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "Proactive? Is this about me applying to rescue Infected...? Remember when you had me treat my wounds? So I have my cotton wads, and they're getting covered in bloodstains, and dust, and Originium shards, and sandbeast fur, and it struck me then: the pit's behind me, a million miles behind, and it's like I'm still being stabbed. Do you think I'm... still carrying the fear?",
      "voiceAsset": "char_4117_ray/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Ninety-seven, ninety-eight... Oh, first time seeing you at the training grounds. You always train at four in the morning too? That's not it? An op said I scared them target practicing here all night...?  But the light went kaput in my accommodation. I wanted to be somewhere lit-up.",
      "voiceAsset": "char_4117_ray/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "I think Amiya's being nice to me. Hiding something and she won't tell me what. But it does occur to me, you know. The giant shadow I saw in a sandstorm as a kid. I might've mistook it. But it's always occurred to me... Doctor, give her these carrot pies for me, would you? She's always so busy and all, I want to be nice back, and care for her.",
      "voiceAsset": "char_4117_ray/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "I've given it some thought. Hijacking Rhodes Island sounds unideal, but dragging you off might leave the whole ship out of order... Hm? Oh, it's just there's some great tales in your database. A few I wanna see with my own eyes, and it'd be nice if you come with. That's the new goal I found. What's wrong?",
      "voiceAsset": "char_4117_ray/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "No scratching, you'll wake the Doctor. C'mon, let's go walkies on the deck.",
      "voiceAsset": "char_4117_ray/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "I passed the Operator tests, Doctor, so thanks for all of you inviting me. That whole chase is over with, but I'm thinking I'll find my new goal on this ship.",
      "voiceAsset": "char_4117_ray/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "That's not danger I can cope with yet.",
      "voiceAsset": "char_4117_ray/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "You know, they wanted to certify me for my professional skills before. Gloompincer made off with the paper that time. Lost to the mineshaft depths... Anyway, there's a few extra things I can do. What's this ship need?",
      "voiceAsset": "char_4117_ray/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "If that tiny patch of sky opened wide... wouldn't people want to chase the sun and the moons?",
      "voiceAsset": "char_4117_ray/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Here, Sandbeast, we need to get going.",
      "voiceAsset": "char_4117_ray/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "I'll take the very front, as always.",
      "voiceAsset": "char_4117_ray/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Sound of muddy air, tracks of animal... I'll keep a watch that way.",
      "voiceAsset": "char_4117_ray/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Fine visibility. I can see more than just danger.",
      "voiceAsset": "char_4117_ray/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Got my bolts kitted.",
      "voiceAsset": "char_4117_ray/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Point where I'm cleaning up?",
      "voiceAsset": "char_4117_ray/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Yeah, you'll hear from me as needed.",
      "voiceAsset": "char_4117_ray/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "You lot stay up there if it gets risky.",
      "voiceAsset": "char_4117_ray/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Threat at my position—yeah, not anymore soon.",
      "voiceAsset": "char_4117_ray/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "I'm hearing movement.",
      "voiceAsset": "char_4117_ray/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "And that's as far as you go.",
      "voiceAsset": "char_4117_ray/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "I'm done rambling in the dark.",
      "voiceAsset": "char_4117_ray/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Sun's out. What a beauty… Sandbeast, let's get home.",
      "voiceAsset": "char_4117_ray/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "This area's clear of danger for now. Doctor, you always been like this? Any problem, you'll solve it?",
      "voiceAsset": "char_4117_ray/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "We'll have to expand the mine out... Hold the treatment for now. Got a lurking threat to handle.",
      "voiceAsset": "char_4117_ray/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "You all leg it. Comms might cut out. If things get grim, I'll leave the most discernible signs I can.",
      "voiceAsset": "char_4117_ray/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Ship's sailing on sandstone… That's strange. Like I've heard it somewhere before?",
      "voiceAsset": "char_4117_ray/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Was I not meant to dodge that? Okay, I'll stay put. You tap me again.",
      "voiceAsset": "char_4117_ray/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Sandbeasts with arcing backs like this should be living in the desert... Wonder why this bugger came with me? Here, got you new food to try.",
      "voiceAsset": "char_4117_ray/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_4117_ray/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Short-term disembarkment application. Rhodes stopping over here's perfect to hunt some sandbeast food. I'll be gone half a day. Offices are deserted—lucky I ran into you... Yeah, it <i>is</i> New Year's today, Happy New Year. So?",
      "voiceAsset": "char_4117_ray/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Weather's fine outside. No dust cloud, and not a Catastrophe billow in sight.",
      "voiceAsset": "char_4117_ray/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Happy birthday to you, Doctor. Made you this cake—it's that giant sandbeast print I photoed... Why didn't you think I'd come? I'm your friend. I'd make you sad forgetting your birthday.",
      "voiceAsset": "char_4117_ray/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "A 'pipe dream'—that's how I hear some people describe Rhodes. My destination's nothing like this ship's—apples to oranges, really—but I've gotten up close and personal with my own dream thanks to you all, and I'm sure you can make yours come true. I know it.",
      "voiceAsset": "char_4117_ray/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "workshop_formula_probability[116]",
      "buffName": "Pitsinker α",
      "desc": "When this Operator is assigned to the Workshop to process <@cc.kw>elite material</>, the production rate of byproduct increases by <@cc.vup>75%</>",
      "skillIcon": "bskill_ws_evolve2",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "workshop_formula_probability[126]",
      "buffName": "Pitsinker β",
      "desc": "When this Operator is assigned to the Workshop to process <@cc.kw>elite material</>, the production rate of byproduct increases by <@cc.vup>80%</>",
      "skillIcon": "bskill_ws_evolve3",
      "phase": "PHASE_2",
      "level": 1
    },
    {
      "buffId": "workshop_formula_drop[040]",
      "buffName": "Boulder Anchoring",
      "desc": "When this Operator is assigned to the Workshop to process <@cc.kw>Elite materials</>, any byproducts of <@cc.kw>T3</> quality produced will be <@cc.kw>Orirock Clusters</>",
      "skillIcon": "bskill_ws_drop_orirock",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}