{
  "id": "char_4140_lasher",
  "meta_info": {
    "name": "Sand Reckoner",
    "appellation": " ",
    "voiceActor": {
      "en": "Ashton Leon Frank",
      "jp": "Kikunosuke Toya",
      "kr": "Park Seong-yeong ",
      "cn": "Li Qingyang"
    },
    "rarity": 5,
    "profession": "Supporter",
    "subProfessionId": "Summoner",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "Summon",
      "Slow"
    ],
    "nationId": "Sargon",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Sand Reckoner\n[Gender] Male\n[Combat Experience] None\n[Place of Birth] Sargon\n[Date of Birth] Jun 15\n[Race] Liberi\n[Height] 170cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Standard\n[Mobility] Standard\n[Physical Resilience] Normal\n[Tactical Acumen] Standard\n[Combat Skill] Normal\n[Originium Arts Assimilation] Excellent",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Sand Reckoner, former overseer of Menat-Ha'mait's gem trading post. He has reached a cooperative relationship with Rhodes Island after being introduced by Operator Papyrus, using his funds and contacts to support our operations in the eastern regions of Sargon.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Sand Reckoner shows no signs of Originium infection.\n\n[Blood Originium-Crystal Density] 0.16u/L\nSand Reckoner has handled all sorts of gems for many years, including ones containing active Originium impurities or etched with unusual Originium circuits. Despite taking reasonable protective measures, his BOCD is still at relatively dangerous levels.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Bustling Menat-Ha'mait is Sargon's most famous center of the gem trade. Within its many, many stores, the ancient gem trading post occupies a unique position. Gems are not sold to the public here, and its overseer is no ordinary merchant. Their position is more like a decision-maker or defender of the gem trade as a whole. Almost all of the rarest jewels in the city are appraised by the overseer, every gem store in the Grand Bazaar requires their permission to open for business, and large foreign caravans often stop by the trading post. When merchants enter the building, they will respectfully place a dinar on both sides of a golden set of sales on the shop counter, signifying their honest bearing and clear conscience.\nThree hundred years ago, the trading post had only just been built, and the Grand Bazaar was more known for its shoddy goods than anything it is famed for today. However, thanks to the painstaking efforts of generation after generation of overseers giving their all, Menat-Ha'mait widened its area of trade, and the influence and respect the trading post held grew alongside it. Merchants were more willing to accept the order brought about by the trading post's restrictions as the days went by.\nNone could say why the overseers have been so devoted to their cause for hundreds of years, keeping their distance from all in the name of fairness. This devotion and neutrality are innate to the position. When Sand Reckoner took over his ill mother's duties at the age of fifteen, none asked him about his personal affairs, or gave him any more respect than usual.\n'Appraising the worth of gemstones, gathering information in the market, and serving each and every customer fairly. These are our duties, and I have learned them from my parents since a young age.\n'But there is one thing we will not do. We overseers will not place our own coin on the scales. Though we maintain fairness and impartiality in the trade, we cannot say we ourselves are without sin... We cannot.'\nBy the time he told us all this at Rhodes Island, Sand Reckoner had left the trading post, donating his accumulated wealth to help fund Menat-Ha'mait's reconstruction efforts. As he tells it, the lord ameer may decide to personally appoint a new candidate to take over the post, or the people might figure out a way to make things work without an overseer in charge. Of course, none of that has anything to do with him or his collaboration with Rhodes Island. He is now starting his work anew in another town, and when it comes to soliciting investment, he has shown outstanding talent, alongside an unexpectedly modern streak in his thinking.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "In the past, there were two things helping Sand Reckoner perform his duties as overseer: his Originium Arts, and the use of clockwork fowlbeasts using techniques passed down his family.\nHis unique Arts allowed him to assess gems in a simpler manner compared to the methods employed by his ancestors. Menat-Ha'mait's standards for gemstones are quite different compared to other locales, especially those outside Sargon. Here, it is not size or clarity that is the most important factor, but whether or not they have been etched with Originium circuits by ancient craftsmen, or what effect said circuits entail. Sand Reckoner's Arts have an unusual tactile component. If he judges a jewel as having a circuit with a calming effect on people, he would not need to break out a magnifying glass to have a closer look. Rather, he would be able to 'touch every facet of the gem, both inside and out.'\nThese Arts can also be used to activate unique Originium circuits within his clockwork fowlbeasts. One told to fly dozens of meters into the distance can still be used to extend the range of his perception. However, the only things he can sense in this manner are disturbances caused by objects passing by. Most of the time, these clockwork fowlbeasts seem to be used in a similar manner to modular drones, performing tasks such as reconnaissance, transportation, or orientation. The businesspeople of the Grand Bazaar are all familiar with these azure chirpers, and will often invite one to 'witness' a trade deal, but it should not be assumed the distance one can fly is limited to the bazaar. Robberies outside the city, traces of lost lapidary workshops in the sands... Gem trade-related news from outside Menat will be brought back to the trading post, for the overseer to mention as he pleases during a discussion.\nThanks to their boundless curiosity, Engineering has dismantled several clockwork fowlbeasts supplied by Sand Reckoner. Their internal structure is incredibly complex, as expected. It can only be speculated that the core technology behind them are Originium circuit etching techniques of legendary quality. Sand Reckoner himself only knows a fixed procedure to create one, and cannot explain the theory behind the technology involved, or how to appropriate it for other uses. Despite the disappointing research results, Engineering knows this is simply yet another ancient Sargonian secret. There are many marvels of eld that still hold up to modern scrutiny. Perhaps they are still buried in the sands, lost to time, or perhaps they are hidden away behind the high walls of the mysterious City of Gold.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "When Sand Reckoner was being introduced to Rhodes Island to establish a partnership, Papyrus mentioned a rumor hounding him that she had slight concerns about: apparently, his bloodline is cursed, with each and every member of the family suffering from some unforeseen disaster. None have met a happy end. As our partnership progressed, we were able to confirm why Sand Reckoner, whose ancestors have been involved in the gem trade for generations, has such an interest in us and other international medical firms. It mostly stems from him seeing many of his relatives waste away from disease. By having more medical resources at hand, he hopes more lives can be saved.\nRhodes Island is not one to believe in curses. Medical performed a comprehensive examination of him, including a thorough check of the family medical history he provided, and ruled out the presence of a rare hereditary disease. We have seen many unknowingly infected by exposure to active Originium, and with his BOCD clearly higher than average, Medical turned their gaze towards his former living space, conducting a series of tests on the distinctive Originium-etched gems of Menat-Ha'mait. Once the tests were complete, Medical was able to tell him that under specific circumstances, gems with inlaid Originium circuits were able to influence the minute particles of Originium in everyone's bloodstream. In the trading post, where vast quantities of various etched gems were gathered, blood Originium could have been incited to grow, aggregate, or affect nerve centers. Thankfully, Sand Reckoner has already left his former domicile, and this so-called 'family curse' will likely have no further effect on him.\nSurprisingly, upon hearing this news, he merely nodded and stated how happy he was that his ancestors' conjecture turned out to be correct. It's clear his family had figured out the truth a long while back. They simply never considered leaving the trading post. They held their ground until the day their mission was completed.\n\n[Classified File]\nOperator Sand Reckoner has already informed Rhodes Island of his family's true duty, in its entirety. Though he has kept a few things hidden, we can speculate that the individual his family wished to return their gems to is one of Sargon's Zhayedans, or perhaps the general that had been transformed via similar techniques, ones that spared him from age and decay. It is not our place to judge whether or not what the Sargonians see as 'eternal life' is a true continuation of life, or what state the Zhayedan soldiers are in. When it comes to Sand Reckoner and his family, perhaps the guilt that weighs heaviest on him is not in 'scattering the gems' or 'suspending the Zhayedan's life', but in being the first to tell another all this.\nIt can be inferred that over the last three hundred years, every member of his family abhorred the idea of spilling their secrets. They stayed silent about their heavy burden, and called few their friends. It all served to cultivate a distant, impersonal image of the overseers. Sand Reckoner is no doubt the luckiest of them. Of all the generations of overseers futilely reckoning the measure of each and every grain of sand, it was he who saw the day the gems were all returned. More importantly, however, is that he was willing to tell us everything. This means he and his family have truly found forgiveness.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Everyone, I know you've been making bets on Sand Reckoner lately, including but not limited to: 'whether or not placing two pet cloudbeasts in the reception room will make him come to discuss cooperative trade orders more often,' 'when he will add Rhodes Island's proprietary pet nutrient paste into his procurement list,' and 'who will be the first to run into him talking to his clockwork fowlbeasts'... I'm hoping you all, especially those of you who've been leaving your pets with him when he's alone, will curb your curiosity a little. I know his love of small animals is an open secret, and I know you don't mean any harm, but it's quite rude to keep an eye on one of our guests like this.\n—An excerpt from a Logistics meeting\n\nWe've gotten the answers to those questions. First, he doesn't like having cloudbeasts in the reception room. An HR operator bringing him some files saw him use one of his clockwork fowlbeasts to patiently lure the cloudbeast out of the room beforehand, saying small animals might knock over ink pots and the like and really shouldn't be allowed into business areas. Seems he has plenty of experience with this sort of thing. But when the pet nutrient paste was mentioned, he said he didn't have any pets. He also emphasized that his Sargonian business contacts usually preferred exotic or hard-to-tame beasts, and would have little use for the nutrient pastes our operators were making.\nAs for whether or not he chats with his clockwork fowlbeasts, one brave operator decided to simply ask the man himself after several days of fruitless observation. This sort of abrupt questioning naturally confused him, so the operator decided to offer an analogy. 'Y'know, like one of those fairy tales where people will yell their feelings into the woods or something,' to which he replied 'I don't have much to say in the first place.'\n...Going back on my word? No, I haven't. Sure, it's rude to poke your nose into a guest's breathing space like that, but don't forget he's now one of our collaborating operators. The way I see it, he's a touch too serious all the time, so it's worth an occasional reminder from us that he's not an overseer standing behind a counter for three hundred years any more. He's just a regular twenty-year-old operator, codename Sand Reckoner.\n—Another excerpt from a meeting several weeks later",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Records from the gem trading post for the last several years]\nDamaged item(s): clockwork fowlbeast, one\nCause of damage: getting caught by a stray cloudbeast\nNotes: must upgrade the fowlbeast's perception and mobility. (This note is crossed out)\nFollow-up: clockwork fowlbeast has been restored.\n...\nDamaged item(s): gifts of balsam, three boxes\nCause of damage: Unused since opening\nNotes: Mio says they can clean themself, and will choose body washes and balsams with suitable smells of their own accord.\nThe storeroom is still locked, and there are no traces of damage on the walls or ventilation ducts. As Mio said, I have no means of stopping them from entering at the moment.\n...\nDamaged item(s): fresh seafood, twelve types\nCause of damage: Was not promptly eaten\nNotes: Mio does not enjoy eating raw food. They suggested I improve my quality of life so that we can share a meal together.\nFollow-up: the aforementioned seafood was eaten by a black beckbeast.\n...\nDamaged item(s): gemstone storage cabinets, five\nCause of damage: damaged by Woof during a test of strength\nNotes: my Arts are not at the level of being able to appraise the effect of this giant gem etched with an Originium circuit. I believe it may be one of the gems we seek. Woof helped me use new materials to craft a new storage cabinet, one that does not use any of the security measures that have already been broken by thieves in the past.\nMio told me they were not actually a cloudbeast, and Woof was no beckbeast. They appear as statues around the city, on frescos and within ancient texts. They can speak, and the trading post's strictest security measures do not affect their comings and goings in the slightest. All clear proof they are no ordinary animals, but they also have means to hide these abnormalities from me. They told me the tale of the trading post and the duties of the overseer, the appearance of the vault guardian I have not yet met, as well as how more than a hundred years ago, they advised my ancestor to entrust the sole gem they found to a local collector for safekeeping. The logic was that if the gems we sought were ever gathered in one place in the future, thieves or worse were sure to take notice.\nI have met with this collector and confirmed the truth of Mio's words. I then learned from Woof that there was another gem being kept at the city's museum. I now knew the whereabouts of three of the gems, including the one I happened to obtain in a trade a few days ago.\nI believe Mio and Woof are symbols of fate's guiding hand, but they disagree. Mio says they're only at the trading post because they wanted a pet of their own to talk to. They chose me.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 814,
      "atk": 387,
      "def": 132,
      "magicResistance": 20,
      "blockCnt": 1,
      "baseAttackTime": 1.6,
      "respawnTime": 70,
      "cost": 11
    }
  },
  "skins": [
    {
      "skinId": "char_4140_lasher#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_4140_lasher",
      "portraitId": "char_4140_lasher_1",
      "illustId": "illust_char_4140_lasher_1",
      "modelName": "Sand Reckoner",
      "drawerList": [
        "一千"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_4140_lasher#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_4140_lasher_2",
      "portraitId": "char_4140_lasher_2",
      "illustId": "illust_char_4140_lasher_2",
      "modelName": "Sand Reckoner",
      "drawerList": [
        "一千"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "3-6",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 463,
            "atk": 203,
            "def": 69,
            "magicResistance": 15,
            "cost": 9,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 626,
            "atk": 290,
            "def": 99,
            "magicResistance": 15,
            "cost": 9,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 70,
      "rangeId": "3-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 626,
            "atk": 290,
            "def": 99,
            "magicResistance": 20,
            "cost": 11,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 814,
            "atk": 387,
            "def": 132,
            "magicResistance": 20,
            "cost": 11,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3271",
          "count": 4,
          "type": "MATERIAL",
          "name": "Supporter Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_SUP1"
        },
        {
          "id": "30012",
          "count": 8,
          "type": "MATERIAL",
          "name": "Orirock Cube",
          "rarity": 2,
          "iconId": "MTL_SL_G2"
        },
        {
          "id": "30022",
          "count": 2,
          "type": "MATERIAL",
          "name": "Sugar",
          "rarity": 2,
          "iconId": "MTL_SL_STRG2"
        }
      ]
    },
    {
      "maxLevel": 80,
      "rangeId": "3-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 814,
            "atk": 387,
            "def": 132,
            "magicResistance": 20,
            "cost": 11,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1031,
            "atk": 450,
            "def": 160,
            "magicResistance": 20,
            "cost": 11,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3273",
          "count": 3,
          "type": "MATERIAL",
          "name": "Supporter Dualchip",
          "rarity": 5,
          "iconId": "MTL_ASC_SUP3"
        },
        {
          "id": "31064",
          "count": 9,
          "type": "MATERIAL",
          "name": "Transmuted Salt Agglomerate",
          "rarity": 4,
          "iconId": "MTL_SL_ZYK"
        },
        {
          "id": "31023",
          "count": 12,
          "type": "MATERIAL",
          "name": "Incandescent Alloy",
          "rarity": 3,
          "iconId": "MTL_SL_IAM3"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_lasher_1",
      "skillName": "Winding Up",
      "desc": "Sand Reckoner and all of his Clockwork Fowlbeasts gain <@ba.vup>+{attack_speed}</> ASPD",
      "iconId": "skchr_lasher_1",
      "spCost": 30,
      "initSp": 20,
      "duration": 10,
      "blackboard": [
        {
          "key": "attack_speed",
          "value": 60
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30073",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30155",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 1,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_lasher_2",
      "skillName": "Weighing the Scales",
      "desc": "Immediately obtains 1 Clockwork Fowlbeast. Clockwork Fowlbeasts gain <@ba.vup>+{atk:0%}</> ATK and will prioritize attacking the heaviest enemies. Clockwork Fowlbeast attacks will <$ba.sluggish>Slow</> targets for 1 second",
      "iconId": "skchr_lasher_2",
      "spCost": 40,
      "initSp": 20,
      "duration": 20,
      "blackboard": [
        {
          "key": "sluggish",
          "value": 1
        },
        {
          "key": "atk",
          "value": 0.4
        },
        {
          "key": "cnt",
          "value": 1
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31073",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31074",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_lasher",
      "moduleName": "Sand Reckoner's Badge",
      "desc": "Operator Sand Reckoner has demonstrated a remarkable aptitude in combat through control of Clockwork Fowlbeasts.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Supporter Operator during field operations to exercise Summoner responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_lasher",
      "moduleName": "Traces From the Past",
      "desc": "Lazvar opens the heavy door that has shielded him from people's hostility for more than a decade. Absentmindedly, he grabs the beast teaser hanging behind the door and makes a few flicks towards the inside of the room.\nOne, two, three.\nThe newly-engraved gemstone on the tip of the teaser glows faintly, flickering against the darkness, yet the familiar figure doesn't appear as expected. Lazvar stops. It suddenly dawns on him that Mio is never going to magically emerge from nowhere and rush towards him again. Sighing deeply, he hangs the teaser back.\n'Click.' With a faint mechanical sound, soft light illuminates the depths of the room. Priceless gems, coveted even in Menat-Ha'mait, flood the bookshelves and desks, casting vibrant, colorful reflections. In this most secure and secretive room of the Grand Bazaar, they have silently painted an ethereal illusion.\nThese are the fruits of many years of hard work by Lazvar's family. To protect them from bandits and thieves, Lazvar has memorized the precise position of every brick in these four walls, even noting how they're covered by dust.\nBut none of that matters now, for he is finally going to put his long-carried mission aside and leave this place that has begun to paralyze his mind.\nBefore going, Lazvar needs to pack the most important things first. Wait, what are those things on the list again?\nOh yes, the portrait of Mio, Woof and him from a couple of years ago... Here, right behind the shelf. They persuaded him into getting one as a commemoration of coming-of-age, but after the portrait was completed, Woof insisted on hiding it here, claiming, 'Who has ever seen any beckbeast and cloudbeast as large as us!' Mio was so offended that they refused to eat for two days.\nThat old scratching board of Mio is still under the desk! Actually, it was originally a gemstone pillow they gave him when he was little; after Lazvar fell asleep, Mio would curl up next to his head. Later, the pillow became Mio's scratching board, and so Lazvar wrapped it in a brand-new blanket for them to use.\nOf course, there's also this teasing stick behind the door, which was originally a retractable rod gifted by Woof. It used to have a clockwork fowlbeast attached to it. Mio liked to carry this rod in her mouth, and they would chase each other around the house...\nOther than those things, there's only this pile of gemstones sitting here, their beauty now meaningless to him.\nLazvar takes out a broken clockwork fowlbeast—a prop Mio once used countless times at his bedside to perform their trick of 'swallowing a toy and throwing it up whole again', just to make him laugh. The badly-scratched clockwork fowlbeast now lies quietly in his palm, though. It seems Mio has grown out of these kinds of tricks too.\nLazvar clears the carbon box of exquisite gemstones and refills it with his few cherished memories. After some tugging and bumping, everything falls back into silence.\n'Stop watching. We should leave too.'\nA voice softly rings from a dark corner of the room once Lazvar seems to have gone far enough away."
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "Doctor of Rhodes Island, I hope you fully understand that any extraneous information you provide to me will influence my evaluation of our cooperation... Of course, you can also use this as leverage in your negotiations.",
      "voiceAsset": "char_4140_lasher/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "I use this set of counting rods for accounting. It's a gemstone trading tradition dating back several centuries. You merely set it down like this, then... Ahem, I could show you how to use it, but I normally set it down just to let visitors know I'm busy. Besides, it's faster to use a calculator.",
      "voiceAsset": "char_4140_lasher/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Your company's Engineering Department is very interested in my clockwork fowlbeast, and so I made a batch without surveillance functions. This one is for you... A hobby of mine? Hardly. It's a traditional craft in my family. There was a time when our work was unrelated to gemstones.",
      "voiceAsset": "char_4140_lasher/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "That's true, I took over the gemstone trading post when I was fifteen. For three hundred years since the day the first set of scales went up, the one who stands behind the counter has never been important, much less his age. Visitors need only see order.  Are you perhaps questioning my abilities?",
      "voiceAsset": "char_4140_lasher/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "Are you... reading my medical report? Pardon me if this is inappropriate. It's true that I often injure myself with no rhyme or reason. Some say it's because of a family curse, and my life will be as short as the previous overseer. Still, I lived to see those gemstones returned, and that is more than long enough.",
      "voiceAsset": "char_4140_lasher/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "The caravan that is now disappearing into the golden sands will reach the markets I shall build anew. Once the commerce network is built, the settlement will grow stronger and stronger... Another 'City of Radiance'? No, I would rather it grow naturally. What happens in a hundred years will have nothing to do with me.",
      "voiceAsset": "char_4140_lasher/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Come here, little cutie. Give this can of meat a try. You'll love it, that's right... Uh... No, it's not right! Doctor, since when have you been here? I'm afraid I shouldn't be taking care of your operators' companions. Could you please help get this slumberfoot away from me?",
      "voiceAsset": "char_4140_lasher/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Oh, my apologies. It's been an exhausting journey. I think I fell asleep— Hold on, you needn't have someone take me to the lounge. You were inspecting the cargo manifest. I had nothing to do and so... You want to tell a story to relax? Something about snow? Oooh, very well.",
      "voiceAsset": "char_4140_lasher/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "Trading necessitates weighing your bargaining chips as well as the human heart. After a few rounds of back-and-forth, I already have a good picture of the other party's heart. I feel honored to be able to partner with Rhodes Island, but what do you perceive when you see me...? If you believe this heart will one day grow wings, I shall want for nothing more.",
      "voiceAsset": "char_4140_lasher/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Still asleep? The sands of time are flowing away one grain after another, even if you care not for the gemstone scoured with it.",
      "voiceAsset": "char_4140_lasher/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "I would like to thank Lady Anat for facilitating this partnership, but contrary to what she said, I am no longer the gemstone trading overseer of the 'City of Radiance'. All I have now is the codename known to the merchants, 'Sand Reckoner'.",
      "voiceAsset": "char_4140_lasher/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "A pharmaceutical company cultivating its own bodyguards? Impressive.",
      "voiceAsset": "char_4140_lasher/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "Thank you. If you choose to award medals to make our agreement more ceremonial, I shall prepare a few traditional Sargonian gifts. Do you prefer gold or silver?",
      "voiceAsset": "char_4140_lasher/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "I had a dream. I saw my clockwork fowlbeasts taking flight without returning to me. In the end, I stood in front of a long river empty-handed, yet... I couldn't help but feel relieved, knowing they would roam the skies free, knowing where to fly.",
      "voiceAsset": "char_4140_lasher/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "I weigh gains against losses, good against evil.",
      "voiceAsset": "char_4140_lasher/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Judging by the security forces I've met, this team holds its own.",
      "voiceAsset": "char_4140_lasher/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "The clockwork fowlbeast has taken flight.",
      "voiceAsset": "char_4140_lasher/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "I shall not make deals with war and disaster.",
      "voiceAsset": "char_4140_lasher/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "What is it you are weighing?",
      "voiceAsset": "char_4140_lasher/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "If there is anything you can't see clearly, you can ask me.",
      "voiceAsset": "char_4140_lasher/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Treasures always lead to conflict.",
      "voiceAsset": "char_4140_lasher/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Lives are always used as leverage.",
      "voiceAsset": "char_4140_lasher/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "I'm afraid your value is not as high as you imagined.",
      "voiceAsset": "char_4140_lasher/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Can you offer nothing more?",
      "voiceAsset": "char_4140_lasher/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "They who dwell in darkness will be punished.",
      "voiceAsset": "char_4140_lasher/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "What heavy souls…",
      "voiceAsset": "char_4140_lasher/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Sands gather and disperse, life blooms and withers... You always pick the most difficult among the countless cycles. This is a priceless masterpiece, and I am honored to be its witness.",
      "voiceAsset": "char_4140_lasher/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "I do hope they will receive the forgiveness they deserve.",
      "voiceAsset": "char_4140_lasher/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Do you wish to know their whereabouts, or the best terrain for a frontal counterattack? On this battlefield, there is nothing that I cannot see.",
      "voiceAsset": "char_4140_lasher/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "No need to be disappointed. With a few more weights, the scales shall be balanced.",
      "voiceAsset": "char_4140_lasher/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "I cannot say I agree with post-Crystal Age aesthetic sensibilities.",
      "voiceAsset": "char_4140_lasher/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Do you know how many fingers I've cut for disrupting the scales?",
      "voiceAsset": "char_4140_lasher/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Do you have any thoughts on my electric head-bobbling cloudbeast figurine?",
      "voiceAsset": "char_4140_lasher/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_4140_lasher/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "This is the New Year. The beginning of the changing of seasons, and the day everyone purchases gemstones in hopes of improving their luck. If you need any, I can pick a few for you... You prefer one like mine...? Yes... perhaps starting this year, I should allow myself a little wish.",
      "voiceAsset": "char_4140_lasher/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Doctor, remember to wear some more clothing— Um, my apologies. In the desert, the temperature can vary wildly between night and day. This is our customary greeting to visitors.",
      "voiceAsset": "char_4140_lasher/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "In the past, to ensure that balance was not lost, the overseer was permitted no trusted aides. That's why I never had any time, even if I wanted to celebrate some special day... But if you have any worries, I am willing to lend you my assistance. You have my best wishes, Doctor.",
      "voiceAsset": "char_4140_lasher/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "My family's atonement is a secret, and as such, no one has ever asked me how one is to wash away the whole of Sargon's golden sands. Rhodes Island chose a similarly long-winding road. It is seeing you doubted by others that made me reexamine myself, after which I learned from your experience.",
      "voiceAsset": "char_4140_lasher/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "trade_ord_spd&limit[034]",
      "buffName": "Order Distribution α",
      "desc": "When this Operator is assigned to a Trading Post, order acquisition efficiency <@cc.vup>+20%</>",
      "skillIcon": "bskill_tra_spd1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "trade_ord_spd&limit[035]",
      "buffName": "Grand Bazaar Management",
      "desc": "When this Operator is assigned to a Trading Post, order acquisition efficiency <@cc.vup>+30%</> and the order limit <@cc.vup>+1</>",
      "skillIcon": "bskill_tra_spd&limit7",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}