{
  "id": "char_494_vendla",
  "meta_info": {
    "name": "Vendela",
    "appellation": " ",
    "voiceActor": {
      "en": "Cassandra Lee Morris",
      "jp": "Yu Wakui",
      "kr": "Kim Mi-so",
      "cn": "Jiameng Chang"
    },
    "rarity": 5,
    "profession": "Medic",
    "subProfessionId": "Incantation Medic",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "Healing"
    ],
    "nationId": "Victoria",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Vendela\n[Gender] Female\n[Combat Experience] None\n[Place of Birth] Victoria\n[Date of Birth] May 14\n[Race] Feline\n[Height] 160cm\n[Infection Status]\nConfirmed Infected by medical examination.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Flawed\n[Mobility] Normal\n[Physical Resilience] Standard\n[Tactical Acumen] Standard\n[Combat Skill] Normal\n[Originium Arts Assimilation] Standard",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Magdelene Shaw, survivor of the Sanguinarch's ceremony in the town of Brentwood. More than half the town was razed, including the family greenhouse she so cherished. \nAt the invitation of Rockrock and Feist, she joined the Self-Salvation Corps, offering them her assistance before eventually joining Rhodes Island. After the Londinium incident, she decided on her own to apply to return to Victoria to rebuild her hometown, taking up a post as a local Rhodes Island branch office liaison.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests show the indistinct outlines of internal organs, obscured by abnormal shadows. Originium granules detected in the circulatory system. The subject is confirmed to be infected with Oripathy. \n\n[Cell-Originium Assimilation] 6%\nOperator Vendela does not yet have visible Originium crystals on her body, and requires continued observation. \n\n[Blood Originium-Crystal Density] 0.17u/L\nBOCD is still trending upwards, and it is possible that her condition may severely worsen. \nWe have studied the test results of many Brentwood survivors, and found that their conditions matched that of Operator Vendela's. All have succumbed to acute infection during the incident and suddenly found themselves Infected, and for that reason Medical has already applied for additional psychological counseling.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Vendela first came to Rhodes Island as a patient rather than a member of the Medical Department. Though the records concerning the town of Brentwood as regards to the Londinium operation are still currently restricted, by extrapolating from Vendela's condition it is hard to be hopeful about the prognosis of the other survivors. The long-term impact on their health also appears grim. Vendela is aware of this, and took the initiative to submit an application to Medical, hoping to learn everything she can about Oripathy. According to her statement, because of the town's geography, most residents have historically worked in agriculture and been isolated from industry and cases of Oripathy. As such, they now find themselves lacking in specialists able to assist them in these matters. Currently, she thinks only of how she can help. After all, everyone in town has always treated her so well. \n 'I still remember the first time Vendela tagged along as an intern. She was pretty much as normal as can be. Not many even noticed their new gentle and unassuming co-worker,' said a similarly shy operator as she sentimentally recalled when she and Vendela met. 'Back then, I never imagined that a cheerful girl like her could have gone through such an experience. When the two of us background characters formed a small study group to help each other out, I went over to her room and saw it absolutely stuffed with fresh flowers and stacks of medical reports for her fellow townsfolk. Only then did I realize that even though she looks so quiet and peaceful on the outside, she was secretly doing some ultra-super-duper cool stuff!' \nVendela truly is someone who keeps a low profile, as exasperatedly noted by Rockrock, who has worked with her in the past: 'Magdelene and I were once out on an operation with Logistics working our arses off, but she didn't even think to let people know she'd done anything! That's just not right!' \n 'That's right, we all went to Vendela's private farewell party, since she had already applied for leave to go back home and help rebuild. Medical even gave her special permission to take a batch of Oripathy suppressants. She also agreed to let me come along and help, hehe!' the same shy operator noted excitedly.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Wow, Doctor, you really don't understand Vendela at all, do you?! Obviously you were all together on that Londinium operation that whole time, yet you didn't even know she did flower fortunetelling? Well, I guess it's not that surprising. After all, who'd have time for that when you're busy fighting? Whatever, no excuses, give it a shot when you have time, Doctor. Even my big sister Lancet-2 was really happy with her fortune. What did it say? That's a secret! \n—A certain anonymous operator\n\nWhile at first glance Vendela does not share the same aura of mystique as a diviner like Gitano—since she always speaks with a kind and gentle tone, barely above a whisper—but the results of her flower divination really are as accurate as the rumors say. \n—A certain intern head over heels in love\n\n*Sigh* I don't know who's going around telling people about Vendela's talent for fortunetelling, but now there's always someone sneaking about trying to get her to tell their love fortune, or if a mission will go well, things like that. It's enough to give even her a headache. It's not even that mysterious—you just have to trust that the last petal you pluck will set your fate in stone—but even so, it's far too cruel to those poor flowers! Ever since she came aboard, more and more of the flowers I'm growing go missing, yet she still can't find it in her to refuse anyone. She even had to come to me secretly to ask for help. Doctor, we really should help her out... Oh, but back to the main topic, Vendela may not handle that many breeds of plants, but she's incredibly skilled at caring for them. \n—Lena\n\nThe secret to flower divination? There's no secret, Doctor. It's just a game my grandfather taught me when I was little. Because each kind of flower has a fixed number of petals, all I need to know is what kind of fortune they want told, then I can guess what they want to hear and pick a suitable flower. I love seeing their smiling faces when they find out that their wishes will come true! Huh? You're asking if I can understand the heart of a robot too? ...To be honest, not really, but I do understand the heart of the lady who sticks to the robot like glue. Please please please keep this a secret!\n—Medical Department Operator Vendela",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Mission Report]\nThe reconstruction of Brentwood is proceeding unbelievably smoothly. Although the Victorian Parliament's post-war reconstruction task force has previously suggested that they aid survivors in moving away from the ruins, a majority of residents do not wish to leave where they have lived for generations. And so, with the aid of Parliament, at least 30% of the town has been rebuilt now, but the rest was completely destroyed in the ceremony, with no hope of restoration.\nIt turns out that Vendela's wrecked greenhouse had been rebuilt by the locals from spare materials before we arrived, and they've been taking care of it the whole time. Yet she insisted on turning that small shack into the town's only medical observation post, not only as a temporary resting place for the gravely Infected, but also as somewhere for us to provide further treatment alongside functioning as a liaison office. Fortunately, Vendela is very familiar with the locals, which lets us proceed with our jobs as medics smoothly, and she does her best to settle what few misunderstandings pop up. She also set up a system where staff periodically visit patients' homes and perform tests there, which has already been accepted by the locals.\n\n[Work Conversation Recording]\n...\n'Vendela, are you really not ready to rebuild the greenhouse yet?'\n'It's not time for that. Everyone in town still needs our help... There's an even better use for this place now. I'm sure my grandfather will understand.'\n'It can wait until next year... Right, next year, when everyone's healed up a bit more, and we've managed to make progress on rebuilding the town. We can't guarantee we'll find anywhere bigger to let everyone rest and recuperate.'\n'Let's wait until everyone in town is better, and you don't need my help anymore. Then I'll turn this place back into a greenhouse, just the way that it used to be... Mhm, that's what I think...'\n'Everyone also entrusted me with inviting you all to join in this year's harvest festival... Oh, though it does sound a bit strange to hold a harvest festival in the ruins. Ah, that's right, I still haven't asked Miss Lena to help us prepare flowers for the festival...'\n'Oh, I've been so busy that I forgot to turn off the recording!'\n\nI recognize these seeds. Vendela called ahead to inform me about them. These are new varieties of roses that she bred from local cultivars, and she asked if I had any ideas of my own to add. Perhaps... what's in these other big sacks? These look like crop seeds for faming, and these are... potatoes? Eh? This year was a bumper harvest, so the locals wanted to prepare a special thank-you gift for the returning operators?\n—Perfumer, shocked by the incredible spread of edible crops before her",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Back when you said you wanted to go with the heroes who swooped in and saved our little town, we advised you not to take that risk, but we also knew that that's just who you are—no matter how much you might nod along, you always end up stubbornly following your heart. After the incident, I can understand how you want to hold your breath and keep going, to force yourself to keep walking forward, to do everything you can for our town, but I'm worried you'll lead yourself into a dead end.\nBut thankfully, because of how long we've been apart, this last time you came back you'd grown so big! And though you're not so young anymore, we're all relieved to see you in such good shape! You and your new friends at Rhodes Island have done so much for us, and we'll never forget all the good you've done. I hate to admit it, but while we promised your granddad that we'd take good care of you, in the end it was you who took care of us. We'll try and make sure you don't have to do too much, and help you rebuild the greenhouse and take care of those seedlings you love, and we'll listen to you and the doctors at Rhodes Island... Whenever you're ready to go back to being that carefree young lass from the flower shop, we'll hand your plants back to you right away.\nAh, us old fogeys are getting a little emotional, so we'll have to ask the good doctors at Rhodes Island to pass these words along. Please remember to thank those selfless souls for us.\n—From a recording by a Brentwood resident named Hank, brought out during some of Operator Vendela's daily psychological counselling exercises \n\n[Operator Psychological Record - Vendela 05]\nWhat does Operator Vendela care about the most? It's not easy to summarize without first going back to simpler times for her. During a few sessions, I played a recording from someone familiar to her. She was moved, and admitted with some surprise that she hadn't noticed any change in herself since the time she first left home.\nShe does not actually have any issues with her self-image. Since her grandfather passed away, she started living alone, and has always been slowly maturing into what she believes is a better person. Recent events have not interrupted this in any way.\nThough she looks frail on the outside, she hides an inner strength. Her home and her greenhouse are not simply memories of the past with no meaning for her, they are where she places her hopes for life. Will's optimism, Freda's endurance and sacrifice, her grandfather's gentleness, even the suffering of the Sarkaz that she once met in that small town. These have all already become moments where she got to know herself once more. Sooner or later there will come a day when she realizes that what she truly cares about, and what fuels her urge to never stop moving forward, is her unshakeable hope for the future.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'Why do you keep wanting to come with us, Magdelene?'\n'Our target is in the most dangerous part of Londinium. If we run into anything there, it's going to be way worse than anything we've seen in that little town...'\n'I've already decided, Rockrock. If this war never ends, things like that will just keep happening...'\n'Freda made her choice for the sake of the town. She sacrificed herself for everyone else... Although things might not have gone the way she planned, I don't want everything she did to go to waste.'\n'I'll take on her wish of protecting everyone. And if that wish can only bloom once this war has ended, then I want to see this through to the very end, with my own eyes.'\n'Alright, if that's what you want... Congratulations on becoming a Self-Salvation Corps member, Miss Magdelene.'\n'Hurry up and get going with everyone else, we're leaving immediately. This war... It's about time to wrap it up.'",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1178,
      "atk": 440,
      "def": 80,
      "magicResistance": 20,
      "blockCnt": 1,
      "baseAttackTime": 1.6,
      "respawnTime": 70,
      "cost": 17
    }
  },
  "skins": [
    {
      "skinId": "char_494_vendla#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_494_vendla",
      "portraitId": "char_494_vendla_1",
      "illustId": "illust_char_494_vendla_1",
      "modelName": "Vendela",
      "drawerList": [
        "Studio Montagne"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_494_vendla#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_494_vendla_2",
      "portraitId": "char_494_vendla_2",
      "illustId": "illust_char_494_vendla_2",
      "modelName": "Vendela",
      "drawerList": [
        "Studio Montagne"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "3-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 751,
            "atk": 192,
            "def": 44,
            "magicResistance": 10,
            "cost": 15,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 989,
            "atk": 316,
            "def": 64,
            "magicResistance": 10,
            "cost": 15,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 70,
      "rangeId": "3-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 989,
            "atk": 316,
            "def": 64,
            "magicResistance": 15,
            "cost": 17,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 1178,
            "atk": 440,
            "def": 80,
            "magicResistance": 15,
            "cost": 17,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3261",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30052",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30062",
          "count": 2,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 80,
      "rangeId": "3-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1178,
            "atk": 440,
            "def": 80,
            "magicResistance": 20,
            "cost": 17,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1370,
            "atk": 550,
            "def": 100,
            "magicResistance": 20,
            "cost": 17,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3263",
          "count": 3,
          "type": "MATERIAL"
        },
        {
          "id": "30054",
          "count": 5,
          "type": "MATERIAL"
        },
        {
          "id": "30093",
          "count": 13,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skcom_magic_rage[3]",
      "skillName": "Tactical Chant γ",
      "desc": "ASPD <@ba.vup>+{attack_speed}</>",
      "iconId": "skcom_attack_speed_up",
      "spCost": 30,
      "initSp": 15,
      "duration": 30,
      "blackboard": [
        {
          "key": "attack_speed",
          "value": 90
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30013",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_vendla_2",
      "skillName": "Umbrage of Thorns",
      "desc": "ATK <@ba.vup>+{atk:0%}</>. Makes the ally with the highest Max HP within Attack Range more likely to be attacked by enemies, and when this ally receives an enemy attack, Vendela deals <@ba.vup>{atk_scale:0%}</> ATK as Arts damage to the attacker and activates her Trait on the ally",
      "iconId": "skchr_vendla_2",
      "spCost": 30,
      "initSp": 15,
      "duration": 15,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 0.5
        },
        {
          "key": "taunt_level",
          "value": 1
        },
        {
          "key": "atk",
          "value": 0.8
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30043",
              "count": 2,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31064",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31074",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_vendla",
      "moduleName": "Vendela's Badge",
      "desc": "Operator Vendela has demonstrated a remarkable aptitude for simultaneous aggression and medical treatment while casting.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Medic Operator during field operations to exercise Incantation Medic responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_vendla",
      "moduleName": "Broken Rose",
      "desc": "ORDERED BY / Operator Vendela:\nHi Deepcolor. These fragments came from a stained glass door back home. My grandpa made for my 12th birthday, and fitted it into my greenhouse. Then later on it got destroyed in the war, but I gathered up all the fragments and brought them with me to Rhodes. I planned to just leave them around as a keepsake, but then I heard you can restore stained glass, so I'm sending them to you. Fingers crossed you can make it good as new. Whatever it costs, it doesn't matter.\nThe shards are v. sharp. I've given each a run through soap suds and wrapped them up properly, but please be careful when you get them so you don't cut your hands.\nREPLY FROM / Deepcolor:\nHello. I can tell it was damaged in war; no wonder it's covered in so much grime. I'll need some time to clean it—please wait patiently in the meanwhile.\nREPLY FROM / Operator:\nThank you so much, would it be OK to ask you to save any soil you clean off?\nI know it's dirt, but it's my home soil. I've been raising a flower from home here, growth hasn't been ideal. Maybe it will be more comfortable if I fill its flowerpot with that soil.\nREPLY FROM / Logistics Department:\nAll good. Please come pick up your package tomorrow before 12.\nREPLY FROM / Operator:\nThank you\n(attached: A daisy)\nREPLY FROM / Deepcolor:\nRestoration work went very smoothly—you kept the fragments in such remarkable shape, I hardly found any trouble piecing it all together. However, red has seeped into several pieces' cracks, which is spoiling the original design. My suggestion is substituting those with pieces of brand new glass, onto which I can paint using the original design.\nREPLY FROM / Operator:\nSorry. I'm assuming the red in there is blood I accidentally spilled on it, I thought I managed to clean it all off.\nI think I need some time to consider. Would it be OK if you paused the restoration work for the moment?\nThank you.\nREPLY FROM / Deepcolor:\nIs something the matter, Vendela? I haven't been able to contact you all this time—the glass door has been with me for almost a month now.\nREPLY FROM / Operator:\nVery sorry, Deepcolor. I took a trip home.\nAll that blood on the glass reminded me of something I hate remembering. I once had to sprint through an alley covered in blood, it dripped all over the soil and left these black marks behind, I couldn't bear to look.\nBut on my trip back, I found it blooming with deep red roses in the same alley, maybe some seeds from my pocket fell too back then, and they took up that blood as nutrients, and then they bore flowers to all the sun and rain.\nI'd like to keep that bloodstained glass. Could you repaint on top with these gorgeous flowers if that's OK? They have blood's color, and its warmth too.\n(attached: One of my roses from home, I've used Arts to keep it fresh, in hopes you'll feel the beauty of it too)"
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "I can choose my own workplace? Thank you, I'll have the documents over shortly! Hmm, was the Convalescent Garden this way... or that way? Sorry, I'll still need you to show me the way after all…",
      "voiceAsset": "char_494_vendla/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "My grandfather told me how wild roses used to grow all over behind the town. White ones, red ones, out in the mountains and fields... Children loved them. Dignitaries took pride in them... But I never saw any. Perhaps he just wanted to trick a naughty child into going to sleep...",
      "voiceAsset": "char_494_vendla/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "The sunlight through the glass, the town's humid air, the aroma of petals and soil... Those were what made naps special for me, alone in the afternoons. No one would ever bother me—at most they'd quietly leave behind their coin, and take what flowers they fancied back home. At least, that's how it was until the tragedy.",
      "voiceAsset": "char_494_vendla/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "I was bringing some seeds back, and Lena was smiling at me the whole time. Why...? Oh, I didn't even notice I had dirt on my face! I feel like when I get busy, I start letting all sorts of things slip my mind. Has it been this way? Well... I used to never have so many worries in the first place.",
      "voiceAsset": "char_494_vendla/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "I don't think me stepping onto the front lines was an act of bravery. My time in the Self-Salvation Corps wasn't that dramatic either. My hometown's gone and I had nowhere to go. All I could do was carry on my friend's last wish, and never look back. Isn't that what war's all about?",
      "voiceAsset": "char_494_vendla/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "Do you think flowers can grow once more, in steel and soil's gaps? Ever since I saw again what that city of iron's become, the question has been bothering me. Maybe Rockrock was right—I'd better take a bag of seeds back home after the war dies down... You don't think we'll be waiting too long?",
      "voiceAsset": "char_494_vendla/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Excuse me, Doctor, I'm not getting in the way of your sunbathing, am I? I like it here too... The portholes might not be that big, but their sunlight's enough for these flowers to grow. What do you think? It worries me when a place feels lonely, so I took the initiative to decorate the room with them.",
      "voiceAsset": "char_494_vendla/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Doctor, watch out for the thorns on the stems! It's not that I don't want to pick them for you, it's just that they haven't reached the peak of their beauty yet. Hm...? You'd like to help me take care of them? Oh, no problem. Do you need me to teach you how?",
      "voiceAsset": "char_494_vendla/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "To be honest, my greatest wish would be to return to my hometown, and rebuild my greenhouse. Doctor, are you laughing? I'm guessing you—think I should have loftier dreams...? No need, you say? Heheh, I suppose. Well, not that this'll be easy either, seeing as my hometown's rubble now.",
      "voiceAsset": "char_494_vendla/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Take a deep breath, Doctor. The scent of roses will put your mind at ease.",
      "voiceAsset": "char_494_vendla/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Greetings, Doctor. Vendela reporting in. Um, what did Rockrock write for me next, I can't remember... Never mind! Please take this flower, I insist! Its meaning is good luck.",
      "voiceAsset": "char_494_vendla/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "The method's a perfect fit. You prune leaves and branches the same way.",
      "voiceAsset": "char_494_vendla/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "A promotion? Then may I request a bigger room? No... It's not that I can't get used to it. I just have more and more roses in my room, and they need more sunlight... Okay, maybe the same goes for me.",
      "voiceAsset": "char_494_vendla/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "Don't worry yourself about these entangled thorns. They're just trying to protect me.",
      "voiceAsset": "char_494_vendla/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "I'll try my best to help everyone out.",
      "voiceAsset": "char_494_vendla/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Everyone, please follow where the petals flutter.",
      "voiceAsset": "char_494_vendla/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Don't be afraid of the thorns. They are here to help us.",
      "voiceAsset": "char_494_vendla/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "I won't allow them to trample apart this land!",
      "voiceAsset": "char_494_vendla/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Ugh, there's a bad scent in the air.",
      "voiceAsset": "char_494_vendla/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Will it really be possible to plant seeds here?",
      "voiceAsset": "char_494_vendla/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "I like these high places. They have plenty of sunshine.",
      "voiceAsset": "char_494_vendla/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "I heard someone tried planting sunflowers on the roof? Not a bad idea.",
      "voiceAsset": "char_494_vendla/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Watch out for the thorns.",
      "voiceAsset": "char_494_vendla/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Bloom forth!",
      "voiceAsset": "char_494_vendla/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Pay attention to where the petals fall.",
      "voiceAsset": "char_494_vendla/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "What blooms, must also wither.",
      "voiceAsset": "char_494_vendla/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Do you see the dew shimmering on the petals? Such splendid scenery in the morning light… We wouldn't be enjoying this if not for you.",
      "voiceAsset": "char_494_vendla/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Scything, uprooting... It sounds cruel. But if we want to deal with the weeds competing for nutrients, then I think there's no other way, Doctor.",
      "voiceAsset": "char_494_vendla/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "While on the front lines, I caught a glimpse of an unforgettable field of flowers, blooming with vigor and vitality. I was always curious where their nutrients came from. Now, I think I know…",
      "voiceAsset": "char_494_vendla/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Their petals... have crumbled away.",
      "voiceAsset": "char_494_vendla/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Cold and isolated... Is this the sort of atmosphere you prefer, Doctor?",
      "voiceAsset": "char_494_vendla/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Oh! Did you want to buy some flowers?",
      "voiceAsset": "char_494_vendla/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Eep. You knocked the flower out of my hair.",
      "voiceAsset": "char_494_vendla/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_494_vendla/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Happy New Year, Doctor! Oh, the gift in front of everyone's room? That's poinsettia. In the past, I'd leave a bouquet at each and every doorstep to celebrate New Year's Eve... I didn't want this beautiful custom to disappear because of that incident.",
      "voiceAsset": "char_494_vendla/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "You spotted it, Doctor? That's a new variety I've been breeding. Do you like it?",
      "voiceAsset": "char_494_vendla/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Doctor, these little florets are for you. They grow all across the outcrops and pastures of my homeland. Even when gales level them flat, all they need is a little bit of sunshine, and they'll bloom forth again with renewed vitality. Isn't that just like us Victorians? Thank you for everything you've done, and happy birthday.",
      "voiceAsset": "char_494_vendla/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "I was going around the greenhouse collecting all the fresh buds, when it suddenly struck me how long it's been since that tragedy. Do you think I'll be able to rebuild my greenhouse back home? I know you might not have all the answers, but somehow, seeing everyone brimming with confidence... just puts my heart at ease too.",
      "voiceAsset": "char_494_vendla/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "dorm_rec_all[023]",
      "buffName": "Aroma Convalescence α",
      "desc": "When this Operator is assigned to a Dormitory, restores <@cc.vup>+0.15</> Morale per hour to all Operators assigned to that Dormitory (Only the strongest effect of this type takes place)",
      "skillIcon": "bskill_dorm_all4",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "dorm_rec_all&tired[000]",
      "buffName": "Aroma Convalescence β",
      "desc": "When this Operator is assigned to a Dormitory, restores <@cc.vup>+0.15</> Morale per hour to all Operators assigned to that Dormitory and restores an additional <@cc.vup>+0.1</> to Operators whose Morale is below <@cc.vup>18</> (Only the strongest effect of this type applies)",
      "skillIcon": "bskill_dorm_all_tired",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}