{
  "id": "char_437_mizuki",
  "meta_info": {
    "name": "Mizuki",
    "appellation": " ",
    "voiceActor": {
      "en": "",
      "jp": "Ayumu Murase",
      "kr": "Kim Yul",
      "cn": "Ruth"
    },
    "rarity": 6,
    "profession": "Specialist",
    "subProfessionId": "Ambusher",
    "position": "MELEE",
    "team": "",
    "tagList": [
      "DPS",
      "Crowd-Control"
    ],
    "nationId": "Higashi",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Mizuki\n[Gender] Male\n[Combat Experience] None\n[Place of Birth] Higashi\n[Date of Birth] Mar 22\n[Race] Ægir\n[Height] 161cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Standard\n[Mobility] Normal\n[Physical Resilience] Standard\n[Tactical Acumen] Normal\n[Combat Skill] Normal\n[Originium Arts Assimilation] Flawed",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Mizuki came in contact with some of our operators in the Bolívarian city of Dossoles, and accompanied them back to the landship. After preliminary operator-related interviews and inspections, he was approved for a temporary stay.\nHis learning ability is rather exceptional, and at this stage, he is suitable for civilian work or and we may consider training him to become an operator. After further investigation and evaluation, he was approved for a long-term stay aboard the landship.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this individual is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nThis individual shows no signs of Originium infection.\n\n[Blood Originium-Crystal Density] 0.07u/L\nThis individual rarely comes into contact with Originium.\n\n\nWarning: Insufficient clearance. Higher authorization from the Medical Department is needed to view certain detailed physiological parameters.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Mizuki, according to his own account, was born in a remote village near the coast of Higashi. When he was young, his village was razed, looted and ransacked by deserters-turned-bandits from the nearby mountains. As he laid dying amongst ruins and corpses, he was fortunate enough to have been saved by a traveling elder, who then took him to the nearest nomadic city for treatment.\nThe process was actually a detour for us— after all, Rhodes Island can't just take in strange children or any old runaway— We contacted local operators via Messengers to cross-check the region's records, confirming that there was a case of bandits slaughtering, razing, and burning an entire village some ten-odd years ago. At the time, when the authorities were tipped and moved to apprehend the bandit gang, they discovered all that remained was a few, semi-conscious individuals, babbling incoherently while curled up in their makeshift dens. When pressed about the whereabouts of their fellow perpetrators, these people only stared back with horror, shouting broken phrases such as 'I don't have it' and 'Don't eat me.' As strange as this situation was, the trail went cold and the authorities were no longer able to track down the other perpetrators, leaving the case in limbo.\nNeither here nor there. Who could object to taking in a polite, well-behaved boy who never causes trouble? Not that I've got anything against our rowdier, less well-behaved troublemakers.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "During the investigation, our operators learned Mizuki had been an apprentice in a local restaurant after being rescued as a youth. Though these events occurred many years ago, the restaurant owner was more than glad to talk about the past upon our operators' request. At first, the owner saw Mizuki as a thin and feeble country boy, but discovered that he was unexpectedly nimble with his hands and feet, and was an exceptionally fast learner, with an even greater knack for cooking. His savvy earned him the praise and acceptance of the head chef, and some of his suggestions to adjust the condiments and portions of certain dishes were accepted, to the great acclaim of customers. Unfortunately, the dishes Mizuki made with his own hands always went somewhat awry, and after many failures, Mizuki left this matter behind without regret.\n\nAs a matter of fact, we tried to get him to show us some of his handiwork, and well... how should I put this... The food itself was in line with his own self-assessment, the freshness and vitality of the dish's ingredients having been retained, any fishy odors eliminated, and seasoned to perfection. Yet despite the final product clearly being static, the food gave off the impression of life within it, which made it difficult for diners to enjoy... But for the more courageous colleagues who were able to try the food, they could only praise the flavor.\n\nThough I have no hard proof and this is just a hunch of mine, but — did he use some special method to lock in the freshness of the ingredients, and in the process, also fix a portion of the ingredients' 'vital force' as a form of 'nutrient?'",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "I don't look at all like a kid from the sticks dressed like this? Ah... Well, money isn't much of an issue for me nowadays, but I'll admit, things were rough back then. After all, I didn't exactly have a lot of choice for ways to earn my keep at such a young age.\nLuckily for me though, a lot of people helped me out along the way. The owner of the restaurant, the manager of the retro games store, the magazine editor, the young talent scout of the brokerage... Of course, there were some not-so-nice people along the way too.\nStill, they gave me what I needed to travel all over, to learn about all different kinds of stuff, and see all the incredible things in the lives of people across the world. That's its own reward.\nI guess you could say I followed the old man... The one I mentioned before, the old man who saved my life. He was always thinking about things, recording them, but wouldn't talk about them.\nAs he used to say, we should absorb the good from around us, and expel the bad from within us to better ourselves; and as long as everyone does it that way, we'll make the world under the stars that much more beautiful. I tried to live that, traveling the world and learning as much as I could to better myself. I eventually figured out this isn't just a theory, it's a truth of the world. It's easy for evil to wipe away good, but in the end, it's got nothing to offer.\nAnd so I realized humanity needs a lot more than just getting along and learning if it's going to make that future...",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Miscellaneous Records]\nWhy must we go out of our way to spread suffering to our fellow man? Is it a weakness in the way our species lives? Or is it due to a lack of bridging and communication between individuals? Or is it perhaps a fundamental inferiority planted within our species?\nWhat should we do to make ourselves better and more beautiful, so that we may escape from all this? In this regard, even my like-minded colleagues have vastly different opinions, and make great haste to confirm their views.\nAs for me, well, the older I become, the more confused I become, and the less I understand whether the things I've done to this point objectively move me closer to the answer. I've even come to doubt some of my original views, and I feel like I'm unable to answer with confidence— when confronted with calmly accepting one's demise, or struggling to live on at any cost, which option is true fortitude That is why I chose to go beyond the Church in Iberia, to embark on a pilgrimage, and to entrust this matter to the people that I would meet – to those people who had no choice but to make that choice. Of course, people tend to choose the latter option out of instincts, but most specimens have confirmed that instinct alone cannot give rise to true fortitude. Those who choose to swallow the contents of the box I give them in order to continue to live are easily crushed, easily destroyed, easily lose themselves. But at least they still survive, and have a healthier body and constitution that consumes fewer resources. However, these cases are not enough to answer my question — can this truly count as making their 'self' better?\nBut within the most unlikely of happenstances, there will be those like this child. Those who can attain victory through their own will and perseverance, and better their 'self.' I have neither the qualification nor authority to teach them how to continue improving in the future, as they should have their own answers after enduring their trials. The best thing for me to do is to leave quietly and wait to bear witness to their future.\nPerhaps I've long lost the resolution and tenacity I had when I first walked down this path until I became the Bishop. Perhaps the way I've explored this question has been but trickery, using deception and exploitation that cannot be refused. But no matter what, I am absolutely unwilling to give up the answer to the pursuit of kindness and beauty.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Encrypted Message]\nIf you're seeing this information, it proves that you've at least realized the strategic value of the object's behavior – let us use the unfitting term of mercenary for now — from the simulated data, and may even be planning to include him in your normal operational capabilities.\nIndeed, the information in the publicly available records surrounding this subject are largely vague or fabricated. This is also a result of the agreement we reached. As the guarantor and commander of this person, you are required to know more.\n\nIn fact, most of the subject's actual results on our comprehensive examination reach or even exceed the excellent mark by the evaluation standards, with the exception of Originium Arts assimilation. You should already be aware of this — yes, of the supplementary combat methods which he is unwilling to disclose too much. The methods that disrupt vision, hearing, and tactile perception, or even cause hallucinations, are not Originium Arts, but perhaps more biological in nature. Currently, we suspect some form of electrical signal or pheromone. Furthermore, the subject's performance on indices such as physical strength and fitness are likely not inferior to those of professional Operators who've undergone lengthy training, and these lofty results are just what he can achieve with his body.\nPerhaps you might not thoroughly understand what the implications of these test results mean, but I must remind you: he is not one of our operators, nor can he become one of our operators. The subject can only secretly exist as the subject of Rhodes Island Medical Department's cooperative observation project, because in all senses of the word, he is an anomaly. And from the information we already have, I'm afraid that there are at least twenty paranoid researchers permeating all corners of this world, tirelessly working for the same beliefs yet different purposes, increasing the number of cases similar to our subject - intentionally or otherwise. Though there are a few cases in which the subject has enough mental fortitude to not be overwhelmed by an overly powerful biological signal and turned into a thrashing Sea Terror, it doesn't matter if he's supported by his pure survival instinct or something altogether different.\nNow to get back to the point. The Oripathy problem is the chief focus of Rhodes Island, but humanity faces far more threats than just this, many of which have not yet made themselves visible. Therefore, we must ensure that our operators firmly stand with us, and with humanity, in facing the common problems of the future.\nAs for this subject, there are some prerequisite questions that must first be addressed. He may still have the opportunity to choose what he wishes to be, to help whoever he wishes to help, but he has not yet been able to make his own decisions. These are not simple matters, as we don't always understand ourselves correctly. Perhaps you'll be more than happy to provide him with some inspiration, or perhaps you'll want to give him the liberation of free thought?\nBefore you've found the answers to those questions, don't let him draw needless attention. This is to protect him, but also us.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1336,
      "atk": 692,
      "def": 302,
      "magicResistance": 30,
      "blockCnt": 0,
      "baseAttackTime": 3.5,
      "respawnTime": 70,
      "cost": 21
    }
  },
  "skins": [
    {
      "skinId": "char_437_mizuki#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_437_mizuki",
      "portraitId": "char_437_mizuki_1",
      "illustId": "illust_char_437_mizuki_1",
      "modelName": "Mizuki",
      "drawerList": [
        "Namie"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_437_mizuki#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_437_mizuki_2",
      "portraitId": "char_437_mizuki_2",
      "illustId": "illust_char_437_mizuki_2",
      "modelName": "Mizuki",
      "drawerList": [
        "Namie"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_437_mizuki@sale#7",
      "skinName": "Summer Feast",
      "skinGroupName": "Test Collection/VIII",
      "skinGroupId": "2022#sale#4",
      "avatarId": "char_437_mizuki_sale#7",
      "portraitId": "char_437_mizuki_sale#7",
      "illustId": "illust_char_437_mizuki_sale#7",
      "modelName": "Mizuki",
      "drawerList": [
        "Namie"
      ],
      "description": "Test Collection Series/Summer Feast. Mizuki wears this when feasting on the beach. The material is stain-resistant and provides plenty of room for extra appendages.",
      "rarity": 9
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "y-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 760,
            "atk": 372,
            "def": 155,
            "magicResistance": 10,
            "cost": 19,
            "blockCnt": 0,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3.5,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": -1,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1028,
            "atk": 532,
            "def": 229,
            "magicResistance": 10,
            "cost": 19,
            "blockCnt": 0,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3.5,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": -1,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "y-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1028,
            "atk": 532,
            "def": 229,
            "magicResistance": 20,
            "cost": 21,
            "blockCnt": 0,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3.5,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": -1,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1336,
            "atk": 692,
            "def": 302,
            "magicResistance": 20,
            "cost": 21,
            "blockCnt": 0,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3.5,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": -1,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3281",
          "count": 5,
          "type": "MATERIAL"
        },
        {
          "id": "30022",
          "count": 10,
          "type": "MATERIAL"
        },
        {
          "id": "30012",
          "count": 6,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "y-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1336,
            "atk": 692,
            "def": 302,
            "magicResistance": 30,
            "cost": 21,
            "blockCnt": 0,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3.5,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": -1,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 1758,
            "atk": 865,
            "def": 356,
            "magicResistance": 30,
            "cost": 21,
            "blockCnt": 0,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3.5,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": -1,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3283",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30115",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "31034",
          "count": 6,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_mizuki_1",
      "skillName": "Awaken",
      "desc": "The next attack deals <@ba.vup>{atk_scale:0%}</> of ATK as Physical damage and increases the damage multiplier of Mizuki's first Talent to <@ba.vup>{talent_scale:0.0}</> times\n<@ba.rem>Can store {cnt} charge(s)</>",
      "iconId": "skchr_mizuki_1",
      "spCost": 7,
      "initSp": 0,
      "duration": 0,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 3
        },
        {
          "key": "talent_scale",
          "value": 3
        },
        {
          "key": "cnt",
          "value": 3
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30103",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_mizuki_2",
      "skillName": "Prisoner's Dilemma",
      "desc": "Attack Interval <@ba.vup>reduces greatly</>, ATK <@ba.vup>+{atk:0%}</>. Mizuki's first Talent targets <@ba.vup>1</> additional enemy and inflicts <$ba.root>Bind</> for <@ba.vup>{attack@unmovable}</> seconds",
      "iconId": "skchr_mizuki_2",
      "spCost": 15,
      "initSp": 10,
      "duration": 21,
      "blackboard": [
        {
          "key": "base_attack_time",
          "value": -1.5
        },
        {
          "key": "atk",
          "value": 0.3
        },
        {
          "key": "attack@unmovable",
          "value": 1.3
        },
        {
          "key": "attack@max_target",
          "value": 1
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31023",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_mizuki_3",
      "skillName": "Moon in the Water",
      "desc": "Attack Range <@ba.vup>expands</>, ATK <@ba.vup>+{atk:0%}</>. Mizuki's first Talent targets <@ba.vup>2</> additional enemies and inflicts <$ba.stun>Stun</> for <@ba.vup>{attack@stun}</> seconds; When attacks hit less than 3 enemies, Mizuki loses <@ba.vup>{attack@hp_ratio:0%}</> Max HP",
      "iconId": "skchr_mizuki_3",
      "spCost": 60,
      "initSp": 30,
      "duration": 30,
      "blackboard": [
        {
          "key": "atk",
          "value": 1.5
        },
        {
          "key": "attack@stun",
          "value": 1
        },
        {
          "key": "attack@hp_ratio",
          "value": 0.12
        },
        {
          "key": "attack@max_target",
          "value": 2
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31013",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 9,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_mizuki",
      "moduleName": "Mizuki's Badge",
      "desc": "Operator Mizuki has demonstrated a remarkable aptitude for bodily concealment and enemy ambush.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Specialist Operator during field operations to exercise Ambusher responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_mizuki",
      "moduleName": "Entreaty of the Herald",
      "desc": "I thought this child would have long since vanished everyone. But when the tip of his tongue touched upon the Herald's gift, and he kept all to himself, was not drowned in the voice of we many, and did not become a lowly Sea Terror, I conceded that this may have changed things.\nI was meant to prevent that unfortunate plundering, but I did not do so. I watched as those bandits bared their vice. I hold myself in contempt for this inaction of mine. Even if it was to ensure a qualified test subject, to probe at the possibilities for humanity.\nI'm sure the child became aware in time that I could have saved everyone, but one as smart as him has no need to seek answers from me. Yes, he is smart and studious, but he has no reverence for knowledge, nor does he treat it as a simple tool. He seems an uninvolved bystander, examining all he witnesses. Perhaps this is the reason he did not lose himself in his bond to the Herald's flesh. Were he of different birth, he may well have been a scholar of his own school.\nOriginally, no change seemed to occur in the child's body, to the extent I doubted my own research, thereafter deciding to prolong my observation of him. This lasted until he finally found that group of bandits, and cut the flesh from himself to give to them, inquiring if it was their lives plagued of hunger that led them to do evil, and if upon being ensured a life of warmth and plenty they could renounce that evil—\nI thought this child would have long since vanished everyone. But this time, I may well find hope for humanity."
    },
    {
      "moduleId": "uniequip_003_mizuki",
      "moduleName": "Caerulorum Semina",
      "desc": "A great tree begins as a tiny seed. When a new shoot emerges, no one can predict whether it will become a meal for a starving beast or grow into a towering giant with branches reaching to the sky.\nSome individuals may be destined for greatness from birth, standing at the pinnacle of their cohort, but natural laws will eventually push all once tiny creations toward a greater destiny in the currents of time.\nWith enough patience, perhaps one day every sapling will grow into a being even more magnificent than the mightiest tree we can conceive of. Will that day come? Yes, it will. That's why they bear seeds and allow themselves to decay and return to the soil to nourish their offspring, rather than permanently hoarding all the nutrients they take in. This is not an act of pity, but an act of hope.\nNow, if we expand this context to the entire ecosystem, rather than confining ourselves to a specific species, what happens? All living things help each other, cultivate the land and the sea, making the entire planet more abundant and creating a better living environment for ourselves and future generations. Yes, the possibility of this outcome is equally present in every last ordinary seed.\n...\nThat's what the plan should have been, prior to certain unexpected events."
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "Dr. Kal'tsit told me if you ever chose to place me at your side, it means you've decided to protect me. From the looks of things though, Doctor, I don't think you understand what that means? But I know she must've said it for a reason.",
      "voiceAsset": "char_437_mizuki/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Fine dining, comics, games, and the people who created them, are all psalms laid out beneath the starry firmament. And my journey is to taste them all— and to eliminate anything that seeks to threaten them.",
      "voiceAsset": "char_437_mizuki/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Ah, Doctor, you came at just the right time. Quick, come have a taste, I prepared this special sashimi dish using a special technique that best preserves the nutrients and vitality of the ingredients!",
      "voiceAsset": "char_437_mizuki/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "This one, huh? It's a classic arcade game from Higashi, though it's kind of niche now. Want to give it a try, Doctor? Here, you move that yellow mouth around and try to eat as much stuff as you can. But until you've absorbed enough nutrients to become strong, you'll only be prey to others.",
      "voiceAsset": "char_437_mizuki/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "A strong sense of justice? You have the wrong idea, Doctor. I'm personally not that concerned about bad guys, but for various reasons, the people here usually can't do much to them, right? In times like that, if there was some way to make those bad guys disappear... Nobody would lose sleep over that, right? It'd be a breath of fresh air, right?",
      "voiceAsset": "char_437_mizuki/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "Though I don't really understand your rationale, Doctor, what you're basically saying is, only eliminate the people who you've designated as bad guys, right? Because you're a good person, Doctor. What if you were actually a bad guy? Don't say that, that'd be quite troublesome. There's no way I could...",
      "voiceAsset": "char_437_mizuki/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Sometimes, it feels like there's something on this ship... Familiar, yet also foreign. Gentle, yet also seemingly full of hostility. Doctor, it makes me rather uneasy...",
      "voiceAsset": "char_437_mizuki/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Doctor, what does it feel like to take charge of the lives of so many others with your own hands? If I was in your position, I'd feel very warm, maybe wouldn't even be able to resist trembling... Huh? I was talking about you as a commander, holding on to everyone's lifeline.",
      "voiceAsset": "char_437_mizuki/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "I sometimes think, since the food we eat and the nutrients we absorb become a part of us, if we were to eat the same things and do the same things, would we gradually become the same? Doctor... can we?",
      "voiceAsset": "char_437_mizuki/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "It's time to take a little break, Doctor. Come here, lie down. I'll go grab a blanket.",
      "voiceAsset": "char_437_mizuki/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Ah, hello there, Doctor. Dr. Kal'tsit tells me you're my commander from today on! It's too bad I don't count as an official operator, but as long as you need my help, I'll do whatever I can.",
      "voiceAsset": "char_437_mizuki/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "I need to absorb and digest all this, right? I'll do my best.",
      "voiceAsset": "char_437_mizuki/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "I got the nod? Does that mean I can go with you to more places and take care of more bad guys?",
      "voiceAsset": "char_437_mizuki/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "On one rainy day, I received an unexpected gift that changed me, but I was not taught how to face the future. Doctor, if it were you, would you have shown me the path yourself?",
      "voiceAsset": "char_437_mizuki/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "It'd be best to not expose myself to others, even my teammates? Mm, I'll do as you say, Doctor.",
      "voiceAsset": "char_437_mizuki/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "I will protect you from the shadows, Doctor, as well as everyone else participating in the operation.",
      "voiceAsset": "char_437_mizuki/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "The deployment plan and secret missions for this operation... Yes, flawless indeed.",
      "voiceAsset": "char_437_mizuki/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "The enemies, huh. They don't look half bad.",
      "voiceAsset": "char_437_mizuki/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Your orders are my beacon.",
      "voiceAsset": "char_437_mizuki/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "I'm ready to go whenever~",
      "voiceAsset": "char_437_mizuki/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "You always help me find my place.",
      "voiceAsset": "char_437_mizuki/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Weave the tapestry of your tactics boldly and without worry.",
      "voiceAsset": "char_437_mizuki/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "A piece of cake.",
      "voiceAsset": "char_437_mizuki/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Thanks for the treat.",
      "voiceAsset": "char_437_mizuki/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "When did you delude yourself into thinking that these tentacles are mere illusions?",
      "voiceAsset": "char_437_mizuki/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Where there are people, there must be someone to cull the evildoers among them.",
      "voiceAsset": "char_437_mizuki/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "What a tough nut to crack. It'll take some time to digest this battle.",
      "voiceAsset": "char_437_mizuki/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "There are fewer bad guys out there now, and it's all thanks to you, Doctor!",
      "voiceAsset": "char_437_mizuki/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Hm? Doctor, why'd you let some bad guys through? I'll go clean them up for you.",
      "voiceAsset": "char_437_mizuki/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "If you want to cover everyone as they evacuate, I still have an idea... No, just saving everyone isn't good enough. Only by eliminating all the bad guys here...",
      "voiceAsset": "char_437_mizuki/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Shall I whip up something tasty to help everyone unwind?",
      "voiceAsset": "char_437_mizuki/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Hmm? What's up?",
      "voiceAsset": "char_437_mizuki/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Achoo! Ugh... Why does it feel like someone's looking right through me...",
      "voiceAsset": "char_437_mizuki/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_437_mizuki/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Happy New Year, Doctor! We've all grown by another year, and I've absorbed plenty of nutrients. I really hope everyone can keep evolving and become even better.",
      "voiceAsset": "char_437_mizuki/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Did you miss me, Doctor?",
      "voiceAsset": "char_437_mizuki/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "I dunno where it came from… But they say if you mix a little of yourself into a cake, then whoever eats it will go crazy for you. Sounds… sick, right? Wait, Doctor, don't run away! I didn't put anything weird in this birthday cake, I swear!",
      "voiceAsset": "char_437_mizuki/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "Doctor, when you look at me now, what do you see? Am I still just a kid, or have I grown strong enough… maybe even stronger than you? If that were true… Then shouldn't I protect you instead?",
      "voiceAsset": "char_437_mizuki/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "manu_skill_spd1[000]",
      "buffName": "Consciousness Agreement",
      "desc": "When this Operator is assigned to a Factory, provides an additional <@cc.vup>+5%</> productivity for every <$cc.sk.manu1><@cc.kw>Standardization Skill</></> in the same Factory",
      "skillIcon": "bskill_man_skill_spd",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "manu_prod_spd[010]",
      "buffName": "Standardization β",
      "desc": "When this Operator is assigned to a Factory, productivity <@cc.vup>+25%</>",
      "skillIcon": "bskill_man_spd2",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}