{
  "id": "char_4042_lumen",
  "meta_info": {
    "name": "Lumen",
    "appellation": " ",
    "voiceActor": {
      "en": "Jay Rincon",
      "jp": "Yusuke Kobayashi",
      "kr": "Min Seung-woo",
      "cn": "Gary"
    },
    "rarity": 6,
    "profession": "Medic",
    "subProfessionId": "Therapist",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "Healing",
      "Support"
    ],
    "nationId": "Iberia",
    "isNotObtainable": false,
    "itemObtainApproach": "Event Reward",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Lumen\n[Gender] Male\n[Combat Experience] None\n[Place of Birth] Iberia\n[Date of Birth] June 12\n[Race] Ægir\n[Height] 177cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Normal\n[Mobility] Normal\n[Physical Resilience] Standard\n[Tactical Acumen] Normal\n[Combat Skill] Normal\n[Originium Arts Assimilation] Normal",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Lumen, on the recommendation of Elysium and Kal'tsit, is now working as a Rhodes Island operator in Iberia, helping render medical aid to Infected persons in Iberia's territories. Additionally, Lumen will also participate in joint meetings between Rhodes Island, Ægir, and the Inquisition, offering suggestions based on his own perspectives and working with all parties to find a possibility of mutual aid in the face of future contingencies.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, the operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Lumen shows no signs of Originium infection.\n\n[Blood Originium-Crystal Density] 0.12u/L\nOperator Lumen rarely comes into contact with Originium. He fully understands how to take care of others, but we hope he can pay a bit more attention to his own health and not overexert himself.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Operator Lumen, real name Jordi Fontanarossa, was born in an Iberian town on the decline named Gran Faro, and has long worked there as a caretaker for the local church. Perhaps because his guardian there was the town's mayor, Lumen's status as an Ægir Islander did not bring him any trouble for a long time, a rare occurrence in areas under the direct control of the Inquisition. \nHowever, a more likely possibility is, the person most responsible for Lumen's peaceful life is himself. Putting aside his identity or profession, this operator has an innate affinity for carefully paying attention to the needs of each person around him, and reaching out at the right time. Even if his ability to help is limited, Lumen is more than willing to be a kind and compassionate listener. Even more remarkably, he seems not to understand how precious his ability to develop sincere and strong relationships with everyone really is. \nWe should be thankful that such a rare quality took root and blossomed in Iberia, a place where life can normally be described as harrowing and harsh.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Gran Faro is a special town that once carried a whole generation's dreams of revitalization. They tried to build a fort here and once again challenge the unknown dangers of the depths brought about after the Profound Silence. Lumen's biological parents as well as Mayor Thiago, who would later look after Lumen, were all part of this project. According to Lumen's onboarding documents, his parents participated in this project as lighthouse engineers tasked with rebuilding the connection with the 'Eye of Iberia,' a lighthouse stranded in the ocean, in order to pave a way back to the ocean for the people who were unwilling to relent to calamity. They continued to believe that their work would bear fruit, even giving their lives to the cause. In an operation that was later deemed to be too reckless and ambitious, the two engineers and an entire operation team disappeared into the thick fog. \nHowever, after countless investments of time, faith, and blood, this plan was eventually abandoned. On one fateful night, the Inquisition cleaned out almost the entire town, taking away most of the Ægir Islanders. In a report that followed, the Inquisition claimed that some of the Ægir workers in the town had been corrupted by the Church of the Deep, that their foul conspiracy had been sundered, and that that just punishment had been meted out. \nLumen said that he was too young to be able to provide us with more information about this part of Gran Faro's history. But according to our information, Mayor Thiago's wife, an Ægir named 'Marin,' was taken from the town during the turmoil and never returned. \nIt may well be the case that nobody will ever know the full truth of that incident, now sealed away in some file cabinet in the Inquisition; it may also be the harsh reality that the truth no longer matters. Be it any of the witnesses of this event, or Lumen himself, only one choice remains: continue to live on, and try to prove that there is still a purpose to living.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Lumen does not have many opportunities to visit Rhodes Island, as his work with the Inquisition does not allow him to come and go as he pleases. However, when these opportunities do come by and he gets to stay on the ship for a period of time, Lumen will almost always spend a lot of time in the Intelligence Processing Room. He thoroughly enjoys watching operation records and shows great reverence and enthusiasm towards the Doctor, as well as the operators featured in those records. Those experiences that we take for granted are legendary tales for Lumen, who stayed exclusively in his hometown since he was born. \nLumen always describes himself as an ordinary person, and seems to harbor a hidden fear in his heart about becoming an operator of Rhodes Island. Despite that, just about every operator is more than willing to work alongside Lumen. Indeed, Lumen's body and spirit are no different from ordinary people. He cannot release powerful Originium Arts, and is not an expert in any academic field. Beyond that, however, he still possesses certain qualities that are less obvious, but no less important to us: for example, extending kindness to all irrespective of identity, a determination to always keep moving forward, and courage in times of desperation. \nRhodes Island is not, and should never be, a place reserved for the 'elite.' While some of our operators do have incredible abilities, and others hold prestigious positions, our cause is not just driven by these people. Every single person who aspires to make this world a better place, every little bit of power they can contribute, enables us to stand up to this hardship-choked land. \nSo, when you find Lumen toiling away in the training grounds, or hard at work delving into the complexities of Originium Arts to no avail, it won't hurt to bring him a bottle of water and pat him on the back.\nAfter all, every little bit of progress he makes is apparent to all of us.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Classified Log] \n'Lord Carmen...'\n'Jordi, starting today, you will become my disciple.'\n'Y-Yes, sir.'\n'This is not some sort of reward or repayment, young man. I also don't have any great expectations for you. Frankly speaking, what you bring to the table is completely mediocre, and there's nothing else worth commending other than the little bit of medical common sense you possess. You don't even have the qualifications to be drafted into the Penal Battalion.'\n'Yessir, you're absolutely right.'\n'Yet you still stand here in front of me.'\n'I...'\n'I know what you're thinking. You deem yourself a symbol, proof that the Inquisition is changing itself, proof that Iberia is extending its hand to Ægir by recruiting an Ægirian into its ranks.'\n'......'\n'Let me ask you this, Jordi. Why did you choose to go to the Stultifera? What were you searching for there?'\n'I don't know. I just...'\n'You saw Dario die on that island with your own eyes. What do you think the Inquisition's sword and lantern exist for? Answer me, Ægir. Look at my eyes, and answer me.'\n'They exist... so that the people have the energy to wipe the dirt off their faces, Lord Carmen.'\n'What are you talking about?'\n'Erm, I didn't express myself very well...'\n'You said, so the people have the energy to wipe the dirt off their faces.'\n'......'\n'There is no way for you to become a warrior. But starting from now, I will still instruct you and train you. You must become worthy of the Inquisition's burden, and you must learn to become a part of our ranks.'\n'I, I know.'\n'Follow me, disciple. Don't forget what you told me today.'\n'Yes, Lord Carmen...'\n'Starting from today, you are to call me Master.'",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Jordi occasionally shows up at the workshop to fiddle with some odd trinkets. His level of experience is far too rudimentary, not even mentioning his technique. Even the way he holds his tools is awkward. But, the things he makes are indeed rather interesting. I asked to borrow a couple samples of his work so I could study them. They were some kind of light-emitting unit, but their light was so weak that they had no practical use. However, I can barely even speculate as to how something like that works in the first place. It seems connected to the Originium technology we are used to, yet its technical route uses an entirely different paradigm. He said, those things were based on what he saw from his parents' notes, a cheap knockoff of the lighting units used in those fabled Iberian lighthouses. \nThose notes may well be worth researching. I once had the privilege of seeing some technology brought over by a great Ægirian, and Jordi's engineering method seems to be a combination of Ægir and Originium technology. However... \nWait, hold on, if what he said is true, he learned how to make these things purely by looking over some notes? \n––Engineering Department Operator",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1569,
      "atk": 432,
      "def": 88,
      "magicResistance": 10,
      "blockCnt": 1,
      "baseAttackTime": 2.85,
      "respawnTime": 80,
      "cost": 23
    }
  },
  "skins": [
    {
      "skinId": "char_4042_lumen#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_4042_lumen",
      "portraitId": "char_4042_lumen_1",
      "illustId": "illust_char_4042_lumen_1",
      "modelName": "Lumen",
      "drawerList": [
        "一千"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_4042_lumen#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_4042_lumen_2",
      "portraitId": "char_4042_lumen_2",
      "illustId": "illust_char_4042_lumen_2",
      "modelName": "Lumen",
      "drawerList": [
        "一千"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_4042_lumen@ambienceSynesthesia#3",
      "skinName": "Golden Dream",
      "skinGroupName": "Ambience Synesthesia/III",
      "skinGroupId": "2023#ambienceSynesthesia",
      "avatarId": "char_4042_lumen_ambienceSynesthesia#3",
      "portraitId": "char_4042_lumen_ambienceSynesthesia#3",
      "illustId": "illust_char_4042_lumen_ambienceSynesthesia#3",
      "modelName": "Lumen",
      "drawerList": [
        "一千"
      ],
      "description": "<color name=#ffffff>Ambience Synesthesia Tailor-Provided/Golden Dream. Lumen's casual leisure wear, tailored for elegance from lightweight materials. The sea mist has lifted, and you can now see the lighthouse without binoculars.</color>",
      "rarity": 158
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "3-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1000,
            "atk": 189,
            "def": 48,
            "magicResistance": 10,
            "cost": 21,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.85,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1317,
            "atk": 311,
            "def": 70,
            "magicResistance": 10,
            "cost": 21,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.85,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "3-4",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1317,
            "atk": 311,
            "def": 70,
            "magicResistance": 10,
            "cost": 23,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.85,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1569,
            "atk": 432,
            "def": 88,
            "magicResistance": 10,
            "cost": 23,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.85,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3261",
          "count": 5,
          "type": "MATERIAL"
        },
        {
          "id": "30042",
          "count": 8,
          "type": "MATERIAL"
        },
        {
          "id": "30052",
          "count": 3,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "3-4",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1569,
            "atk": 432,
            "def": 88,
            "magicResistance": 10,
            "cost": 23,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.85,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 1825,
            "atk": 540,
            "def": 111,
            "magicResistance": 10,
            "cost": 23,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.85,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3263",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30145",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30064",
          "count": 5,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_lumen_1",
      "skillName": "In Drizzle, Privation",
      "desc": "The next attack causes the target and nearby allies to receive healing equal to <@ba.vup>{aura.heal_scale:0%}</> of Lumen's ATK every second for <@ba.vup>{aura.projectile_life_time}</> seconds",
      "iconId": "skchr_lumen_1",
      "spCost": 10,
      "initSp": 0,
      "duration": -1,
      "blackboard": [
        {
          "key": "aura.heal_scale",
          "value": 0.55
        },
        {
          "key": "aura.projectile_life_time",
          "value": 5
        },
        {
          "key": "aura.interval",
          "value": 1
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31053",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_lumen_2",
      "skillName": "In Downpour, Grace",
      "desc": "Restore HP equal to <@ba.vup>{heal_scale:0%}</> ATK to <@ba.vup>{max_target}</> allies within range; \n<$ba.charged>Charged</> effect: Remove <$ba.debuff>negative statuses</> from targets",
      "iconId": "skchr_lumen_2",
      "spCost": 13,
      "initSp": 5,
      "duration": -1,
      "blackboard": [
        {
          "key": "heal_scale",
          "value": 2.6
        },
        {
          "key": "max_target",
          "value": 3
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30073",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_lumen_3",
      "skillName": "This Lantern Undying",
      "desc": "ATK <@ba.vup>+{atk:0%}</>, ASPD <@ba.vup>+{attack_speed}</>, prioritizes healing units with <$ba.debuff>negative statuses</>; ammo is consumed if the target has a <$ba.debuff>negative status</>, increasing healing to <@ba.vup>{heal_scale:0%}</> of ATK, and removing <$ba.debuff>negative statuses</> from the target. \n<@ba.rem>Attack has <@ba.vup>{attack@trigger_time}</> ammo. Skill ends when all ammo is used (can manually deactivate skill)</>",
      "iconId": "skchr_lumen_3",
      "spCost": 50,
      "initSp": 0,
      "duration": -1,
      "blackboard": [
        {
          "key": "attack_speed",
          "value": 30
        },
        {
          "key": "heal_scale",
          "value": 2
        },
        {
          "key": "attack@trigger_time",
          "value": 8
        },
        {
          "key": "atk",
          "value": 0.55
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30083",
              "count": 9,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_lumen",
      "moduleName": "Lumen's Badge",
      "desc": "Operator Lumen has demonstrated a remarkable aptitude for wide-range healing in tandem with endowment of effects of benefit upon Operators.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Medic Operator during field operations to exercise Therapist responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_lumen",
      "moduleName": "Spyglass",
      "desc": "On Jordi's lower leg is an already almost indiscernible scar, left when he was nine years old.\nYoung Jordi always loved to sit on the benches that lined the town plaza, hugging his knees, spacing out as he stared at the lighthouse statue in the plaza's center. Whenever he did, he did so for the whole day. Jordi had carefully chosen his position, and watching from this angle at sunset, the sinking sun in the west would line up with the tip of the lighthouse for the briefest moment, like this tiny little lighthouse too had come alight.\nRegrettably, it was a fleeting scene, and in the span of a few short breaths, the lighthouse statue would once again go out. Everything about it would be rapidly shrouded in shadow, engulfed by darkness. What he had just witnessed was much like an illusion, gone without a trace.\nFortunately, the sun would rise as it did before the next day, and the lighthouse would come alight again. Just for a moment, of course.\nOn the day of his ninth birthday, Jordi decided to do something big. He wanted to grab hold of something more lasting. He'd try and see for himself what the town's elder workers were so proud of yet kept so secret, see for himself the colossal structure the parents he'd never met had disappeared in, see for himself that true 'Eye of Iberia.' Jordi began to climb the statue in the plaza, believing as long as he stood on its top, he'd be able to see the true rays of the lighthouse piercing through the fog. He clambered inch by inch, hearing the passersby in the plaza shrieking frantically, but the top was right there before him, he just had to make one final leap...\nJordi suddenly felt himself falling—the protrusion he'd used as footing likely crumbled—but why he was falling was no longer important. Jordi had struggled so he could cast his sight far away. Even if it was only for a split-second, he wanted to see it.\nNothing. There was nothing. The fog was like a gauze, covering all upon the surface of the sea.\nWhen Jordi came to, he was already back at home, his leg bandaged, the scent of meat porridge pervading the room. Hearing the sound of Jordi turning over, Thiago poked his body out of the kitchen. Jordi thought he'd be in for a ferocious scolding, but Thiago simply stared at him for a moment, let out a sigh, and pointed in the direction of the desk. There was laid a spyglass, glittering in alluring bronze.\nThat was a bygone affair, years and years ago, and now the scar has even faded. Only the small town's plaza seems to have been overlooked by time, resting unchanged. Jordi sits in his younger self's most favorite spot. Now he's seen the true Eye of Iberia, yet he can no longer sit on this bench with his uncle, listening to those heart-racing stories, taking turns at the spyglass through which they'd gaze far away.\nBut even with the help of a spyglass, they still couldn't see anything. It was the one thing the two of them silently, tacitly, never mentioned to each other."
    },
    {
      "moduleId": "uniequip_003_lumen",
      "moduleName": "'Luck'",
      "desc": "To the Inquisition has come an Ægir.\nI can assure you, not for the past thirty years... no, forty, at the very least! Has an Ægir set foot in the Inquisition's court in any capacity other than that of the tried. The very words themselves are preposterous.\nIt was a young man, not particularly remarkable at first glance. Of fair height, but didn't stand too straight or firm. His features were proper, but lacked any good presence. In all regards, not someone especially worth minding. If it weren't for the fact he was an Ægir, I think even someone new like myself wouldn't have batted an eye at him, with how unassuming and overt his arrival was.\nBut now, all the Inquisition is abound with the rumor of this Ægir.\nSome say he's some wicked convict's bosom friend, merely held temporarily in custody, but this young man—before I forget, his name is Jordi Fontanarossa—clearly has no restrictions placed on his movements. Others believe he's a signal from Lord Carmen that the Inquisition is once again to admit and even promote some of the Islanders in due time. However, Jordi Fontanarossa himself is feeble and weak, and his education lacking. At best, he would be capable of some meager secretarial work, and it doesn't seem as if his position is particularly lofty.\nGiven our workplaces are so near each other, I've had the opportunity to observe him.\nThis Ægir punches in at twenty minutes before his shift each morning, sometimes a little later, but he's never tardy. He's prone to occasional clumsiness; he once caused a misprint of documents after poorly operating the press, wasting quires of business paper. If I hadn't chanced to pass by and stop the machine, who knows how his accident could have evolved.\nI wasn't going out of my way to help him, of course, simply taking responsibility for our work. And no matter how I explained to him as such, the Ægir just persisted with his smile. He'd clearly misunderstood something! Such a loathsome smile!\nOne time, in relation to a vital operation, some colleagues and I were working overtime into the night. The Ægir brought a bucket of drinks over, telling us it was some herbal tea he'd mixed himself. I wasn't interested in having any, but that sort of thing <i>is</> effective at keeping one awake, so for the sake of work, it would have to do.\nIt was about early morning by the time we were done with overtime, and everyone was audibly starving, running on bellies filled with nothing but tea. There in the dark, I suddenly heard footsteps approach, then saw someone had lit a lantern. It was that Ægir, who himself hadn't left for some reason, and had a pot in his hands too, with several bags clearly filled with food hanging from his wrists.\n'Ah, are you all done with work? You must be exhausted.'\nThe man seemed all too apologetic as he regarded us. 'I'm sorry I couldn't be of help with any of it. All I could do was make some food that'd be light on the stomach...'\nWith no patience for hearing out his habitual self-debasement and humbling excuses, I took his pot without any fanfare.\nIt was a vanilla porridge, and all signs pointed to it being yet another recipe beneficial to health.\nLord Carmen having taken in this Ægir as a disciple? Absolutely never would I lend credence to such a ridiculous rumor. That said, based on what I've seen, should the Inquisition decide it <i>would</i> readmit Islanders, I suppose it would hardly be a bad thing."
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "Hm? Am I able to be of help to you? I can't contribute anything towards your meticulous plans or lofty ideals, but if you wish me to attend you... that happens to be my specialty.",
      "voiceAsset": "char_4042_lumen/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Sitting for extended periods of time will cause muscular atrophy, and that's not going to help, Doctor. Come, I'll walk with you around the deck. I've also been wanting to hear about some of Rhodes Island's legends. No, sifting through the archives isn't as interesting as hearing it from you.",
      "voiceAsset": "char_4042_lumen/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "My grandfather was involved in the construction of that great lighthouse. But now, haha, all I do is stay behind in the church, tending to the sick and elderly... No, I'm not complaining about my job as a caregiver; seeing their smiles brings me great joy! It's just that...",
      "voiceAsset": "char_4042_lumen/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Skadi, Gladiia, and Specter... I never thought a day would come when I would stand on the same side as those Ægir greats; I mean, I barely know anything about the Ægir... Huh? You're putting me on the same team as them? Please, have mercy on me...",
      "voiceAsset": "char_4042_lumen/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "That Inquisitor fought to the last breath for our sake. When I saw the light of his lantern pierce the darkness, I suddenly realized: they are all fighting for our future. And though I might not be as strong as them, I don't wish to remain a bystander. I want to stand with them.",
      "voiceAsset": "char_4042_lumen/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "Achieving great things is not easy for me, but even facing life itself is not a trivial task. Doctor, don't worry, I won't give up. I will try my best to catch up with everybody on Rhodes Island.",
      "voiceAsset": "char_4042_lumen/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "For us Iberians, our relationship with the 'sea' is a complicated one. The sea symbolizes terror and danger, while also holding nostalgia for a bygone era. But even as the great vessels of Iberia sink before our eyes, we... we require a bit of change.",
      "voiceAsset": "char_4042_lumen/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Caregivers have to respond to all sorts of different situations. Some people are difficult to deal with, but the gratitude we receive makes it worth it. Doctor, all that you do, day in and day out, must be for a very similar pursuit, right? You know the joy of being able to make a difference.",
      "voiceAsset": "char_4042_lumen/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "Working in the Inquisition is difficult, and not everyone is as fair as Lady Irene... But, had I not experienced it, I never would've gotten to work with amazing people like you, right?",
      "voiceAsset": "char_4042_lumen/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Doctor, Doctor? You're going to catch a cold if you fall asleep like this... Let me fetch you a blanket. Is it alright if I dim the lights for you a bit?",
      "voiceAsset": "char_4042_lumen/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "So you're... the Doctor? Pleased to meet you. My codename is 'Lumen,' and I will now be serving as a Rhodes Island Operator. Even if I can only bring you a thin filament of light, I will give all my strength.",
      "voiceAsset": "char_4042_lumen/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "Do we... really have to face such terrifying things?",
      "voiceAsset": "char_4042_lumen/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "No, I can't accept this. I've just been doing my job, nothing worthy of a promotion. Please, you don't need to look so dejected. Fine, I'll take it!",
      "voiceAsset": "char_4042_lumen/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "I'm just an ordinary person, and it takes a huge amount of effort to even keep up with the others. However, if you really need what little I can offer... then I will be there for you at any time.",
      "voiceAsset": "char_4042_lumen/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Don't worry, Doctor. I'll catch up to the others.",
      "voiceAsset": "char_4042_lumen/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Me, squad leader? Umm... Can you give me a few minutes to sort things out in my head?",
      "voiceAsset": "char_4042_lumen/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Looks like it's too late for second thoughts. Time to move out.",
      "voiceAsset": "char_4042_lumen/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "I'll do my best to keep everyone safe!",
      "voiceAsset": "char_4042_lumen/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "At your disposal.",
      "voiceAsset": "char_4042_lumen/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "As long as I can help.",
      "voiceAsset": "char_4042_lumen/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "I can handle this!",
      "voiceAsset": "char_4042_lumen/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "It's fine, as long as I can muster up the courage!",
      "voiceAsset": "char_4042_lumen/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Don't worry, I'm here with you.",
      "voiceAsset": "char_4042_lumen/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "You can do this. Here, the first step is a deep breath.",
      "voiceAsset": "char_4042_lumen/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Hang in there, the treatment will be done in no time!",
      "voiceAsset": "char_4042_lumen/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Please stay calm. It's a bit tricky, but as long as you give me some time...",
      "voiceAsset": "char_4042_lumen/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Dr. {@nickname}, that you've shown me such a great project, let me become a part of it, and even had me stand by your side, means the world to me.",
      "voiceAsset": "char_4042_lumen/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "We did it, Doctor! Even though this was a small victory, the day will come when these small rays of light will grow numerous enough to dispel the darkness.",
      "voiceAsset": "char_4042_lumen/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Enough frowning, Doctor, it's bad for your health. If everything always went according to plan, what would motivate us to work harder and better ourselves?",
      "voiceAsset": "char_4042_lumen/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Doctor, please evacuate! If I can hold the line and buy you a future, then I...",
      "voiceAsset": "char_4042_lumen/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Rhodes Island is a beautiful ship, but sadly... I cannot feel the breath of the sea breeze.",
      "voiceAsset": "char_4042_lumen/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Do you need a hand?",
      "voiceAsset": "char_4042_lumen/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "The thing I enjoy most is looking out the window at the surrounding scenery, relaxing away my afternoon. Want to join me, Doctor?",
      "voiceAsset": "char_4042_lumen/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_4042_lumen/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Back when I was a caregiver, at the turn of every year, everyone would exchange presents and offer New Year's blessings. Even though I'm working in a different environment now, I hope to keep this little custom alive. Doctor, I wish you... a peaceful and prosperous new year.",
      "voiceAsset": "char_4042_lumen/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Doctor, need me to give you a shoulder massage? I'm pretty well-known for my PT skills.",
      "voiceAsset": "char_4042_lumen/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Kal'tsit mentioned that today is your birthday, Doctor. I don't have the means to gift you anything precious... but please take this. It's an audio recording of the waves in my hometown. If you ever find yourself in a bad spot, please give it a listen. Of course, you're more than welcome to come to me directly.",
      "voiceAsset": "char_4042_lumen/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "Now that I'm saying it out loud, it's a bit embarrassing... Doctor, if I could become like you one day... Err, never mind. Just being allowed to join Rhodes Island, and stand by your side, is already like a dream come true.",
      "voiceAsset": "char_4042_lumen/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "dorm_powToRecAll[000]",
      "buffName": "Glimmering Glow α",
      "desc": "When this Operator is assigned to a Dormitory, restores <@cc.vup>+0.1</> Morale per hour to all Operators assigned to that Dormitory, and every <@cc.kw>1</> Power Plant increases restoration by another <@cc.vup>+0.05</> (Only the strongest stacked effect of this type takes place)",
      "skillIcon": "bskill_dorm_powToRecAll1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "dorm_powToRecAll[010]",
      "buffName": "Glimmering Glow β",
      "desc": "When this Operator is assigned to a Dormitory, restores <@cc.vup>+0.15</> Morale per hour to all Operators assigned to that Dormitory, and every <@cc.kw>1</> Power Plant increases restoration by another <@cc.vup>+0.05</> (Only the strongest stacked effect of this type takes place)",
      "skillIcon": "bskill_dorm_powToRecAll2",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}