{
  "id": "char_4082_qiubai",
  "meta_info": {
    "name": "Qiubai",
    "appellation": " ",
    "voiceActor": {
      "en": "Angel Lin",
      "jp": "Minako Kotobuki",
      "kr": "Cho Hyun-jung",
      "cn": "Daisy"
    },
    "rarity": 6,
    "profession": "Guard",
    "subProfessionId": "Lord",
    "position": "MELEE",
    "team": "",
    "tagList": [
      "DPS",
      "Crowd-Control"
    ],
    "nationId": "Yan",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Qiubai\n[Gender] Female\n[Combat Experience] 10 Years\n[Place of Birth] Yan\n[Date of Birth] May 14\n[Race] Elafia\n[Height] 178cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Excellent\n[Mobility] Excellent\n[Physical Resilience] Excellent\n[Tactical Acumen] Standard\n[Combat Skill] Outstanding\n[Originium Arts Assimilation] Standard",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Qiubai, swordswoman, born in a river fort near the Yanese city of Jiangqi, later left her hometown due to changes in her family and travels the country year-round without a fixed residence or job.\nOn investigation, Qiubai had already been in contact with several Operators in separate incidents, and later accepted Rhodes Island's invitation to cooperate and provide support to our various affairs in Yan.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, the operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Qiubai shows no signs of Originium infection.\n\n[Blood Originium-Crystal Density] 0.13u/L\nOperator Qiubai rarely comes into contact with Originium.\n\nI hear that she's often out in the wilderness... maybe her aura of chivalry is so strong that Oripathy has no effect on her. Or maybe I'm just spouting nonsense. She definitely has plenty of experience from running around her old stomping grounds, and is pretty good at protecting herself.\n—A certain Medical Operator",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "We came into contact with Qiubai during an incident in the Yanese city of Kou-wu, and subsequently extended an invitation for her to collaborate with us. Afterwards, we were surprised to discover that she had been involved in another incident six months ago in a village in the northwestern part of Yan with Operators Saga, Wind Chimes, and Mulberry, and even had interactions with Operators Chongyue and Lin... We must have fate to thank for her to not refusing our invitation.\nAs for the Kou-wu city incident, the operators involved have said that... it was pretty impressive.\nAt the time, some office operators were about to purchase a batch of special medicinal herbs, but after getting in touch with the farmers a certain major herb dealer in Kou-wu city stopped our transaction. The merchant brought out a contract with the farmers signed years ago, that stipulated any sales or transfers of goods as well as other matters had to be agreed upon by both parties beforehand. In short, there was no way for us to get around his terms, and the price he offered was nearly three times greater than what the farmers would have taken. We also learned that he seemed to have engaged in even more nefarious business practices in the area under the table... Whether in regards to profit or ideals, we could not accept such a person as our partner.\nThe procurement came to an impasse, but a solution came out of nowhere. A swordswoman had applied to be a senior bodyguard for the merchant, and when she demonstrated her skills, she accidentally drove the scabbard of her longsword through the merchant's hair and nailed him straight onto the wall. Then they spoke for a full minute while in that position. We have no way of knowing what they talked about, except that the merchant informed the farmer the very next day that he had unilaterally rescinded the contract. He then fired the swordswoman and did not hold her responsible for what seemed to be simply the innocuous accident of a poorly-educated individual.\nAlthough we'd actually already been collecting relevant evidence... In any case, it was a boon for Rhodes Island as we urgently needed the batch of herbs, so we located the swordswoman to thank her.\nEverything else fell into place after that.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Operator Qiubai is not proficient in Originium Arts, and has not displayed any related abilities in combat tests or on missions. At first we thought she was just holding back, and it was understandable that someone so accustomed to being alone would be wary of showing her full power while working with others. But afterwards, we found out that in combat she really relies solely on the longsword in her hands. All the operators who have worked with her say that she is 'good with the sword' but how good exactly was not easy to describe, or rather, there was not much else that could be said.\nWe have seen Qiubai surrounded by operators several times, being asked if she had cool yet unintelligible names for her moves like 'flying snow sword technique' or 'cut the flow of a thousand rivers,' all while she appeared rather exasperated. Their behavior may have stemmed from an unintentional stereotype—that the beautiful yet lethal kung fu styles of Yan were granted by the heavens and have been passed down from generation to generation. The culprits are a certain 'Xia' genre of Yanese fiction, the names of Operator Chen's sword techniques, and Operator Mr. Nothing's usual way of explaining things.\nRegarding the characteristics of Qiubai's sword style, we can only summarize it as 'to strike at the most opportune time.' This was most evident in a recent combat test: she barely maintained a defensive posture while flanked by two Defender operators, and once she spotted an opening, pounced on it to disarm their shields with her sword. In a subsequent match with a Caster with suppression abilities, Qiubai wielded only a sword. The Caster had no time to cast their Arts before the blade was already at their throat. From the way she holds her sword, to the way she strikes with it, to the amount of strength she uses or the angle she strikes from... by any standard, Qiubai is wholly unconcerned with any long-established 'swordplay' techniques. Her moves are not aesthetically pleasing, but rather extremely simple, concise, agile, and efficient—concerned with seizing any chance of victory from the edge of death. Considering her history, it is not difficult to surmise that her style was developed from years of 'experience' accumulated from her brushes with life and death. I can't imagine more than a few people would willingly experience such a life.\n\n'My teacher? You mean my enemies? They're all dead... Well, except for one.'",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Operator Qiubai's main responsibility is to assist with Rhodes Island's affairs in Yan, so opportunities to spot her on the landship are few. And so, on one occasion when she returned to the landship to submit her reports and hand over her duties, the Logistics Department spotted a couple of people sneaking around her dormitory quarters—\n'We just wanted to see if she would actually sleep on the rafters.'\n'Nonsense, obviously she just needs a rope as thick as your thumb. She can attach both ends to a wall and lie down to sleep on the taut rope!'\n'We really had no ill intentions!'\n—Here again is an example of an inexplicably deep-rooted stereotype, but we have seriously educated the individuals involved.\nQiubai does not have any such a bizarre sleeping habits, other than always keeping her sword within arm's reach. That said, it should be noted that her standards for a living environment are very low, and she has barely modified the temporary dormitory arranged for her on Rhodes Island. When she does return to the landship, she also does not take the opportunity to socialize, instead volunteering to keep a lookout. Her lifestyle is as simple as her swordplay.\nAccording to the operator that was on duty with Qiubai, she would sit down on the bridge and fish out a whetstone from her sleeves like it was the most natural thing, and the sound of her sharpening her sword echoed across the bridge. The operator was trembling and sat down opposite her, but ended up falling asleep to the sound. He tried to explain to everyone that Qiubai was not as aloof as she seems, for the two of them had talked for quite a bit before he fell asleep. Although he had forgotten what exactly they talked about, Qiubai had showed off the differences of each Yanese dialect: Shangshu is soft, while Yumen is rough, Lungmen is rich in their tones, while Jiangqi and Dusk City also have their own unique characteristics. This is consistent with Qiubai's statement during her personnel audit that she has traveled all over Yan, and though she has not stayed anywhere for long and has no plans to, she has still been a positive force in the lives of many people, for no particular reason. 'After this, I will head to my next destination. All I need is this sword, and there will always be somewhere it's needed. I'm used to this.'\n'In Yan, this is what they call 'to walk the jianghu is to walk the path of chivalry,' right? Oh, I know, Qiubai is the chivalrous warrior that Mr. Nothing always talks about!'\n'Qiubai, how many chivalrous people like you are there in Yan?'\n'......Best to have none at all.'",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "We invited Qiubai to a movie screening, originally intending to consult her about some details since the movie is based on wandering Yanese vigilantes, with a theme that went something like 'disperse all grievances to live a life of normalcy.' After the screening, Qiubai did not comment on how the film was shot, the architecture or the costume props, or even the cultural nuances, but merely expressed her disdain for the story itself. She could not accept that the characters would simply get into fights, have drinks, say some words and then bury the hatchet, with all grudges and gratitude as well as good and evil 'lost in the wine'.\n'If it were that simple, all it means is that their resentment wasn't worth a thing... Oh, don't mind me, the movie was pretty good, I just didn't like it.'\n—Records from a Rhodes Island movie enthusiast club\n\nIn order to ensure that the files were as thorough and accurate as possible when they were archived, HR did a background check on some of the more obscure parts of Qiubai's history. More than a decade ago, pirates occupied an area of Jiangqi city in Yan, building river forts and colluding with each other to control nearly half the waterways, robbing all the merchants that traveled to and from the city. The Yanese government mobilized a force from all over the country, including Chongyue who happened to be passing by at that time while on duty, and launched a purge on the Jiangqi pirates, covering hundreds of li. All those who resisted were disposed of, with the rest arrested, and Yanese state officials varied their sentences accordingly, letting off the people who had merely been coerced to return to farming after their investigation was done. The families of the pirates were taken care of, and their young ones properly raised and educated. But when the list was checked, one of the pirate leader's daughters had disappeared in the confusion, though we know what happened after, for she had went to Yumen.\nAs a teenage girl, she traveled from Jiangqi to Yumen, a distance of thousands of li over a period of five years. By the time she reached Yumen, her amazing swordplay was already beginning to take shape. What happened on that journey, Qiubai has not told us in detail, but it was presumably not your average road trip. She also stayed in Yumen City for a full five years, not to exact her 'revenge,' but to participate in several emergency defense operations in Yumen. As far as we know, Chongyue had sent relevant documents to various agencies, explaining her situation before his resignation. Any further details were not told to us by either party, but it was unlikely to be the sort of movie scene where they met and laughed off their past grudges.\nOf course, this is a personal matter between the two of them, and after confirming their respective attitudes and making sure they would not come to a blows in Rhodes Island over their old grudges, HR did not pry any further. But we still remember her final words at the time: 'Hatred has long been unworthy of my sword.'",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "By chance, we were given some dated information, but possibly related to the pirates in Jiangqi—\nMore than thirty years ago, a merchant had reported to his local government that his young adult daughter had disappeared while passing through the waterways on a cargo ship to visit family, and was never found.\n\n'Enmity rises from the struggle between good and evil, but where does such a cycle end, or begin? 'Good and evil are both hard to judge' is merely a useless lament, and thus the reason why I wield my sword.'",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1959,
      "atk": 581,
      "def": 333,
      "magicResistance": 10,
      "blockCnt": 2,
      "baseAttackTime": 1.3,
      "respawnTime": 70,
      "cost": 20
    }
  },
  "skins": [
    {
      "skinId": "char_4082_qiubai#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_4082_qiubai",
      "portraitId": "char_4082_qiubai_1",
      "illustId": "illust_char_4082_qiubai_1",
      "modelName": "Qiubai",
      "drawerList": [
        "温泉瓜"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_4082_qiubai#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_4082_qiubai_2",
      "portraitId": "char_4082_qiubai_2",
      "illustId": "illust_char_4082_qiubai_2",
      "modelName": "Qiubai",
      "drawerList": [
        "温泉瓜"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_4082_qiubai@epoque#31",
      "skinName": "Courtesy",
      "skinGroupName": "EPOQUE/XXXI",
      "skinGroupId": "2024#epoque#2",
      "avatarId": "char_4082_qiubai_epoque#31",
      "portraitId": "char_4082_qiubai_epoque#31",
      "illustId": "illust_char_4082_qiubai_epoque#31",
      "modelName": "Qiubai",
      "drawerList": [
        "温泉瓜"
      ],
      "description": "<color name=#000000>EPOQUE Collection New Arrivals/Courtesy. Lungmen's latest trend, seamlessly blending ancient and modern Yanese charm. To Qiubai, the art of tea and the sword are the same in that both require full attention and to know when to stop.</color>",
      "rarity": 46
    },
    {
      "skinId": "char_4082_qiubai@ncg#1",
      "skinName": "Wine-flushed is Woods of Rime",
      "skinGroupName": "Chinese National Geography",
      "skinGroupId": "2023#ncg",
      "avatarId": "char_4082_qiubai_ncg#1",
      "portraitId": "char_4082_qiubai_ncg#1",
      "illustId": "illust_char_4082_qiubai_ncg#1",
      "modelName": "Qiubai",
      "drawerList": [
        "温泉瓜"
      ],
      "description": "<color name=#ffffff>Brand Collaborative Series/Wine-flushed is Woods of Rime. Wind-proof and wear-resistant with a clean, slim fit that's easy to move in. Inspired by the northwest poplar forests.</color>",
      "rarity": 154
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "2-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1041,
            "atk": 299,
            "def": 191,
            "magicResistance": 5,
            "cost": 18,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1488,
            "atk": 447,
            "def": 263,
            "magicResistance": 5,
            "cost": 18,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "3-12",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1488,
            "atk": 447,
            "def": 263,
            "magicResistance": 10,
            "cost": 20,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1959,
            "atk": 581,
            "def": 333,
            "magicResistance": 10,
            "cost": 20,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3221",
          "count": 5,
          "type": "MATERIAL",
          "name": "Guard Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_GRD1"
        },
        {
          "id": "30052",
          "count": 7,
          "type": "MATERIAL",
          "name": "Polyketon",
          "rarity": 2,
          "iconId": "MTL_SL_KETONE2"
        },
        {
          "id": "30022",
          "count": 4,
          "type": "MATERIAL",
          "name": "Sugar",
          "rarity": 2,
          "iconId": "MTL_SL_STRG2"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "3-12",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1959,
            "atk": 581,
            "def": 333,
            "magicResistance": 10,
            "cost": 20,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 2480,
            "atk": 718,
            "def": 402,
            "magicResistance": 10,
            "cost": 20,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3223",
          "count": 4,
          "type": "MATERIAL",
          "name": "Guard Dualchip",
          "rarity": 5,
          "iconId": "MTL_ASC_GRD3"
        },
        {
          "id": "30145",
          "count": 3,
          "type": "MATERIAL",
          "name": "Crystalline Electronic Unit",
          "rarity": 5,
          "iconId": "MTL_SL_OEU"
        },
        {
          "id": "30084",
          "count": 6,
          "type": "MATERIAL",
          "name": "Manganese Trihydrate",
          "rarity": 4,
          "iconId": "MTL_SL_MANGANESE2"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_qiubai_1",
      "skillName": "Halting Feather",
      "desc": "Next attack <$ba.root>binds the target for </><@ba.vup>{duration}</>s. When <$ba.root>Bind</> expires, deals <@ba.vup>{aoe_scale:0%}</> of ATK as Arts damage to target and all nearby enemies.",
      "iconId": "skchr_qiubai_1",
      "spCost": 4,
      "initSp": 0,
      "duration": -1,
      "blackboard": [
        {
          "key": "aoe_scale",
          "value": 3
        },
        {
          "key": "duration",
          "value": 3
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30103",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_qiubai_2",
      "skillName": "Holding Shadow",
      "desc": "Deals <@ba.vup>{sword_begin_atk_scale:0%}</> of ATK as Arts damage to ground enemies ahead, attack range <@ba.vup>changes</>, ATK <@ba.vup>+{atk:0%}</>, ground enemies within attack range are <$ba.sluggish>slowed</>; when skill expires, deals <@ba.vup>{sword_end_atk_scale:0%}</> ATK as Physical damage to ground enemies in range.",
      "iconId": "skchr_qiubai_2",
      "spCost": 10,
      "initSp": 5,
      "duration": 5,
      "blackboard": [
        {
          "key": "sword_begin_atk_scale",
          "value": 3
        },
        {
          "key": "sword_end_atk_scale",
          "value": 3
        },
        {
          "key": "atk",
          "value": 1.4
        },
        {
          "key": "sword_end_duration",
          "value": 4.88
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30073",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30155",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_qiubai_3",
      "skillName": "Questioning Snow",
      "desc": "Attack range <@ba.vup>expands</>, ATK <@ba.vup>+{atk:0%}</>, damage type changed to Arts, attacks 2 extra targets, Talent 1 damage increased to <@ba.vup>{talent_scale}</>x, ranged attacks no longer have reduced damage, each attack grants <@ba.vup>+{attack_speed}</> ASPD (stacking up to <@ba.vup>{max_stack_cnt}</> times).",
      "iconId": "skchr_qiubai_3",
      "spCost": 55,
      "initSp": 45,
      "duration": 30,
      "blackboard": [
        {
          "key": "atk",
          "value": 0.55
        },
        {
          "key": "attack_speed",
          "value": 13
        },
        {
          "key": "max_stack_cnt",
          "value": 8
        },
        {
          "key": "talent_scale",
          "value": 2
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30053",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_qiubai",
      "moduleName": "Qiubai's Badge",
      "desc": "Operator Qiubai has demonstrated a remarkable aptitude for wide-range enemy suppression.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Guard Operator during field operations to exercise Lord responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_qiubai",
      "moduleName": "A Weathered Snow Hat",
      "desc": "The bandit recognizes Qiubai.\nIt was during a summer five or six years ago, when he saw a dying girl lying on the ground in the barrens. The clothes she wore did not appear local, resembling the style of Jiangqi more. 'That's thousands of li away; how did she end up here?' He looked around and found she had nothing with her—no money, no food, no water—yet despite so many people passing by, nobody was willing to help her.\nAny other time, and he would've walked away like all the others. But business had been flourishing, and he was in a good mood. Watching the poor girl before him, he couldn't help but think of his own miserable days, when he wished someone would help him... To save someone is an act of great kindness, and today he was more than glad to be a good person and help this girl.\nHe untied the waterskin from his waist, gave her a few sips, and dragged her into the shade of a boulder. After a while, she opened her eyes. He cracked a satisfied grin, patted her on the shoulder, and left her a few coins. 'Don't cry, girl. Live on.'\n\nQiubai recognizes the bandit.\nIt is winter now. Several corpses lie in the sand, covered by a thin layer of powdery snow.\nRecently, bandits have been quite active outside the village, and the villagers pooled together their money to hire her to take care of them. They said that after a string of Catastrophes, the harvests in the area were disappointing. With poor harvests came poor business. With no money in their purses, bandits began to sprout up like weeds.\nAfter all the whining and complaining, they began to praise Qiubai's skills. The bandits knew they were at the end of their rope, so they took the village's children hostage. Yet she seized the opportunity and struck, slaying them all in a single strike.\nShe does not say a thing.\nShe recognizes the waterskin—or rather, the wine pouch, from which a murky and choking liquor flows—dangling from the waist of a corpse.\nShe thinks back to the man's smile just a few years ago, and to the few sips of water and coins that had kept her going until she could reach the next town. The corpse still holds in his hand a knife—modified from a farming sickle—blackened by layers of blood both new and old. As for her own blade, it had yet to be wiped clean, and still drips red with fresh blood.\nShe sets down her bamboo snow hat in front of the waterskin, and folds into it a plum blossom."
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "I may not be at your side all the time. But don't worry, when you need me, I will be there.",
      "voiceAsset": "char_4082_qiubai/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Logistics permits, equipment approvals, mission evaluations... Rhodes Island has too much red tape. While recklessness does tend to get you in trouble, being overcautious also gets on people's nerves. Let's keep it simple. If anything comes up, you tell me directly. I'll decide what to do from there.",
      "voiceAsset": "char_4082_qiubai/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "I heard the Grandmaster also came to Rhodes Island? Don't worry, I won't pick a fight; but he must be curious if my skills have improved since I left Yumen... Come to think of it, after walking such a long road, he really should be taking it easy. And yet, he still pushes himself into a life of conflict. The same goes for you, Doctor.",
      "voiceAsset": "char_4082_qiubai/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "My dad hated the snow. Snow keeps the doors shut, ruining 'business' for his river fort. That's why he gave me this name. 'Qiu' for hatred, 'Bai' for the white of snow. People always find something to blame for their misfortunes: snow, storms, calamities natural or manmade. As for me, I happened to be born on a snowy day, that's all there is to it.",
      "voiceAsset": "char_4082_qiubai/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "I've seen some die in vain, some turn to crime, and others drive their friends and loved ones to despair… Justice is rare upon this cruel land, and eking out a living is always difficult. But there is no excuse for evil. Never has been, never will be.",
      "voiceAsset": "char_4082_qiubai/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "The conflicts I can resolve with my sword are actually the simple ones. Unfortunately, most are as a great river surging forth, sweeping up all the sand and silt in its path until it turns into an unstoppable murky mess. I may encounter more places like that small mountain village. And I can't say for certain that I will do better next time. But good is good, and evil is evil. One may not confuse them, and I will find my own way to distinguish the two.",
      "voiceAsset": "char_4082_qiubai/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "You'd like me to demonstrate my swordsmanship to the operators? Doctor, it's not something you can learn by watching. I know a scribe who served as the Grandmaster's record keeper. He followed the Grandmaster for over a decade. After years of observation, he could nitpick nearly any kung fu style under Heaven. And yet, he is weak to this day. A stiff breeze could blow him over... Anyway, I do happen to have some spare time. So I'll show you all a few moves.",
      "voiceAsset": "char_4082_qiubai/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "The sharper the blade, the easier it is to break. The same goes for hatred in one's heart... It's easy to understand. But the hard part is, you must first face that which lies in your heart before you can really let it go. I have both hatred and gratitude toward the Grandmaster. The hatred, I paid back how I saw fit; the gratitude, I will hold as close. That is all.",
      "voiceAsset": "char_4082_qiubai/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "The tumult in Yumen is done, and there's no more reason for me to be there. And the home that I came from is nothing but a river now. In short, I've become the 'one without roots.' But, being rootless is not all bad, as it's led me here to you and Rhodes Island. There will always be a place where my sword comes in handy.  The land under Heaven is vast, and my fate will mark the grave for me.",
      "voiceAsset": "char_4082_qiubai/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "A rare bit of fine weather, a rare bit of leisure.",
      "voiceAsset": "char_4082_qiubai/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Dr. {@nickname}, I am Qiubai. I can't say for certain how long I will stay at Rhodes Island, but every meeting is a stroke of fortune. I trust we'll get along just fine.",
      "voiceAsset": "char_4082_qiubai/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "When I was in Yumen, the Grandmaster would also review recordings of my every battle. For us practitioners of kung fu, having someone to provide feedback is always a good thing.",
      "voiceAsset": "char_4082_qiubai/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "Why wield a sword? To combat injustice.",
      "voiceAsset": "char_4082_qiubai/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "I've seen a certain type of fowlbeast in the Gobi to the north of Yan. Their habitat is on the verge of disappearing. So they fly in groups, wet their bodies with water from afar, then bring it back home... If even beasts can go to such an extent, there must be more we can do as people.",
      "voiceAsset": "char_4082_qiubai/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "I just sharpened my sword.",
      "voiceAsset": "char_4082_qiubai/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Very well. Let's walk this path together.",
      "voiceAsset": "char_4082_qiubai/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Don't waste too much energy on the road.",
      "voiceAsset": "char_4082_qiubai/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Don't bother telling me your names.",
      "voiceAsset": "char_4082_qiubai/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Within sheath, the sword awaits.",
      "voiceAsset": "char_4082_qiubai/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Beyond substance, the spirit unchained.",
      "voiceAsset": "char_4082_qiubai/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "A true battlefield. This is the right place to settle things.",
      "voiceAsset": "char_4082_qiubai/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Dew falls heavy, grass bends low. Something's not right.",
      "voiceAsset": "char_4082_qiubai/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Your hostile intent is all too clear.",
      "voiceAsset": "char_4082_qiubai/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "No blade has mercy. Brace yourself!",
      "voiceAsset": "char_4082_qiubai/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "And this is your excuse for evil?",
      "voiceAsset": "char_4082_qiubai/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Don't repent to my sword.",
      "voiceAsset": "char_4082_qiubai/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Let's go, Doctor. Time to head back.",
      "voiceAsset": "char_4082_qiubai/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Even to the very end, I do not know why those people drew their blades... Perhaps, even they did not know themselves.",
      "voiceAsset": "char_4082_qiubai/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Let it be. No sword technique is perfect, just as no outcome is flawless. We shouldn't get too fixated on fighting.",
      "voiceAsset": "char_4082_qiubai/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Even a technique you have executed a thousand times can fail. Don't focus too much on winning and losing, Doctor, you did what you could.",
      "voiceAsset": "char_4082_qiubai/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Were you the one who decorated this room? No, nothing. I am a jianghu wanderer, and we are not picky.",
      "voiceAsset": "char_4082_qiubai/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "I'll write this off as a little joke. But, next time...",
      "voiceAsset": "char_4082_qiubai/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Doctor, why don't you come practice the blade with me?",
      "voiceAsset": "char_4082_qiubai/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_4082_qiubai/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "In Yan, even those who struggle the most will find ways to gift clothes to their children on this day, praying for a bountiful harvest in the coming year. No matter where you are, parting with the old and welcoming the new is a good notion. Only by letting go of bygones can we move forward.",
      "voiceAsset": "char_4082_qiubai/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Doctor, remember to practice your kung fu.",
      "voiceAsset": "char_4082_qiubai/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Doctor, I recently made a trip back to Yan, and brought this for you... It's just rice wine from the common folk of Jiangnan. It's not meant to be a keepsake. Pop open the seal, and let's share a drink or two.",
      "voiceAsset": "char_4082_qiubai/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "Doctor, I plan to stay here a while longer. The path before Rhodes Island seems long indeed, and I'm curious as to where it will lead. But we all know this land is unpredictable, so just give it our all, and live freely as we can.",
      "voiceAsset": "char_4082_qiubai/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "train_spd&profession3[160]",
      "buffName": "Guard Expert α",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, <@cc.kw>Guard</> Operators' Specialization training speed <@cc.vup>+30%</>",
      "skillIcon": "bskill_train_guard1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "train_spd&profession3[161]",
      "buffName": "Combat Techniques: Lord",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, <@cc.kw>Guard</> Operators' Specialization training speed <@cc.vup>+30%</>; if the trainee's Job Branch is <@cc.kw>Lord</>, training speed will be further increased by <@cc.vup>+45%</>",
      "skillIcon": "bskill_train_lord",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}