{
  "id": "char_4109_baslin",
  "meta_info": {
    "name": "Bassline",
    "appellation": " ",
    "voiceActor": {
      "en": "Cassandra Schütt",
      "jp": "Aki Kaneda",
      "kr": "Hur Yea-eun",
      "cn": "Hong Haitian"
    },
    "rarity": 5,
    "profession": "Defender",
    "subProfessionId": "Guardian",
    "position": "MELEE",
    "team": "",
    "tagList": [
      "Defense",
      "Healing"
    ],
    "nationId": "Leithanien",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Bassline\n[Gender] Male\n[Combat Experience] 1 Year\n[Place of Birth] Leithanien\n[Date of Birth] Jul 16\n[Race] Lupo\n[Height] 160cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Standard \n[Mobility] Standard \n[Physical Resilience] Standard \n[Tactical Acumen] Excellent \n[Combat Skill] Standard \n[Originium Arts Assimilation] Excellent",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Bassline, appointed as a protocol officer to Leithanien's Twin Spires in the autumn of 1100, signed an agreement with Rhodes Island to work primarily as an intermediary between us and Leithanien's Imperial Court.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Bassline shows no signs of Originium infection.\n\n[Blood Originium-Crystal Density] 0.12u/L\nOperator Bassline rarely comes into contact with Originium.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'Back when I heard I had to receive an envoy from the Leithanian Imperial Court, I was at a loss. We have plenty of operators from all over Terra stationed here as liaisons between us and their respective nations, but this was the first time I had to be all serious and formal. Fortunately, we have operators experienced with this sort of thing, so I went around frantically barraging them with questions. I asked Dr. Hibiscus and Czerny about what I needed to pay attention to when dealing with Leithanian nobles, wrote down some notes, and even learned to play a little harmonica. Yeah, that's why I learned to play. Anyway, when that Lupo boy showed up at the office carrying a huge tuba and solemnly introducing himself as <i>the</i> protocol officer we'd been in contact with, it left me stunned in disbelief for a while. Afterwards, he handed over an official letter with the twin spires stamped in gold leaf on it, as well as his resume, but I was still so flabbergasted I nearly forgot to help him open it...'\n——Rhodes Island HR Operator\n\nInitial interactions with this Lupo from the Leithanian court gave the impression he's the taciturn type—perhaps it stems from his nature, or from caution. He spends most of his time quietly reading books, or playing his tuba alone in a specialized cabin on the landship. He will answer warmly if you strike up a conversation with him, and it's easy to tell that his reading habit and court upbringing has given him an extensive breadth of knowledge surpassing even people much older than him. He can elaborate on almost any topic you care to discuss, proactively asks for advice on ones he's not familiar with, and listens with an open mind. But once you're done talking, Bassline returns to his default silence, as if you'd never spoken at all. Such politeness and decorum also hint at his nigh indiscernible vigilance. \n—Initial HR evaluation",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'Please, I insist that you call me by my codename. I mean, it would be somewhat inappropriate if 'Michael' were to be seen waltzing around outside Leithanien. It might even cause an unnecessary incident, which would be quite troublesome to deal with.' \nBassline still has his obligations to fulfill at the Imperial Court, so he frequently travels between Leithanien and Rhodes Island. He cannot stay on the landship for long, but he cherishes every visit nonetheless. After all, the young boy sees everything outside Leithanien as exotic, and coincidentally, the various personalities on Rhodes Island can satisfy his curiosity about Terra as well. \nHis musical mastery from growing up in the Imperial Court has easily grabbed the hearts of many an aficionado on Rhodes Island, turning a large crowd of operators into his loyal audience, and he will gladly use his tuba as a conversation starter. Through these exchanges, the operators seem to have gradually forgotten his identity as a court envoy, and the sound of his tuba has become an indispensable part of the Rhodes Island orchestra. \n\nSupposedly, Bassline once had a conversation with Dr. Kalt'sit that lasted over ten minutes. What they were discussing was too difficult for others to parse, and they probably did not dare to ask about it either. However, someone did use this incident as a basis to ask him for some conversational tips, and he replied:\nIt's alright, Dr. Kalt'sit isn't that difficult to talk to. You just have to be ready to take in all that information. She's accumulated so much knowledge and experience that you'll be easily overwhelmed if you're not prepared. There's merit in having more conversations with her, so you should try talking to her too—when she's not busy, that is.' \nYes, according to Baseline, no one on Terra is 'difficult to talk to.' Some operators do leave him momentarily speechless at times, but he always manages to swiftly end that line of conversation and change the subject. \n\n'Bassline rarely takes the initiative to get along with his peers, you say? Doesn't he join in when I gather the kids for a round of soccer? Of course, maybe he didn't decline because <i>I</i> was the one asking. The kid says he didn't know how to play, but I remember how easily he kicked a workpiece right into my hands when he passed by the engineering department the other day! It was more than ten meters away too! His shooting technique is crazy good!\n 'Bassline says he developed this skill by accident. When he was still in Zwillingstürme, he once accidentally sent a castanet flying on the way back to his room after work. It hit a book square in its spine, knocking it off the shelf and making a loud THUNK in the middle of the night. You'd think otherwise, but he felt like he... chilled out a little? From his tone, it sounded like a guilty pleasure of his, perhaps because that instrument was a gift from Leithanien's Golden Empress. We've all had a rebellious phase, right? Though his way of rebelling is a little unlike what an actual rebel would do. Or maybe he's just finally found something to do with the rare windows of free time he gets? \n'Anyway, he's integrating well with the others on the pitch. His penalty kicks are excellent, but his teamwork is no good. Nothing out of the ordinary, though. He's just never practiced with anyone else before. I'll do my best to look after him.'",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Among the nine regions of Leithanien, Kreis Lupukarn has always been the odd one out. Located in the southeastern edge of the empire, it is geographically closest to Siracusa, and its ethnic composition and culture are closer to its neighbor. While it does not share Siracusa's strong sense of independence, it nonetheless harbors an animosity towards the other Leithanian regions. Only a single Emperor in Leithanien's entire history was born in Lupukarn, and his reign was short. It lasted for only three years before he was deposed by the Kurfürsten. Additionally, Lupukarn was the first to be affected by Siracusa's age-old ideas of independence, so they have not had the Imperial Court's trust for a long time. In 969, the Witch King amended the Güldenesgesatz and acknowledged Siracusa's independence. Lupukarn then found itself in an awkward situation: under the most brutal periods of the Witch King's reign, Lupukarn's history of 'conniving and instigating rebellion' was blown out of proportion by his followers, and the region was heavily suppressed as a result. The Kurfürst's family lost much of their power and were nearly stripped of their nobility, while administrative and military leaders were both appointed and dismissed by the Witch King's court and citizens were evicted to other regions, leaving many displaced. Consequently, the Kurfürst of Lupukarn readily allied with the Twin Empresses during the subsequent 'Septemberrevolution.' However, despite their active contributions to the coup, the Imperial Court still distrusts them, and Lupukarn is still regarded as an invisible disease of the empire. \n——Excerpt from 'Research on the Politics Surrounding Siracusa' \n\nIn 1091, Lupukarn's Herzog Jansen instigated rebellions in three cities, but they were quelled in just three months—because Empress Grimmacht personally led her forces to subjugate the rebels. They confirmed it was a small-scale uprising involving just a few families, but the other nobles in the territory were nonetheless punished. The Twin Spires demanded the nobility send their heirs to Zwillingstürme for 'education,' placing them under direct supervision of the Imperial Court. They were effectively hostages, but not all of them entered the court as the Twin Spires had promised. Only a few managed to stay, while the others who did not gain the Empresses' trust were sent away to other spires. \n——■■■■Investigation Report\n\n[Audio Log]\n'These are skills one must master when running around for the Spire of Authority. I'm used to dealing with the spire nobles, and have accepted the fact that they'll never truly be close to the Spire of Authority. 'But there's no need for you to get close to them.' My master once told me that, taught me how to communicate with them, and how to make them listen to us. But sometimes I wonder, if she were to get along with them, would they no longer fear her as they did before? Maybe even come to respect and adore her? Or maybe, she <i>needs</i> them to fear her...'",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "The golden sunset shines through the landship's portholes, bathing its cabins in light. Bassline lowers the sunshade to block out the last rays of the dazzling afterglow. \n'I always have this strange misconception that night won't come after the sunset, that the darkness will never return.' \nConcerts on Rhodes Island usually begin after nightfall. A deep dark night is the best companion, but sometimes Bassline will say: 'The sounds of the night are beautiful enough, and my tuba is merely an accompaniment.' And thus, the huge instrument only plays after dark. Operators who often listen to him perform know that he likes to play a certain piece over and over—a piece from the Lupukarn folk ballad 'White Fang,' the ancient tale of a Lupo boy who put away his fangs. This was the piece he played when he arrived at the Twin Spires that year, facing that splendid Spire of Grace. \n'Actually, I really liked this piece, but the master of the spire didn't at all. Maybe she doesn't like the tune itself, or maybe the place it's from, or maybe, as I would prefer to believe, she just didn't like me, the performer... There was a time when I never wanted to play it ever again, but later I decided I had to, I had to keep performing it. Not for Lupukarn's sake, or even Leithanien's, but for myself. 'Our responsibilities should not be forced on us by others.' \n'I still have my duty to do, and that is why I stand before you today.'",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "The castanet flies through the air and hits a bookshelf a few steps away, the sound rippling through the quiet space for a split second before the room falls silent again. \nThe first book to be knocked off the shelf is 'White Birch,' a novel narrating the love between an Ursus officer and a girl from a Sami tribe. \nMicha picks up the precious castanet and places it before his feet. He bounces it on his toe and kicks it toward the bookshelf again.\nIt hits the intended target: the spine of the second book. It falls from the shelf and lands cover side up, displaying its title: 'Towards The Sunset.' Micha has never liked the sunset much. \nMicha picks up the castanet once again, and there seem to be new scratches on it. But he could not care less, no matter how battered it gets, and the castanet takes to the air again. \nThe third target is a bulky tome that requires an additional castanet attack before it finally falls. 'A Compilation of Victorian Court Etiquette.' Victoria, Leithanien, it seems to be the same anywhere you go. \nMicha picks up the castanet and kicks it at the towering bookshelf for the final time, knocking down a tiny book into an inconspicuous corner. A poetry anthology, 'The sword's farewell.' \nPerhaps he should give this book a proper read-through.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1994,
      "atk": 378,
      "def": 467,
      "magicResistance": 10,
      "blockCnt": 3,
      "baseAttackTime": 1.2,
      "respawnTime": 70,
      "cost": 21
    }
  },
  "skins": [
    {
      "skinId": "char_4109_baslin#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_4109_baslin",
      "portraitId": "char_4109_baslin_1",
      "illustId": "illust_char_4109_baslin_1",
      "modelName": "Bassline",
      "drawerList": [
        "九日九号"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_4109_baslin#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_4109_baslin_2",
      "portraitId": "char_4109_baslin_2",
      "illustId": "illust_char_4109_baslin_2",
      "modelName": "Bassline",
      "drawerList": [
        "九日九号"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_4109_baslin@witch#5",
      "skinName": "Starry Night Sky",
      "skinGroupName": "Witch Feast/V",
      "skinGroupId": "2024#witch",
      "avatarId": "char_4109_baslin_witch#5",
      "portraitId": "char_4109_baslin_witch#5",
      "illustId": "illust_char_4109_baslin_witch#5",
      "modelName": "Bassline",
      "drawerList": [
        "九日九号"
      ],
      "description": "<color name=#ffffff>Witch Feast Role-Playing Script 'Grimoire of Dark Law' Custom Line/Starry Night Sky. He plays the role of the guide showing the hero the way. The Golden Movement has long since faded, but the stars he shoots will forever point true north.</color>",
      "rarity": 109
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "0-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1150,
            "atk": 195,
            "def": 238,
            "magicResistance": 10,
            "cost": 17,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1555,
            "atk": 279,
            "def": 350,
            "magicResistance": 10,
            "cost": 17,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 70,
      "rangeId": "0-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1555,
            "atk": 279,
            "def": 350,
            "magicResistance": 10,
            "cost": 19,
            "blockCnt": 3,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 1994,
            "atk": 378,
            "def": 467,
            "magicResistance": 10,
            "cost": 19,
            "blockCnt": 3,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3231",
          "count": 4,
          "type": "MATERIAL",
          "name": "Defender Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_TNK1"
        },
        {
          "id": "30012",
          "count": 6,
          "type": "MATERIAL",
          "name": "Orirock Cube",
          "rarity": 2,
          "iconId": "MTL_SL_G2"
        },
        {
          "id": "30052",
          "count": 3,
          "type": "MATERIAL",
          "name": "Polyketon",
          "rarity": 2,
          "iconId": "MTL_SL_KETONE2"
        }
      ]
    },
    {
      "maxLevel": 80,
      "rangeId": "0-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1994,
            "atk": 378,
            "def": 467,
            "magicResistance": 10,
            "cost": 21,
            "blockCnt": 3,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 2770,
            "atk": 473,
            "def": 570,
            "magicResistance": 10,
            "cost": 21,
            "blockCnt": 3,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3233",
          "count": 3,
          "type": "MATERIAL",
          "name": "Defender Dualchip",
          "rarity": 5,
          "iconId": "MTL_ASC_TNK3"
        },
        {
          "id": "31084",
          "count": 7,
          "type": "MATERIAL",
          "name": "Cyclicene Prefab",
          "rarity": 4,
          "iconId": "MTL_SL_HTT"
        },
        {
          "id": "30083",
          "count": 15,
          "type": "MATERIAL",
          "name": "Manganese Ore",
          "rarity": 3,
          "iconId": "MTL_SL_MANGANESE1"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_baslin_1",
      "skillName": "First Aid",
      "desc": "The next attack restores HP equal to <@ba.vup>{heal_scale:0%}</> ATK to a nearby friendly unit with less than 50% HP\n<@ba.rem>Can store {ct} charge(s)</>",
      "iconId": "skchr_baslin_1",
      "spCost": 4,
      "initSp": 0,
      "duration": 0,
      "blackboard": [
        {
          "key": "heal_scale",
          "value": 1.8
        },
        {
          "key": "ct",
          "value": 3
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "31084",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31053",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31064",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_baslin_2",
      "skillName": "Calming Bass",
      "desc": "ATK <@ba.vup>+{atk:0%}</>; stop attacking and focus on healing nearby allies, each heal giving the target a <$ba.barrier>Barrier</> that absorbs <@ba.vup>Arts</> damage equal to <@ba.vup>{attack@scale:0%}</> of Bassline's ATK",
      "iconId": "skchr_baslin_2",
      "spCost": 60,
      "initSp": 53,
      "duration": 60,
      "blackboard": [
        {
          "key": "atk",
          "value": 0.8
        },
        {
          "key": "base_attack_time",
          "value": 1.3
        },
        {
          "key": "attack@scale",
          "value": 0.6
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "31064",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30033",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_baslin",
      "moduleName": "Bassline's Badge",
      "desc": "Operator Bassline has demonstrated the capacity for simultaneously treating allied forces while holding the battlefront.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Defender Operator during field operations to exercise Guardian responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_baslin",
      "moduleName": "Bestowed Trinket",
      "desc": "Micha waves a hand over the crystal-shaped nightlight. Like wafting a breeze to put out a candle, it extinguishes; the Spire's study turns to dusk hues, with only the light of the setting sun coming through the window.\nEvening falls over Zwillingstürme, the sound of music filtering like mist through the Spire's generous walls. It is profound and yet murky, not at all there, yet opaque to the senses. Micha recognizes the piece; Bach's 12th Symphony 'Abendrot', 3rd movement, performed by the Fortsgard Philharmonic Orchestra. From the style, possibly conducted by Ricercar, yet also reminiscent of Graf Lotzmann—is he still allowed into Zwillingstürme these days? Grimmacht had already sent him off to the Black Manor, thirteen months ago. It was Micha himself who delivered the documents...\nA muffled noise ripples past his ear, one he's all too familiar with: his Originium Arts. Silent soundwaves transmit outwards from him, pushing the sound of 'Abendrot' away, until every corner of the study is encompassed. The room is soundproofed, and Micha's mind is proofed from the chaos of any lingering thoughts.\nMicha picks up the pair of castanets, much heavier than any ordinary kind, made of thicker, sturdier wood. On top, the inlaid—well, what used to be inlaid gold thread was gilded with no regard for acoustics, which already ruined the castanets' original timbre, not to mention the oversized gemstones. Thanks to those, they come off as ornate, respectable, no longer capable of the sound they were meant to make. They qualify no longer as an instrument, but an exceptional gift instead, and an exceptional trinket.\nMicha has never really treasured this reward since it was bestowed to him. He doesn't want an instrument permanently stripped of its proper sound—and he knows the one who gave them to him meant it in exactly that way. That's why the castanets scare him, why he detests them, why they prick at him at practically every turn.\nHe won't take them up; he'd rather regard them as a trinket, a child's plaything, to be willfully handled until the gold thread falls off, their formerly sleek black surface riddled with scratches. He once even thought of throwing them away, into the hills, into the wind, back into that curdled-stiff afterglow.\n'You must keep them by your side. Can a toy hurt you? You must keep them by your side, to prove that you and them are different. Not for Lupukarn, but for yourself.' The voice sounds so close to him, but in truth it is further than any other voice could be. Micha knows that that voice is the reason he's kept them. He remembers, gazing at that Spire, how the black shadow it cast would always keep him strong.\nMicha looks out of the window, and all he sees is the golden afterglow."
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "That's a huge stack of documents... I can lend you a hand if you're struggling to clear them, Doctor… Oh, sorry. I should be on standby waiting for your request.",
      "voiceAsset": "char_4109_baslin/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Hildegard doesn't care how Leithanians think of her, and I'm not some civil servant mincing words for her. It's just that we've been together for a long time now, so I'm able to stand in for her on unofficial occasions, to speak words she's not at liberty to speak, or meet people unsuitable for her to see.",
      "voiceAsset": "char_4109_baslin/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "That must have been Federico earlier... He's also the type to think of normal conversation as stepping on glass. But once you know them long enough, you'll be able to understand what they're perplexed with, or what they're chasing after. My advice? Get used to awkward silence.",
      "voiceAsset": "char_4109_baslin/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "I just heard some people discussing my age, but I don't see the issue, really. I met a sickly fellow in Zwillingstürme. He was younger than me by a few months, but he's skating on thin ice every day due to his status as Graf... Well, at least I don't have to worry about my own safety like that. ",
      "voiceAsset": "char_4109_baslin/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": " 'Wolfgang, everything you say and do will affect Wulfsburg's future.' That's what I told myself back then. My life is my answer sheet, which I keep neat. But the problem is... maybe not everything has to be treated as an exam... Um, I still seem tense, even now?",
      "voiceAsset": "char_4109_baslin/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "Thank you for your concern, but I don't mind Hildegard's disappearance at all. She told me the enclosure of war was built so that it could be torn down in the future without any worries. She must have been somewhat aware of it that day, but she still... Anyway, my mission isn't over yet, and I remain her envoy still.",
      "voiceAsset": "char_4109_baslin/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Doctor, why are fowlbeasts unable to touch the stars no matter how far they fly? Uh, no, I'm just used to breaking the silence when it gets too quiet. Please pay me no heed. I don't think the answer's that important...? It's because they can't even fly right when they're... Ahem, seeing stars.",
      "voiceAsset": "char_4109_baslin/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Didn't I soundproof the room with Arts...? This castanet? It's a gift from Lieselotte, given during my first audience with her. When I was living in the Spire, I would kick it at the books in my room. Knocking them down one by one, then put them back before the sun came up. It's normal for me to be childish at my age, isn't it?",
      "voiceAsset": "char_4109_baslin/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "You two are so similar... Sorry for disturbing you with my sudden words, Doctor... I was just thinking about how you and Hildegard are so alike. Both of you shoulder so many responsibilities in silence, and I can't tell when to step in. Can I help you? Or... can you help me?",
      "voiceAsset": "char_4109_baslin/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "My tuba? Of course I can play it... Speaking of which, can you play the piano? Can you practice with me when you're free?",
      "voiceAsset": "char_4109_baslin/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Doctor, I am here at the behest of Empress Hildegard of Leithanien, and I hope to maintain friendly relations with you. I can act as a your Messenger, and perform music for you as well.",
      "voiceAsset": "char_4109_baslin/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "I've already seen this... Hold on, I have some old recordings of the annual Kaiserinnensfest. Would you like to watch them together with me?",
      "voiceAsset": "char_4109_baslin/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "Phew... Seems like I haven't disappointed you. Uh, Doctor. Should I be acting more nonchalant about this?",
      "voiceAsset": "char_4109_baslin/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "Mm... I'm glad to have met your expectations.",
      "voiceAsset": "char_4109_baslin/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "I'll follow your baton for the time being.",
      "voiceAsset": "char_4109_baslin/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "I knew you were too lazy to show up, so I went to run some errands... I'm very much used to this. ",
      "voiceAsset": "char_4109_baslin/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "A music score or a battle plan—you have to give me one of those at least.",
      "voiceAsset": "char_4109_baslin/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Hm. Dissonances.",
      "voiceAsset": "char_4109_baslin/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Opening with a tuba? A rare arrangement.",
      "voiceAsset": "char_4109_baslin/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Am I the only tuba in your band?",
      "voiceAsset": "char_4109_baslin/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "I'll warm up my fingers first.",
      "voiceAsset": "char_4109_baslin/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "I'll join in the performance at the right section.",
      "voiceAsset": "char_4109_baslin/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Can you hear it, the restorative vigor of that fortissimo?",
      "voiceAsset": "char_4109_baslin/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Can you feel it, the melodious emotions of that pianissimo?",
      "voiceAsset": "char_4109_baslin/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "A shrill howl? That's what happens when you mess up while performing.",
      "voiceAsset": "char_4109_baslin/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Out of my way, or I'll shove your head up this tuba.",
      "voiceAsset": "char_4109_baslin/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "While the tuba is one of the most difficult instruments to play, I'm sure I'll get somewhat proficient at it in time. But you, you seem like a musician who was born proficient with all kinds of instruments... Life is so unfair.",
      "voiceAsset": "char_4109_baslin/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Your ingenuity put to shame any conductor I've seen.",
      "voiceAsset": "char_4109_baslin/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "How does one keep their musicality in tip-top shape? Practice. A flawed performance simply means you haven't practiced enough.",
      "voiceAsset": "char_4109_baslin/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Did we fail? I don't think so. People like you usually factor failure into your plans, yes?",
      "voiceAsset": "char_4109_baslin/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "The soundproofing here should be decent...?",
      "voiceAsset": "char_4109_baslin/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Ahh... you gave me a fright.",
      "voiceAsset": "char_4109_baslin/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Doctor, I'm just about to replace the bell on my tuba. Can you lend me a hand?",
      "voiceAsset": "char_4109_baslin/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_4109_baslin/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "The new year was just a month away when I left Wulfsburg. They said we had to hurry to meet Their Majesties so we could make it to the annual celebration in Zwillingstürme. I was practicing the whole way, but... I really liked that piece though.",
      "voiceAsset": "char_4109_baslin/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Are you resting well, Doctor?",
      "voiceAsset": "char_4109_baslin/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Your seat is here. Yes, right here, in the center of the front row. Miss Orchid had me arrange an ensemble with the children on Rhodes Island, and, um, I'm one of the performers too... This is not a birthday gift, but I'd like your opinions on the performance.",
      "voiceAsset": "char_4109_baslin/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "The annual Kaiserinnensfest is always a stunning event. The Royal Orchestra performs to the people, and it closes with a grand ensemble on the covered bridge for Their Majesties. The main reason we hold it every year is to make everyone believe in the path under their feet. Rhodes Island doesn't have celebrations as grand as that, but your footsteps are still full of conviction.",
      "voiceAsset": "char_4109_baslin/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "hire_spd_cost[101]",
      "buffName": "Court Etiquette",
      "desc": "When this Operator is assigned to the HR Office, HR contacting speed <@cc.vup>+10%</>, Morale consumed per hour <@cc.vup>-0.25</>",
      "skillIcon": "bskill_hire_spd&cost5",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "hire_spd_cost[120]",
      "buffName": "Authoritarian Envoy",
      "desc": "When this Operator is assigned to the HR Office, HR contacting speed <@cc.vup>+30%</>, Morale consumed per hour <@cc.vup>-0.25</>",
      "skillIcon": "bskill_hire_spd&cost6",
      "phase": "PHASE_2",
      "level": 1
    },
    {
      "buffId": "hire_spd_bd_n1_n1[300]",
      "buffName": "Drawing the Heart's Voice",
      "desc": "When this Operator is assigned to the HR Office, for every Recruit slot (Default slots do not count), <$cc.bd_B><@cc.rem>Soundless Resonance</></> <@cc.vup>+15</>",
      "skillIcon": "bskill_hire_bd_B",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}