{
  "id": "char_2015_dusk",
  "meta_info": {
    "name": "Dusk",
    "appellation": " ",
    "voiceActor": {
      "en": "Aileen Mythen",
      "jp": "yukana",
      "kr": "Bae Jeong-mi",
      "cn": "Blank"
    },
    "rarity": 6,
    "profession": "Caster",
    "subProfessionId": "Splash Caster",
    "position": "RANGED",
    "team": "Sui",
    "tagList": [
      "AoE",
      "DPS",
      "Crowd-Control"
    ],
    "nationId": "Yan",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Dusk \n[Gender] Female \n[Combat Experience] Undisclosed \n[Place of Birth] Yan \n[Date of Birth] November 11 \n[Race] Undisclosed \n[Height] 162cm \n[Infection Status] Medical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Normal\n[Mobility] Normal\n[Physical Resilience] Normal\n[Tactical Acumen] Standard\n[Combat Skill] Normal\n[Originium Arts Assimilation] Flawed",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Dusk, a painter from Yan, awaiting assignment. Following the rather excitable actions of a certain resident of the landship by the name of Nian, Dusk has been held as a guest of Rhodes Island. Her skills with a brush are impressive, particularly when it comes the traditional Yan painting style. She currently resides off an isolated Rhodes Island walkway.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected. \n\n[Cell-Originium Assimilation] 0% \n\n[Blood Originium-Crystal Density] 0.00 u/L \n\n[Classified Log] \nWhat? She actually took a physical? Wow, she's so easy? I figured anyone Nian would haul in would be pretty much like her. Guess we're not gonna need Gavial's help this time, let her gear up for round two with Nian. \nNian's idea for how to run the tests at the normal operator level had the examiner thinking of calling for a medic to shut the whole thing down. And Nian sure looked pleased with herself. She knew exactly how that would go down. \nBut Dusk is really out of shape. Whatever, she's not taking a salary, so it's none of my business... \nOh,the results match everything in the files we got. She has 'no connection' to Originium whatsoever. \nNot allocating any additional funds. If you're already struggling, you could always consider NOT starting a research project on some weirdo shut-in? \n——Closure",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "She made a door in the walkway. \nIt's literally a door you can walk through... \nAnd we almost never see Dusk come out of it. \nShe told an HR operator that she has no interest in going out or doing any work. \nOf course, she doesn't use any of Rhodes Island's resources, but now one of our walkways has a fancy Yan-style door with an incomprehensible weirdo inside it. That's creating some headaches for HR. \nWhile she refuses to see visitors, Dusk has said she will continue to paint, occasionally. Some of our staff have seen her work, and find themselves struggling to express anything more interesting than 'wow' or 'so pretty.' Saga, however, did confide in me that Dusk is known to casually destroy those breathtaking pictures. \n On the upside, at least she's a sort of artistic, well-read type? \nThere is the occasional operator who earns Dusk's favor, but they are few and far between. \nBut at least she's a lot better than a certain layabout, right?",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Dusk has an interest in all kinds of contemporary artworks. If you want to get close to her, giving her books and photo collages is a great way to break the ice! \nBut the way things go from there all depends on your taste, and how well you pick things. \nDusk shares her favorite works with a precious few operators, but they include quite a few very old movies from Ursus, Columbia and such. \nIt's pretty rare that anyone gets to 'make friends' with Dusk. She has a temperament that, if I'm being honest, is not quite as nice as Nian's. \nThe rare few who have a relationship with Dusk tell strange stories of a forest in her room, where they can find her sitting in a little pavilion, or like they push in the door to find themselves atop a mountain peak, with Dusk sitting bare-legged on the cliffs, watching the clouds... \nIs she really at Rhodes Island? Maybe her door is some kind of portal? \nOn the rare occasion that I see Dusk in the corridor, I sometimes feel like she's a world away. Plus there's all those weird rumors about her. I mean, I've never been in her room either... \nMaybe she's one of the legendary immortals? A shen-hsien? I think that's what they call it in Yan. \nSo anyway, let's not ask her to do any serious work anymore. We've had more than a couple nosy operators disappear for a few days and then refuse to ever go looking for Dusk again. \nOh, right, one more thing. When Dusk and Nian go at each other, it's really something. Dusk speaks with a venom that sends shivers down my spine. \n\n'If only those sisters could get along. *sigh* They should learn from us. Right, Lava?' \n——Medic Operator Hibiscus",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Oh, that's not Arts. Quit bothering the theoretical casters. \nHm, I know. Every time Nian pulls out some remarkable, otherworldly sword or shield or whatever, the theoretical casters work themselves into a fit, so let's quit while we're ahead and leave Dusk alone altogether. Let yourselves go while you're at it. \nYou really want to choose this subject? \nLet's see if I can talk you out of it. Just clear your mind and think for a minute. \nLava and Saga both said they unknowingly made their way into Dusk's scroll, and Saga even said she traveled across the scrolls for ten years. \nI'm paraphrasing but that's basically what they said. It means they were actually wandering through the landscapes of her paintings for a time. \nAnd now, after a very short period at Rhodes Island, we've got reports of people experiencing hallucinations. We looked into food poisoning or research accidents, but all signs point to that closed door and our operator awaiting assignment. \nThe towering cities, infinite waves, blinding snowscapes, they are all depictions from Dusk's paintings. All just paintings. \nIs it a trick of the optic nerve? Or Arts applied at the cognitive level? We theorized, but after heeding Nian's advice to use firecrackers to force Dusk out of her room, and after two solid hours of questioning, our hypotheses were overturned by the facts. \nDusk remains cooperative. I would guess she just wants to avoid trouble? And she'd rather not have to move too much. That's how artists are, I know. \n\nTell me, researcher, where is the line between hallucination and perception? \nTake a look behind you and see for yourself, the vibrant blue. The autumn chrysanthemum. An HR operator picked it out of the sea of flowers that appeared to her. \nDoes this give us a glimpse into how Dusk functions? At least a little? \nWell, yes, Dusk also participates in missions. Surprising, isn't it? She actually goes out. \nI went on one of these little cultural outings. These titles etched into my mind: 'Ink into Armies', 'Bleached Bones Abound', 'Rivers Run Red.' It was a few smugglers, and they surrendered on the spot, as they should. I touched the blood, I smelled it, it was so real. It couldn't be more real. \nBut if you close your eyes... no, not right now. You have to close them right at the start. \nNone of it is real. \nI tried it once with Dusk. Yes, you close your eyes and let her paint, and what she paints you can't see or touch. \nThe truth is, you will get the same answer if you ask her. She doesn't hide anything, she's just unable to explain it herself from a theoretical perspective. \n'As long as you didn't see it, it didn't happen.' \nSo how do those who have seen the painting meet those who haven't? Our sample is too small to give an answer now. We need more data and experimentation. \nAs for aerosolized crystal concentrations, energy spillage and such, we have not observed anything at all. In other words, this is not Originium Arts. \nThat's good, isn't it? You still want to choose this course of study? You're so interested in Dusk's paintings? \nThen I won't stop you. Interest can be frustrating in the end, but the process itself is enjoyable. \nRemember to doubt, remember to verify. Good luck, researcher.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'...After that one's death, we bowed our heads, and from thence began the age of peace.' \nWhat else can I tell you? It is all here in black and white. \nWe bowed our heads. No, I might ask how anyone could not bow their head? \nBut to bow down doesn't mean I have to go along with them? We have our own ambitions, and we will go our own way. The lowly hermit hides in the city, the greatest hermits live in a painting. I like people, I need not act against them. \nAs for when that old thing wakes up, it doesn't make much difference to me. Life and death are fleeting, heaven and earth are constant, my brush too will be constant, what have I to worry about? There is nothing that we brothers and sisters can do. \nNian hasn't given up yet. She played too long and refused to go, as it should be. Her fixation on eating spicy food has rotted her brain. \nHm? You think I'm the one with no ambition? \n...Whatever. It's only this I don't care about. \nLong days pass in time, long dreams come to an end. \n...Ugh, get out of here. I'm done talking about this! \nIf the world outside becomes boring, if I stay here, it stays there, everyone trundles on, what's the point? \nIf only someone could do something to make it more interesting... \nShould there be such a thing, well, you must come let me know.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'The virid beasts. Like range on range \nEleven told. In moon, smoke-flow \nThe clouds haze thick. Sun down, they glow \nManes blue like woods. Bones ridge as stone \nQuoth they: Starshrouded snow. Hidden moon.\n Man gradates self. Shades classed all well \nFive arms, it spurns. Five fires, it falls \nBurn down its flesh, and ink wells out. Once smoke recedes, its two heads gone \nYet the beasts elude: Night gives to day. At once they fade \nTheir form is false. Their matter false. \nHalt brush, wind scroll: Foolish as wine. One dusk, to ash.' \n\nIt is a complete rubbing of the inscription, but the content is upsetting.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1404,
      "atk": 771,
      "def": 106,
      "magicResistance": 20,
      "blockCnt": 1,
      "baseAttackTime": 2.9,
      "respawnTime": 70,
      "cost": 34
    }
  },
  "skins": [
    {
      "skinId": "char_2015_dusk#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_2015_dusk",
      "portraitId": "char_2015_dusk_1",
      "illustId": "illust_char_2015_dusk_1",
      "modelName": "Dusk",
      "drawerList": [
        "幻象黑兔"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_2015_dusk#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_2015_dusk_2",
      "portraitId": "char_2015_dusk_2",
      "illustId": "illust_char_2015_dusk_2",
      "modelName": "Dusk",
      "drawerList": [
        "幻象黑兔"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_2015_dusk@nian#7",
      "skinName": "Everything Is a Miracle",
      "skinGroupName": "0011 Productions/VI",
      "skinGroupId": "2022#nian#2",
      "avatarId": "char_2015_dusk_nian#7",
      "portraitId": "char_2015_dusk_nian#7",
      "illustId": "illust_char_2015_dusk_nian#7",
      "modelName": "Dusk",
      "drawerList": [
        "幻象黑兔"
      ],
      "description": "<color name=#ffffff>0011 New Release / Everything Is a Miracle. A silky and delicate satin surface, perfectly fitted to the wearer's body shape. Blue-green envelops the body, invoking an ancient charm. After completing the outfit's design, the client draws it into existence, ready-to-wear, with a stroke of the brush.</color>",
      "rarity": 61
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "2-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 808,
            "atk": 426,
            "def": 50,
            "magicResistance": 10,
            "cost": 31,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1123,
            "atk": 601,
            "def": 77,
            "magicResistance": 10,
            "cost": 31,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "3-6",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1123,
            "atk": 601,
            "def": 77,
            "magicResistance": 15,
            "cost": 34,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1404,
            "atk": 771,
            "def": 106,
            "magicResistance": 15,
            "cost": 34,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3251",
          "count": 5,
          "type": "MATERIAL",
          "name": "Caster Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_CST1"
        },
        {
          "id": "30062",
          "count": 6,
          "type": "MATERIAL",
          "name": "Device",
          "rarity": 2,
          "iconId": "MTL_SL_BOSS2"
        },
        {
          "id": "30042",
          "count": 3,
          "type": "MATERIAL",
          "name": "Oriron",
          "rarity": 2,
          "iconId": "MTL_SL_IRON2"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "3-6",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1404,
            "atk": 771,
            "def": 106,
            "magicResistance": 20,
            "cost": 34,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 1801,
            "atk": 918,
            "def": 127,
            "magicResistance": 20,
            "cost": 34,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3253",
          "count": 4,
          "type": "MATERIAL",
          "name": "Caster Dualchip",
          "rarity": 5,
          "iconId": "MTL_ASC_CST3"
        },
        {
          "id": "30145",
          "count": 4,
          "type": "MATERIAL",
          "name": "Crystalline Electronic Unit",
          "rarity": 5,
          "iconId": "MTL_SL_OEU"
        },
        {
          "id": "30084",
          "count": 6,
          "type": "MATERIAL",
          "name": "Manganese Trihydrate",
          "rarity": 4,
          "iconId": "MTL_SL_MANGANESE2"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_dusk_1",
      "skillName": "Transcendental Stroke",
      "desc": "The next attack has <@ba.vup>increased</> splash area and deals <@ba.vup>{atk_scale:0%}</> ATK as Arts damage\n<@ba.rem>Can store {cnt} charges</>",
      "iconId": "skchr_dusk_1",
      "spCost": 5,
      "initSp": 0,
      "duration": -1,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 2.5
        },
        {
          "key": "cnt",
          "value": 3
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30093",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 9,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_dusk_2",
      "skillName": "Flowing Ink",
      "desc": "Range <@ba.vup>expands</>, ATK <@ba.vup>+{atk:0%}</>, ASPD <@ba.vup>+{attack_speed}</> and attacks all enemies within range. Increase Arts damage dealt to enemies with less than 50% HP to <@ba.vup>{damage_scale:0%}</>",
      "iconId": "skchr_dusk_2",
      "spCost": 38,
      "initSp": 25,
      "duration": 20,
      "blackboard": [
        {
          "key": "atk",
          "value": 0.55
        },
        {
          "key": "attack_speed",
          "value": 55
        },
        {
          "key": "hp_ratio",
          "value": 0.5
        },
        {
          "key": "damage_scale",
          "value": 1.3
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30013",
              "count": 11,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_dusk_3",
      "skillName": "Image over Form",
      "desc": "Attack Interval <@ba.vdown>increases</> and prioritize attacking unblocked enemies. Range and splash area <@ba.vup>expand</>, ATK <@ba.vup>+{atk:0%}</> and every attack summons/refreshes a <@ba.vup>'Freeling'</> (lasts for 25 seconds) at the target's location (only on deployable ground tiles)",
      "iconId": "skchr_dusk_3",
      "spCost": 100,
      "initSp": 70,
      "duration": 60,
      "blackboard": [
        {
          "key": "base_attack_time",
          "value": 0.4
        },
        {
          "key": "atk",
          "value": 1.2
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30103",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_dusk",
      "moduleName": "Dusk's Badge",
      "desc": "Operator Dusk has demonstrated a remarkable aptitude for inflicting Arts casualties on multitudes of enemies.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Caster Operator during field operations to exercise Splash Caster responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_dusk",
      "moduleName": "Untitled Scroll",
      "desc": "At Hui-ch'i's peak, in a humble abode 'twixt bamboo thicket, a red edge is dyed in ink, blade pointed at a scroll.\nThe hills range lofty, river water ceaseless, nature in all its colors, vegetation in all its fragrance.\nShe gazes afar to the ends of the vista; she brandishes blade and splashes ink.\nClear black washes ranges, pine soot works jade branches, dry brush masses steep heights, pallid shadow forms hazed clouds.\nA painting complete, the blade stowed away.\nIn careful scrutiny years later, Dusk gives a light sigh.\nThe mist-drizzled scenery has lost all shade; only white left on this scroll laid bare.\nHui-ch'i's vistas, painted through a million's times.\nWinter cedes and spring comes in with blooms and trees profuse; down from Heaven sable stone descends in alien clumps; opened mounts and given roads do Heaven's work in whole; now visits another year of celebration's hour.\nShe sees then sees again; paints then paints again.\nIs tired; is loath.\nLet this brush travel its own way, then.\n......\nWhen Dusk snaps out of it, she finds a small being on her parchment.\nThough wreathed in soot and ink, held prideful as prominence, it is at a proper look still but a youngling.\nAnd this youngling looks at Dusk in turn.\nThe brush is no brush, the ink no ink, the scroll no scroll. All formed things, false.\nBut that animacy, that spiritful will, gives some ever-so-slight joy to Dusk.\nShe suddenly feels a little of her mood return.\nHalf a day later, the small being is lively across the wealth of her canvas.\n'That old idiot would have even more pointless words for me if he saw me brushing life out of nothing.'\n'But still...'\n'The way this realm has no bearing on how you are, I suppose that's a little interesting.'\n'No place of place amidst high mounts or waters far; no matter to me free amidst the human realm.'\n'That's it.'\n'I think I'll call you 'Free.''"
    },
    {
      "moduleId": "uniequip_003_dusk",
      "moduleName": "'All Told, A Sleepless Night'",
      "desc": "First watch comes; face mirrors, light candles, impart jade's command.\n'Pon towers, springs and autumns daren't be studied; dry hairs crack readily; ink loses black luster; the four seas await light's hour.\nSecond watch comes; in want, in imitation, such worries beget no thought.\nPeer the halewhite moon, visit by the wondrous mounts; the plants stir shape; waterfalls run red; dried bones pale verdant blue.\nThird watch comes; colors wind, smoke parts, closing ne'er as simple but.\nDrearfrost morn's horn sounds in Year's twilight end; forts and mounts challenge crossers; journeys wither, grasses wane; not one of ten return.\nFourth watch comes; in deepest night, crickets chirp, the painting unreplete.\nLong lives are taken in mistakes endgame; in old offices deepen cold; in snapped branches sweetens fraternity; in sky hangs blankest stele.\nFifth watch comes; a lantern is lone 'til its utmost, window yearning for morn's light.\nLong away in the painting, dream taken as no fool's; gold splendor naught but wild; a Dusk to ashes turns; paper burnt out in daybreak's hue.\n\n—Gloss of a Kou-wu City folksong\n\nDuring an assignment in Kou-wu City, a Candleholder happened to overhear several children singing a song of this manner in the street. The lyrics were vague and resisted understanding, and its repeated retelling seemed to have corrupted it several times. However, the events directly referenced by the warped lyrics led the Candleholder to be uneasy. When he inquired with the children whether they knew the meaning of the lyrics, and where they heard it from, they unanimously shook their heads. Left with no alternative, the Candleholder transcribed the lyrics and let the children return home.\nAfterwards, the Candleholder got in direct contact with local authorities, requesting they bolster security administration and enlist more emergency workers to respond in the event of sudden disaster. At the end of that autumn, a flood broke out in the area. With grain harvests under thirty percent of previous years, it was fortunate that local authorities had long since prepared, and were ready to send in grains from nearby cities, leading to no further unrest. Post-disaster reconstruction work was likewise completed smoothly.\nAll aforementioned events have been recorded in Sui Regulator files."
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "Hm? Did I not explain that you were forbidden to enter without my express permission, after knocking? Oh? This is your office? You're working? Then have I not come out of my room to work as well? What is the meaning of 'your office'? Get out! I'm still sketching it out.",
      "voiceAsset": "char_2015_dusk/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "You want to see my painting? You may. For you, I could even give you the painting. But if you like it, I won't give it to you. You don't like it? Huh, then you wouldn't want it anyway. This is who I am. Deal with it.",
      "voiceAsset": "char_2015_dusk/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Haa… I'm trapped on this ship. If anyone asks, you tell them so, and you do not let them into my room. I'm taking up space? I'm refusing to perform my operator duties? Hello, I am Dusk, the great painter trapped in this room.",
      "voiceAsset": "char_2015_dusk/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "I'm not going out. Don't try to make me go out, I don't want to go out. I no longer care for the world outside. Do I dislike it? I like it fine. The mountains and rivers, the flowers and feathers, the pools and forests, the common folk, young and old, I could paint forever, I could watch forever, and yet, I will not go. It does not hold my interest forever.",
      "voiceAsset": "char_2015_dusk/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "I loathe the word 'taste.' What gives these people the confidence to demand something good just as they open their mouths to lock the gates to others? It is unbecoming. If you are satisfied, you are satisfied. Should you enter, you must not bar the gate. Do you see the twin moons thinking only of themselves?",
      "voiceAsset": "char_2015_dusk/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "An opportunity to watch me paint in earnest comes but once in a lifetime to one in ten thousand individuals. 'When the time comes, the strength of heaven and earth are one.' Ch'i, bone, shape, color, method, pouring out as a vast river, fine like the shadow of mountain bamboo, such is my brush, and it will not stop.",
      "voiceAsset": "char_2015_dusk/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "I took the time to partake of some contemporary works. Films are not bad, they are like paintings. The good ones all have a unique strength of character, with form, and with decent meaning. Right, poetry and painting have a legacy. Do you have time to help me burn Nian's mountain of garbage? She is denigrating the very concept of cinema. Please.",
      "voiceAsset": "char_2015_dusk/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Food? Oh, thank you. Hm, where does this drink come from? It's good. Quite good. But I feel like it's missing something. You want to know what I usually eat? Then close your eyes. Ah~ You feel nothing, yes? That's because if you don't look, the food in my paintings does not exist.",
      "voiceAsset": "char_2015_dusk/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "Take a look at Nian's carefree expression. You know the truth, don't you? She cares quite a bit about our lives, and our deaths. As for me? I may not get along with the wretched scribbler, but neither of us care much. When people die, the paintings remain. When I die, my work remains.",
      "voiceAsset": "char_2015_dusk/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Dreams are like unto life, like unto the scroll. One sleeps this sleep, will one sleep for millennia?",
      "voiceAsset": "char_2015_dusk/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Oh? {@nickname}? Another contract? Very well, please don't bother me again after I sign this one. Here... I should tell you here and now: I, Dusk, do not give out my paintings. Not to anyone. And I don't take commissions!",
      "voiceAsset": "char_2015_dusk/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "Hm? A swing of an axe becomes rivers of blood. Do you mean... you want me to paint this?",
      "voiceAsset": "char_2015_dusk/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "Why use a sword? There is a reason. 'With an inkstone sheath, one may learn the annals. With a brush sword, one may paint the celestial.' Is it true? Naturally, I speak off the cuff.",
      "voiceAsset": "char_2015_dusk/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "Ahh, to make it this far with me... I should paint you a scroll. But be careful! Do not get caught up within it. The world I paint is much more fascinating than this one. How many have been lost, since ancient times? How many have escaped?",
      "voiceAsset": "char_2015_dusk/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Don't keep me too long.",
      "voiceAsset": "char_2015_dusk/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Captain? What does a captain do?",
      "voiceAsset": "char_2015_dusk/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Let's get this over with.",
      "voiceAsset": "char_2015_dusk/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "I'm in a good mood today. I'll give you this one I've titled 'Bones on the Sand'.",
      "voiceAsset": "char_2015_dusk/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Don't go too far.",
      "voiceAsset": "char_2015_dusk/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Better leave the fine brush at home.",
      "voiceAsset": "char_2015_dusk/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Would any of you like to be my paint?",
      "voiceAsset": "char_2015_dusk/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "This battlefield would do well with a splash of ink.",
      "voiceAsset": "char_2015_dusk/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Too difficult to explain, let me paint it for you.",
      "voiceAsset": "char_2015_dusk/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "With the setting of the sun, the brush draws up the peaks!",
      "voiceAsset": "char_2015_dusk/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Copy the infinite with the tangible, bring the intangible to life!",
      "voiceAsset": "char_2015_dusk/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "I am rather attached to you. Most of the time.",
      "voiceAsset": "char_2015_dusk/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Once, painting and war were quite different. But with this power, battle is art.",
      "voiceAsset": "char_2015_dusk/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Not bad.",
      "voiceAsset": "char_2015_dusk/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Hm... a failed painting must be destroyed. It will bring shame.",
      "voiceAsset": "char_2015_dusk/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Slipped on a stroke? Start over.",
      "voiceAsset": "char_2015_dusk/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Do not bother preparing the room for me. I will handle it myself.",
      "voiceAsset": "char_2015_dusk/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "You'll spill my ink!",
      "voiceAsset": "char_2015_dusk/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Hey, don't get paint everywhere.",
      "voiceAsset": "char_2015_dusk/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_2015_dusk/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "The New Year? A human's life is brief enough as it is. It's like partitioning a tiny dot on a scroll, thinking what to draw here, what to draw there, coming and going full circle, living and dying in exhaustion. But whatever. A moment of laughing and feasting is valid enough, I suppose.",
      "voiceAsset": "char_2015_dusk/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "What was your name again? Oh, {@nickname}?",
      "voiceAsset": "char_2015_dusk/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "What? You wanted me to celebrate your birthday? Don't think I came all the way out here just for that, I'm only getting some fresh air and happened to run into you. Oh, and here, a painting I messed up and stopped caring about, so now it's yours. What did I draw? Why don't you go look in a mirror and compare.",
      "voiceAsset": "char_2015_dusk/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "I keep saying, don't bring me out for nothing. You want to celebrate together? Celebrate what, me being trapped here this long? Get out, get out, honestly... No, the decorations on the wall were me scrawling randomly, and I didn't draw them just because Closure asked me to. Once again, I don't take commissions.",
      "voiceAsset": "char_2015_dusk/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "control_mp_cost&bd1[000]",
      "buffName": "'Unstirred by Gain'",
      "desc": "When this Operator is assigned to the Control Center, increases Morale of all Operators in the Control Center by <@cc.vup>+0.05</> per hour; and when self Morale is below <@cc.kw>12</>, <$cc.bd_b1><@cc.rem>Worldly Plight</></><@cc.vup>+15</>",
      "skillIcon": "bskill_ctrl_cost_bd1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "control_mp_cost&bd2[000]",
      "buffName": "'Unmoved by Loss'",
      "desc": "When this Operator is assigned to the Control Center, decreases own morale consumption by<@cc.vdown>+0.5</>; and when self morale is above<@cc.kw>12</>, <$cc.bd_a1><@cc.rem>Perception Information</></><@cc.vup>+10</>",
      "skillIcon": "bskill_ctrl_cost_bd2",
      "phase": "PHASE_0",
      "level": 1
    }
  ],
  "patch_info": {}
}