{
  "id": "char_433_windft",
  "meta_info": {
    "name": "Windflit",
    "appellation": " ",
    "voiceActor": {
      "en": "Caleb Yen",
      "jp": "Taku Yashiro",
      "kr": "Jung Ui-taek",
      "cn": "Wei Chen"
    },
    "rarity": 5,
    "profession": "Supporter",
    "subProfessionId": "Artificer",
    "position": "MELEE",
    "team": "",
    "tagList": [
      "DPS",
      "Support"
    ],
    "nationId": "Columbia",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Windflit\n[Gender] Male\n[Combat Experience] None\n[Place of Birth] Columbia\n[Date of Birth] Feb 2\n[Race] Perro\n[Height] 180cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Standard\n[Mobility] Standard\n[Physical Resilience] Excellent\n[Tactical Acumen] Normal\n[Combat Skill] Normal\n[Originium Arts Assimilation] Standard",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Windflit has two degrees in engineering and Originium engineering and is particularly experienced in mechanical design. He is currently a member of the Engineering Department and produces mechanical devices to aid our operators in combat.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nVery healthy, but his BMI is a little low for an adult Perro Male; should eat more.\n\n[Blood Originium-Crystal Density] 0.12u/L\nOperator Windflit rarely comes into contact with Originium.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Operator Windflit was born to a family of impoverished Columbian workers. Neither of his parents are Infected, but as they were unable to keep up with the rapid progress of technology, they could only keep working the most basic kind of work at the old factories' assembly lines. Windflit's parents had pinned their faith on him: they hoped he would break away from this cycle and not become a workman. Following their wishes, Windflit and his parents scraped together the tuition to get him enrolled in the city's affluent district's high school, though he transferred to another high school about half a year later and finished his studies there. Windflit is a fast learner, and he quickly got the hang of any mechanical assembly line when he helped his parents out at the factories, to the point that he pointed out areas of improvement. He also received excellent grades while he was in school and entered a famous Columbian academic institution to continue his mechanical studies.\nAfter he graduated, he was hired by Rhodes Island after sending us his resume. However, when he first came onboard, he showed some minor introverted tendencies as well as obvious animosity on an emotional level against operators from affluent backgrounds. The Doctor and HR operators should keep an eye out to prevent any internal strifes.\nCurrently, Windflit is assigned to the Engineering Department, where his main responsibilities include designing and producing Originium mechanical devices as well as providing our operators support during combat via mechanical devices.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "New Notice:\nAll combat operators who team up with Windflit must be aware that any devices enhanced by Windflit could explode.\n\nNow, I'm not saying every device out there could explode! It's just that each mission takes place in a different environment, and although there's not really much of a problem in using Windflit's unified design devices that Windflit brings with him, but all of us think about what we can do to improve our efficiency sometimes. Windflit's got some ideas when it comes to that too, and he often comes asking if an idea is feasible. Of course, the captain looks into his ideas and gives him a decision, and if he gets his approval, he starts modifying the devices on the spot. It actually works really well, too! I asked him where he learned all that. Most teachers and masters teach us to aim for stability when we make things, and they don't often recommend making modifications on the spot. He told me that he learned his ways from a club that he was in back in college.\nHis school must've been rich, too. He often talks about how they'd buy the hottest gadgets to take apart and mod, and how they'd have competitions to see who would reach the modding goal the fastest... Just listening to him talk about it got my heart stirring!\nCome to think of it, he also talked to Closure the other day about signing an agreement to mod old mechanical equipment. Once it's all said and done, he just has to show that agreement and he can mod any old mechanical part lying around in Engineering.\n\nNotice Update:\n If Windflit is found to be modifying any mechanical systems, immediately ask to see proof of Closure's permission.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "The Infected question is one that all non-Infected operators who join Rhodes Island eventually faces.\nIn Columbia, the Infected often moves to an Infected community or a frontier city. Even an impoverished family like Windflit's wouldn't live among the Infected if they had the option not to. Windflit, who has always been focused on his own life, rarely ever turned his attention to this group of people that seemed worlds apart.\nIt wasn't until he moved to the dormitories that he first truly understood what the equality promoted by the onboarding training truly meant. Having been treated harshly because of his family's situation, he knows better than anyone how it feels to be ostracized and discriminated against, which is why he is unwilling to make anyone else feel this way, even if he isn't yet entirely comfortable around them. And so, when Ethan welcomed his new roommate like an old buddy, Windflit simply accepted his goodwill. After the two got to know one another overtime, they started to have a decent understanding of each other's past.\n'As a non-Infected, is my existence itself unfair to the Infected?'\nOne time, Windflit asked Ethan during one of their everyday conversations. Ethan, scared half-dead as he never expected things to turn out this way, immediately told our HR personnel everything. After we learned how the events unfolded, we found that Windflit, who proverbially might perhaps be braindead on all subjects regarding unequal treatment, might have discovered something he had never realized: He always thought that he was on the side of being treated unfairly and that he had never treated anyone that way, but it now seems that this isn't necessarily the case.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'If it wasn't for my hard work, instead of receiving the recognition I now have, I would have become an unaccomplished, laughable man who's jealous of others.'\n'It's only because I always give everything my best effort that I have the breathing room to think about this,' said Windflit after his promotion as he looked at the medal in his hand.\nThis is how we discovered the reason behind Windflit's competitiveness.\nPer our observations, aside from reinforcing his knowledge for his day-to-day work, Windflit seems to particularly enjoy reading biographies. Whether the biography is on a political, literary, military, or civilian figure; whether the experiences written therein are from told by the subject himself or recounted by others; and whether the philosophies that can be derived from it are deep or shallow, Windflit will always quietly judge the decisions these historical figures made at the pivotal points of their lives. He once read the story of a scholar who persevered through seven failures before finally achieved success, and we found afterwards that the corners of those few pages of the book were particularly worn out by his fingers' frequent back-and-forth flipping.\nWhen he first came to Rhodes Island, Windflit mentioned he did not have any concrete plans for himself. The reason he decided to work is very simple: his parents are getting older in age. He said that ever since he became an adult, he had always felt a kind of pressure for spending all his time studying instead of helping his parents with their livelihood, even becoming their burden. Which is why, instead of continuing his studies, he opted to look for a job that paid a decent wage so that his parents didn't have to worry about money again.\nThat said, as he continued to build experience, he's slowly become a professional and dependable engineer.\nLately, Windflit also put together some minor technical patents from our automation technologies and a report on them, both of which Closure has already examined and approved. Windflit is hoping to send these to his parents to make their jobs easier.\nEverything is gradually taking a turn for the better, and Windflit also began to wonder whether he should continue his education. The reason that he had a change of mind is that not only has he slowly found the ability to help improve his parents lives, the experiences of the person in the biography also led him to look at things from a broader time scale. The operators of Rhodes Island, with their wide array of experiences, also showed Windflit how everyone never gave up no matter how quirky life gets. All of this encouraged him to take on the challenges he might face and pursue his dream.\nRhodes Island will sail to many more places, and there is much more for Windflit to experience. He is still young, and there are countless possibilities awaiting him.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "It gives me great relief to know that he is working for you.\nI was actually pretty worried before I got his letter. When I first heard the news, he seemed to have been in quite a bit of shock, so I was going to let some time pass first before introducing him to some similar companies. I certainly didn't expect him to contact your company.\nHe's a good student, and good students who can stay true to their hearts are hard to come by.\nHe didn't even look like he had any grudges when he said he would go work at the factory where his parents worked. He truly wanted to use the skills he learned to help workers like his parents. It took both his parents and me a long time to talk him out of the idea.\nHe never thought of joining a big company as proof of who he is, and he has more ambition than I expected, making the decision to go back home.\nThat said, I'm afraid my club might've caused some of his bad habits. I mean, no one could bring themselves to fetter a good boy like him in any way. You'll have to forgive him for his eccentricities.\n—A letter from Windflit's teacher",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 2080,
      "atk": 468,
      "def": 357,
      "magicResistance": 0,
      "blockCnt": 2,
      "baseAttackTime": 1.5,
      "respawnTime": 70,
      "cost": 18
    }
  },
  "skins": [
    {
      "skinId": "char_433_windft#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_433_windft",
      "portraitId": "char_433_windft_1",
      "illustId": "illust_char_433_windft_1",
      "modelName": "Windflit",
      "drawerList": [
        "nineo"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_433_windft#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_433_windft_2",
      "portraitId": "char_433_windft_2",
      "illustId": "illust_char_433_windft_2",
      "modelName": "Windflit",
      "drawerList": [
        "nineo"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1182,
            "atk": 238,
            "def": 193,
            "magicResistance": 0,
            "cost": 14,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.5,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1620,
            "atk": 351,
            "def": 277,
            "magicResistance": 0,
            "cost": 14,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.5,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 70,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1620,
            "atk": 351,
            "def": 277,
            "magicResistance": 0,
            "cost": 16,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.5,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 2080,
            "atk": 468,
            "def": 357,
            "magicResistance": 0,
            "cost": 16,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.5,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3271",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30042",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30052",
          "count": 2,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 80,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 2080,
            "atk": 468,
            "def": 357,
            "magicResistance": 0,
            "cost": 18,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.5,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 2600,
            "atk": 565,
            "def": 425,
            "magicResistance": 0,
            "cost": 18,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.5,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3273",
          "count": 3,
          "type": "MATERIAL"
        },
        {
          "id": "30054",
          "count": 7,
          "type": "MATERIAL"
        },
        {
          "id": "30093",
          "count": 11,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_windft_1",
      "skillName": "Machine Rapport",
      "desc": "The next attack deals <@ba.vup>{atk_scale:0%}</> ATK as Physical damage to all ground enemies in the 8 surrounding tiles, and restores <@ba.vup>{attack@sp}</> SP to anyone equipped with a Reliable Battery\n<@ba.rem>Can store {ct} charges</>",
      "iconId": "skchr_windft_1",
      "spCost": 6,
      "initSp": 0,
      "duration": 0,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 2.5
        },
        {
          "key": "attack@sp",
          "value": 1
        },
        {
          "key": "ct",
          "value": 3
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31043",
              "count": 1,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_windft_2",
      "skillName": "Energy Rapport",
      "desc": "Attack interval <@ba.vdown>increases</>, ATK <@ba.vup>+{atk:0%}</>; Talent ATK bonus increased to <@ba.vup>{talent_scale}</>x; When the skill ends, obtain 1 Reliable Battery",
      "iconId": "skchr_windft_2",
      "spCost": 50,
      "initSp": 35,
      "duration": 15,
      "blackboard": [
        {
          "key": "atk",
          "value": 1.6
        },
        {
          "key": "talent_scale",
          "value": 2
        },
        {
          "key": "base_attack_time",
          "value": 0.5
        },
        {
          "key": "windft_s_2_recharge.cnt",
          "value": 1
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31013",
              "count": 2,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_windft",
      "moduleName": "Windflit's Badge",
      "desc": "Operator Windflit has demonstrated a remarkable aptitude for utilizing installations so as to aid teammates in combat.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Supporter Operator during field operations to exercise Artificer responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_windft",
      "moduleName": "'A Bright Idea Occurs'",
      "desc": "'Gantt, whatcha all alone for again? Still pissed about them folks?'\n'They're from his high school. Ain't happy their teach made him a student too. They just won't drop it—it's driving me insane.'\n'Their leader was the last president, right? Put in some rule about only taking students from good families, and kept nitpicking Gantt for his background. Screwed with us so bad we couldn't even study properly? We ended up kicking him out, didn't we? The teacher was so happy his tail was on overdrive the next few days, not that he'd say.\n'C'mon, Gantt, no more eatin' alone. We'll eat with you. You missed it, but we kicked their butts up and down the field today. Scared 'em shitless!'\n'Just smiled, didn't you, Gantt? Knew that'd cheer you up. No need to hide next time they come mess with you—they'll have to go through us!'\n'What? Stop the drill a sec, Gantt, I didn't catch that. You said you wanna treat us to three days meals? C'mon, man, you don't need to be treatin' us to food just for winnin' a game. Three whole days, even? What, you're seriously saying it's that valuable to you? Listen, how's about you check on my refits for me, and we cut it down to two days. Deal?\n'Hold on, Gantt, you promised if I checked on your installations you'd write my report for me, and you never did! The teacher damn near plucked my feathers clean the day we had to turn it in! That's one meal you owe me!\n'What, I cut class thirteen times and you had to sign me in each time, that's why you dropped the report?'\n'Well, then, here's bad news for everyone! We figured for last month's applications we just had to pull the ole' man's heartstrings, get a little more funding, right? But Gantt couldn't pull it off, so that's one less Ultimate Frisbee, isn't it?'\n'The ole' man says he's immune to Gantt waggin' his tail now? Dang, that's bad—gah, where happened to the lights? Was it the breakers?'\n'What's that smell?'\n'Gantt! Your installation's on fire!'\n......\n'It's out! And I say firefighting's worth at least two meals!'\n'Quit apologizin', whatcha sorry for? This place is blowin' up daily, just treat us twice and we're good!'\n'Do any other teams deal in food and reports and frisbees like we do? Didn't you come up with this too, Gantt?\n'Alright, I get it, the idea of money changing hands between us doesn't sit with you. Relax, okay? Adding some cash to the equation wouldn't change a thing, y'know. But it's fine, yeah? Whatever you're comfortable with.\n'So, then, like we said, you check on my equipment here, and I compensate you with—a month of food, two maintenance checkups, a report, and three rounds of Ultimate Frisbee?! Hold on, lemme check my math!\n'Huh, what, what? What're you patting my shoulder all serious for?\n'You'd still help me without any compensation? And that goes for the entire team? No matter when?\n'Because we're the first pile of friends you ever made? Well, hell! You for real, Gantt?'\n'...Hold on, who counts their friends in 'piles,' huh? Hahaha! Come on, let's go get ourselves some grub!'"
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "I get oil on me real easy, so I don't clean my apron often... There's some on my face too? Uhh, I'll go get it off.",
      "voiceAsset": "char_433_windft/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Doctor, I don't know if this is offensive to ask, but... say you start things out with a mindset that gets people to live in peace with the Infected. Do you ever feel like your effort is in vain? What do you do, in times like that?",
      "voiceAsset": "char_433_windft/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "I consulted with my profs and sent a lot of resumes out close to graduation, but got no reply. I was told later how a lot of spots and big companies  are fixed in advance, and not for students with no background like me. So the day I got Rhodes Island's hiring invitation, I thought it was some employment scam.",
      "voiceAsset": "char_433_windft/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Doctor! I ever tell you about my club at college? We used the funds from the school to buy new machines on the market, tear 'em down and reassemble 'em. Learnt a lot of new stuff that way. Is Rhodes Island about that too? Check this one out! It's smoking right now, sure, but it's got new functionality.",
      "voiceAsset": "char_433_windft/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "I helped out at my parents' factory when I was a kid. Lots of stuff you've just gotta count on pure manual labor for. I've gone over all the notes the vets at Engineering lent me. If we can pass all this new tech down to my parents, we can save 'em a lot of effort.",
      "voiceAsset": "char_433_windft/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "My parents saved hard for a good school when I was a kid. I had classmates clowning on us for being poor, so I was dead set on learning something, showing them who's boss. They might still be living a cushier life than me, but nowadays, I just focus on myself.",
      "voiceAsset": "char_433_windft/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Doctor, Rhodes Island is all real passionate folks. Saying they wanna make me clothes, they wanna gimme a haircut, and then they drag me off to show me around their own stalls. What do I do...? H—Hug 'em? Got it. I'll go try right now.",
      "voiceAsset": "char_433_windft/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Doctor, I've never had a boss like you before. Ones I met before were all money-grubbing owner types, so... y'know hugs have really worked out. Can I hug you? C'mon, here we go!",
      "voiceAsset": "char_433_windft/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "I used to feel like this world was unfair, no matter where you went, and no one could do a thing to change it. But here, poverty or infection, none of that discrimination exists, and everyone gets rewarded equal to what they put in. Doctor, pulling this whole thing off...it's incredible.",
      "voiceAsset": "char_433_windft/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "You out? Real quiet... Woof! —Ooh, awake now, Doctor?",
      "voiceAsset": "char_433_windft/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Nice meeting you, Doctor, I'm Windflit, new Operator at Engineering. You said you saw ability in me? Real thankful for that.",
      "voiceAsset": "char_433_windft/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "Effort is the root of progress. Regular review lets me realize a lotta issues I overlooked before.",
      "voiceAsset": "char_433_windft/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "I really love Rhodes Island's standards for promotion. No unfairness about 'em.",
      "voiceAsset": "char_433_windft/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "Getting to this level of endorsement makes all my previous effort really kinda pay off. Doctor, Rhodes Island truly is a company worth sticking with for a long time.",
      "voiceAsset": "char_433_windft/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "I've got no combat experience, but I'll give it my best shot.",
      "voiceAsset": "char_433_windft/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "I'm not circling you all because I wanna. You're all too scattered apart. It'll be dangerous.",
      "voiceAsset": "char_433_windft/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Can't let 'em bully us. Let's go!",
      "voiceAsset": "char_433_windft/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "I wonder if these guys have their own problems too...",
      "voiceAsset": "char_433_windft/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "All ready.",
      "voiceAsset": "char_433_windft/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "When do we get going?",
      "voiceAsset": "char_433_windft/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "No need to worry.",
      "voiceAsset": "char_433_windft/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "I can do this.",
      "voiceAsset": "char_433_windft/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Woof!!",
      "voiceAsset": "char_433_windft/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Device set!",
      "voiceAsset": "char_433_windft/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "What is it you guys fight for?",
      "voiceAsset": "char_433_windft/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Still coming closer?",
      "voiceAsset": "char_433_windft/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Phew... Each new battle teaches me a lotta new things. Maybe one day, I can finally get my own issues figured out.",
      "voiceAsset": "char_433_windft/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Doctor, how was my equipment this time? Real useful, right?!",
      "voiceAsset": "char_433_windft/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Let's forget chasing 'em, maybe they've got their own problems. They chose to run, so no need to corner 'em now.",
      "voiceAsset": "char_433_windft/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Ugh... how did this happen...",
      "voiceAsset": "char_433_windft/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Real spacious room. And real clean.",
      "voiceAsset": "char_433_windft/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Huh? Was that my ears?",
      "voiceAsset": "char_433_windft/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "I welded together this little metal doll kinda thing to look like you, hahaha...",
      "voiceAsset": "char_433_windft/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_433_windft/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Never got to really celebrate when I was a kid. Have the right conditions now, but it's not with my family. Just need to make a bit more cash, and then I can ask for a couple days off and go see 'em again without worrying about my salary. That's my New Year's resolution.",
      "voiceAsset": "char_433_windft/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Doctor, wanna play Ultimate?",
      "voiceAsset": "char_433_windft/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Happy birthday, Doctor~ I'm not all that good at picking, is this kind of cake your thing? C'mon, let's have another hug.",
      "voiceAsset": "char_433_windft/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "This really sells Rhodes Island as a loaded place. Is everyone gonna be able to finish all this food off? Not gonna be nice to waste it. Ooh—is that Kay over there? Not—Not gonna hold her back?",
      "voiceAsset": "char_433_windft/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "workshop_formula_probability[115]",
      "buffName": "Required Course",
      "desc": "When this Operator is assigned to the Workshop to process <@cc.kw>elite material</>, the production rate of byproduct increases by <@cc.vup>75%</>",
      "skillIcon": "bskill_ws_evolve2",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "manu_prod_spd&power[000]",
      "buffName": "Automation α",
      "desc": "When this Operator is assigned to a Factory, the productivity contributed by all other Operators in that Factory <@cc.vdown>becomes 0</> (excluding productivity granted based on facility count), but each <@cc.kw>Power Plant</> increases that Factory's productivity by <@cc.vup>+5%</>",
      "skillIcon": "bskill_man_spd&power1",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}