{
  "id": "char_4019_ncdeer",
  "meta_info": {
    "name": "Nine-Colored Deer",
    "appellation": " ",
    "voiceActor": {
      "en": "",
      "jp": "",
      "kr": "",
      "cn": ""
    },
    "rarity": 5,
    "profession": "Supporter",
    "subProfessionId": "Abjurer",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "Support",
      "Survival"
    ],
    "nationId": "Yan",
    "isNotObtainable": false,
    "itemObtainApproach": "Event Reward",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Nine-Colored Deer\n[Gender] Female\n[Combat Experience] None\n[Place of Birth] Yan\n[Date of Birth] Dec 8\n[Race] Elafia\n[Height] 172cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Normal\n[Mobility] Normal\n[Physical Resilience] Standard\n[Tactical Acumen] Excellent\n[Combat Skill] Standard\n[Originium Arts Assimilation] Standard",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Nine-Colored Deer, claims to come from a mountain forest in Yan, specific location as yet unascertained.\nPossesses ample knowledge related to gathering and processing of herbals, and holds a degree of combat ability. Through introduction from other operators, came to Rhodes Island on exchange study, traveling with Rhodes Island for the near future. ",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Nine-Colored Deer shows no signs of Infection.\n\n[Blood Originium-Crystal Density] 0.13u/L\nOperator Nine-Colored Deer fulfils fundamental protective measures in aiding Oripathy sufferers, and we have detected no risk of Oripathy infection.\n\nNine-Colored Deer is in very good health. We hear she's very familiar with the herbals of Yan; we can consider having her teach other operators the way to distinguish them. And while we're at it, we can have her talk with Myrrh a little more, too. Maybe we'll have some way to rid the herbs of that bitterness...\n—Medic Operator Breeze",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Though she's never had standard training, Nine-Colored Deer bears a fairly distinct awareness of the battlefield. We have no way to know of her former experiences, but based on her emergency treatment of wounds and skill in transporting casualties, she must have been through many desperate situations. Each person takes away different things from a disaster, some choosing to flee, some choosing to actively confront it. Nine-Colored Deer is the latter, and has continuously conferred with and studied from the Medical Department's operators since arriving at Rhodes Island, her mind for constant learning catching on with others, other departments' operators beginning to learn first-aid knowledge with her.\n'Nothing wrong with learning a little more first aid! If we ever end up in danger, I can even help out!'\n—An operator from HR",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'Um, right, I randomly met Nine-Colored Deer while out in Yan collecting herbal samples. It gave me a shock when she suddenly appeared next to me. No... I heard her footsteps, but... when some fowlbeasts perched on her shoulders, that really startled me. Who brings fowlbeasts with them hiking? ...Oh, yeah, she said she'd moved up to the mountains long ago. I was really curious how she managed to live in the mountains for such a long time. Don't you get restless being all alone up there...?'\n'Her room was filled with unfinished herbal pills. Uh-huh, she said she usually went into the mountains to collect fresh herbs, and she'd worked out a special way to make herbal pills. She blended Yanese tea leaves and local ground herbs and made a pill from it, and it had a faint tea flavor when you ate it, and it wasn't too strongly bitter. No, don't worry, it was just a pill to help with health. Hey, don't look at me like that! I don't just eat anything I see, I swear!'\n'There was a clinic in the village at the mountain's base, where she'd take the pills she'd made to the patients. The clinic seemed to have worked with her for a long time, and she'd provide them with herbal medicine free of charge... really, it really was free! Why would I be lying to you? When she first gave them medicine, the doctor had doubts about the quality. When does something just land in your lap for free, after all? So at first, they went without using any of it. It took until a doctor came across Nine-Colored Deer treating a villager who tripped and crashed onto a rock, and they saw her medical skills, before they realized they were that close to letting someone so able slip away. Yeah, the doctor there told me! Afterwards, they even went to compliment her for her medicinal knowledge and knack for treatment. And, you know, there's never enough medical resources in remote areas like that, and the fact the patients there could get her treatment really did feel heaven-sent. Oh, yeah, she barely ever gave treatment directly at the clinic, she just gave them herbal pills. She'd only lend a hand when the clinic needed the help. Makes you wonder too, right? I thought she was a little frightened of human contact, but it seemed like she'd gone through something before, and I didn't want to dredge it up.'\n'After that, I thought it wouldn't do much harm if I stayed a few more days, so I chatted for a while longer with her. She wanted to improve her own medical skills, and go save more people. So I gave her an invitation, hoped she'd come to Rhodes Island for a kind of skill exchange. Whoa, the clinic doctor and the patients there really wanted to hit me when I suggested the invitation. They didn't want her to leave at all. I completely understood the feeling, so I stopped running my mouth there...'\n'After that, she spent a long time talking it over with the patients, and in the end proposed she'd come to Rhodes Island for a week or two at a time to communicate and study... I just need to go and fetch her.  Can we get her set up in my dorm when the time comes? ...Alright, I guess that'll do it. Huh? I have to submit my reason for overstaying there on paper? G—Gimme a sec and I'll go write it.'\n\n—A certain Operator's field voice recording",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "In her early years, Nine-Colored Deer traveled Yan, treating and saving people as she roamed. Rescuing the dying and wounded, asking for nothing in return, those were her principles. When passing through a village just recently struck by Catastrophe, she stopped in her tracks and stayed to aid the casualties. She treated people with the greatest kindness, but sadly never received their goodwill in turn. Communications in the village had been cut off at the time, and stockpiled medical supplies and drugs were critically insufficient, more and more patients being bedridden due to lack of medicated treatment. She and the one doctor left in the village were forced to search for herbals in the nearby mountains, in order to make up for the deficiency. She firmly believed she could pull this village with nothing left away from the brink. But contrary to her hopes, rumors began spreading among the already feeble populace, and within them, Nine-Colored Deer transformed from a physician to an evil, a herald of calamity.\n'This woman only stays here so she can promote her cures, and gain our trust!' 'Look at her Originium Arts! She's the one who brought the Catastrophe!' She had to face not just the bitter cries of the sick, but the unguessable human heart. Though she never took notice of the villagers' slander,  these rumors rotted some of the people inside. Finally, a few brute villagers assembled in front of her, forcibly demanding the 'Elafia who brought us disaster' leave the place.\nIn the end, she entrusted her books filled with methods to treat illnesses, her methods for making herbal pills to that doctor, and walked far to the closest town, to inform the outside world this village still needed aid. Following that, she left that place, headed for the mountain forests to find somewhere secluded.\nHowever, the mountains were by no means always so peaceful, and the clinic at their foot always had patients in need of help. After hesitating again and again, she delivered her herbals to the doctor after all. Fortunately, this time saw no reprisal of the last.\nShe still maintains her principles, and she firmly believes, treating the heart of the people is more important than treating the body.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'You're finally back~ How was field work this time? Er... are you alright there?'\n'I'm dead on my feet here... hold on, how long's it been since we saw each other?'\n'About seven days? What's up...?'\n'What have you been eating to fill yourself out like that? Look, you've got meat on your chin now!'\n'Food's been really good at the canteen lately. Just been having more, that's all.'\n'You sure you didn't beg Hung to make a whole week's food for you?'\n'Gimme a break... I'm not even like that. It was a Yan operator, codename's Nine-Colored Deer. I've told you, the Yan cuisine she makes is suuuuper good.'\n'Any left? Lemme try some!'\n'Still plenty. She's kept a whole bunch of food ready in the fridge, especially for operators who get back late. What are you hankering for? Spicy or not? Something sweet? I'll heat it up and bring it over to you.'\n'You can choose what you want?? Gimme something spicy, then, uh... no, scratch that, non-spicy. Belly's not been feeling good lately.'\n'What's wrong with it? There's stomach pills here too. Here, have one.'\n'What, pills? Nah, nah, nah, leave it, they're too bitter for me. I'll have some porridge when I get back.'\n'These pills aren't bitter at all. They've got a little tea flavor, even. Try 'em. I had a bad gut when I got back a few days ago, and it was taking the pills for a few days that cured it.'\n'You sure? Shoot me one, then... they're *not* bitter!'\n'Right? I told you.'\n'First time I've had a pill that's not bitter. Who made it? Can I buy a few?'\n'Same person from Yan. She made the one you just had. Hold on, I found the congee. Lemme heat it one sec, and then you take your time eating.'\n'Don't tell me she made that too?'\n'Still her. Everything on the top shelves in here, she made. All the food with stickers on it. If you want more, you can pull some out and warm it. Oh, right, she left all the pills in this box here too. Stomach medicine is the blue sticker. Don't get mixed up.'\n'She made all this medicine herself?'\n'She collects herbs all the time in Yan, and she makes the pills and brings them in.'\n'What can't she do... I feel like I know why you got meat on your bones so quick now.'\n'I mean, you know? Meals have just been amazing lately. If my mom could make stuff so delicious, I'd be a ball by now.'\n'Nothing wrong with that. Here, hey-hey-hey, you have some too. Too sad eating by myself.'\n'Sure. I'll go get another bowl.'\n'You've been eating this for days on end and you haven't gotten any present to thank her or anything?'\n'I sent her some flowers earlier, but it's just all flowers outside her dorm door. All of them from everyone else.'\n'I've got something good here. Bought it on the way back from the field. Let's go together tomorrow and give to her.'\n\n——Cafeteria recording monitor, unknown timestamp",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Nine-Colored Deer likes the fresh scent of vegetation, admiring the ink of scrolls while it's still not dry, and trying delicate new teas.\nShe likes all of these, and it's because of it that she so carefully cherishes them.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1314,
      "atk": 367,
      "def": 157,
      "magicResistance": 25,
      "blockCnt": 1,
      "baseAttackTime": 1.6,
      "respawnTime": 70,
      "cost": 11
    }
  },
  "trait": [
    {
      "unlockCondition": {
        "phase": "PHASE_0",
        "level": 1
      },
      "requiredPotentialRank": 0,
      "blackboard": [
        {
          "key": "heal_scale",
          "value": 0.75
        }
      ],
      "overrideDescription": "Deals <@ba.kw>Arts damage</>; When skill is active, attacks instead restore the HP of allies (heal amount is equal to <@ba.kw>{heal_scale:0%}</> of ATK)",
      "prefabKey": "",
      "rangeId": null
    }
  ],
  "skins": [
    {
      "skinId": "char_4019_ncdeer#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_4019_ncdeer",
      "portraitId": "char_4019_ncdeer_1",
      "illustId": "illust_char_4019_ncdeer_1",
      "modelName": "Nine-Colored Deer",
      "drawerList": [
        "IRIS_呓"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_4019_ncdeer#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_4019_ncdeer_2",
      "portraitId": "char_4019_ncdeer_2",
      "illustId": "illust_char_4019_ncdeer_2",
      "modelName": "Nine-Colored Deer",
      "drawerList": [
        "IRIS_呓"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_4019_ncdeer@ncdeer#1",
      "skinName": "A Silvern Caress On the Flow of Time",
      "skinGroupName": "Nine-Colored Deer",
      "skinGroupId": "2023#ncdeer",
      "avatarId": "char_4019_ncdeer_ncdeer#1",
      "portraitId": "char_4019_ncdeer_ncdeer#1",
      "illustId": "illust_char_4019_ncdeer_ncdeer#1",
      "modelName": "Nine-Colored Deer",
      "drawerList": [
        "IRIS_呓"
      ],
      "description": "<color name=#ffffff>'Nine-Colored Deer' Collaborative Series/A Silvern Caress On the Flow of Time. Crossing the golden sands yet leaving nary a trace, time passes quietly along with the moon's shadow. Nine-Colored Deer meticulously counts the tracks left behind by the passing years, and thus the full moon pauses, seeking one to converse with.</color>",
      "rarity": 155
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "y-2",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 660,
            "atk": 200,
            "def": 83,
            "magicResistance": 15,
            "cost": 9,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 972,
            "atk": 286,
            "def": 119,
            "magicResistance": 15,
            "cost": 9,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 70,
      "rangeId": "y-6",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 972,
            "atk": 286,
            "def": 119,
            "magicResistance": 20,
            "cost": 11,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 1314,
            "atk": 367,
            "def": 157,
            "magicResistance": 20,
            "cost": 11,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3271",
          "count": 4,
          "type": "MATERIAL",
          "name": "Supporter Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_SUP1"
        },
        {
          "id": "30012",
          "count": 6,
          "type": "MATERIAL",
          "name": "Orirock Cube",
          "rarity": 2,
          "iconId": "MTL_SL_G2"
        },
        {
          "id": "30032",
          "count": 3,
          "type": "MATERIAL",
          "name": "Polyester",
          "rarity": 2,
          "iconId": "MTL_SL_RUSH2"
        }
      ]
    },
    {
      "maxLevel": 80,
      "rangeId": "y-6",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1314,
            "atk": 367,
            "def": 157,
            "magicResistance": 25,
            "cost": 11,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1685,
            "atk": 443,
            "def": 179,
            "magicResistance": 25,
            "cost": 11,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3273",
          "count": 3,
          "type": "MATERIAL",
          "name": "Supporter Dualchip",
          "rarity": 5,
          "iconId": "MTL_ASC_SUP3"
        },
        {
          "id": "30084",
          "count": 7,
          "type": "MATERIAL",
          "name": "Manganese Trihydrate",
          "rarity": 4,
          "iconId": "MTL_SL_MANGANESE2"
        },
        {
          "id": "31033",
          "count": 14,
          "type": "MATERIAL",
          "name": "Crystalline Component",
          "rarity": 3,
          "iconId": "MTL_SL_OC3"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_ncdeer_1",
      "skillName": "Fortune Bringer of the Mortal Realm",
      "desc": "ATK <@ba.vup>+{atk:0%}</>",
      "iconId": "skchr_ncdeer_1",
      "spCost": 30,
      "initSp": 12,
      "duration": 25,
      "blackboard": [
        {
          "key": "atk",
          "value": 0.6
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30083",
              "count": 2,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_ncdeer_2",
      "skillName": "Return to the Immortal Mountain",
      "desc": "ASPD <@ba.vup>+{attack_speed}</> and gain <@ba.vup>{prob:0%}</> ranged Physical resist. HP Ratio required to activate this unit's Talent is increased to <@ba.vup>{talent@hp_ratio:0%}</>",
      "iconId": "skchr_ncdeer_2",
      "spCost": 40,
      "initSp": 30,
      "duration": 20,
      "blackboard": [
        {
          "key": "attack_speed",
          "value": 50
        },
        {
          "key": "talent@hp_ratio",
          "value": 1
        },
        {
          "key": "prob",
          "value": 0.7
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31013",
              "count": 1,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "potentialRanks": [],
  "favorKeyFrames": [
    {
      "level": 0,
      "data": {
        "maxHp": 0,
        "atk": 0,
        "def": 0,
        "magicResistance": 0,
        "cost": 0,
        "blockCnt": 0,
        "moveSpeed": 0,
        "attackSpeed": 0,
        "baseAttackTime": 0,
        "respawnTime": 0,
        "hpRecoveryPerSec": 0,
        "spRecoveryPerSec": 0,
        "maxDeployCount": 0,
        "maxDeckStackCnt": 0,
        "tauntLevel": 0,
        "massLevel": 0,
        "baseForceLevel": 0,
        "stunImmune": false,
        "silenceImmune": false,
        "sleepImmune": false,
        "frozenImmune": false,
        "levitateImmune": false,
        "disarmedCombatImmune": false,
        "fearedImmune": false
      }
    },
    {
      "level": 50,
      "data": {
        "maxHp": 350,
        "atk": 35,
        "def": 0,
        "magicResistance": 0,
        "cost": 0,
        "blockCnt": 0,
        "moveSpeed": 0,
        "attackSpeed": 0,
        "baseAttackTime": 0,
        "respawnTime": 0,
        "hpRecoveryPerSec": 0,
        "spRecoveryPerSec": 0,
        "maxDeployCount": 0,
        "maxDeckStackCnt": 0,
        "tauntLevel": 0,
        "massLevel": 0,
        "baseForceLevel": 0,
        "stunImmune": false,
        "silenceImmune": false,
        "sleepImmune": false,
        "frozenImmune": false,
        "levitateImmune": false,
        "disarmedCombatImmune": false,
        "fearedImmune": false
      }
    }
  ],
  "talents": [
    {
      "candidates": [
        {
          "unlockCondition": {
            "phase": "PHASE_0",
            "level": 1
          },
          "requiredPotentialRank": 0,
          "prefabKey": "1",
          "name": "Ethereal Iridescent Clouds",
          "description": "Apply 8% <$ba.protect>Sanctuary</> effect to allies within range with less than 40% HP",
          "blackboard": {
            "hp_ratio": 0.4,
            "damage_resistance": 0.08
          },
          "tokenKey": null,
          "isHideTalent": false
        },
        {
          "unlockCondition": {
            "phase": "PHASE_1",
            "level": 1
          },
          "requiredPotentialRank": 0,
          "prefabKey": "1",
          "name": "Ethereal Iridescent Clouds",
          "description": "Apply 14% <$ba.protect>Sanctuary</> effect to allies within range with less than 40% HP",
          "blackboard": {
            "hp_ratio": 0.4,
            "damage_resistance": 0.14
          },
          "tokenKey": null,
          "isHideTalent": false
        },
        {
          "unlockCondition": {
            "phase": "PHASE_2",
            "level": 1
          },
          "requiredPotentialRank": 0,
          "prefabKey": "1",
          "name": "Ethereal Iridescent Clouds",
          "description": "Apply 20% <$ba.protect>Sanctuary</> effect to allies within range with less than 40% HP",
          "blackboard": {
            "hp_ratio": 0.4,
            "damage_resistance": 0.2
          },
          "tokenKey": null,
          "isHideTalent": false
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_ncdeer",
      "moduleName": "Nine-Colored Deer's Badge",
      "desc": "Nine-Colored Deer has demonstrated a remarkable aptitude for providing continuous protection to allies.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Supporter Operator during field operations to exercise Abjurer responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named.",
      "typeIcon": "original",
      "uniEquipIcon": "uniequip_001_ncdeer",
      "typeName1": "ORIGINAL",
      "typeName2": "",
      "showEvolvePhase": "PHASE_2",
      "unlockLevel": 0,
      "missionList": [],
      "unlockFavors": {},
      "itemCost": {},
      "module_upgrades": []
    },
    {
      "moduleId": "uniequip_002_ncdeer",
      "moduleName": "'Elixir'",
      "desc": "In a small courtyard, a young farmer put down his tools and took a seat.\n'Hey, thanks a ton for helping me with my leg! Didn't have a whole lotta practice swinging these tools around and nearly crippled myself, couldn't even walk.'\nThe doctor packaged the herbs along with the formula, carefully instructing the patient to mind the timing and frequency of taking the medicine.\nThe farmer sat on the ground and looked up at the mountains, saying: 'Doctor! I can reclaim half an acre of land a day, but there are so many mouths to feed in the village. If I want to free up the entire mountain to grow food for 'em all, even another century might not be enough!\n'Doctor, got any recipes that'd give me the long life and boundless strength of a burdenbeast? The whole village is counting on me!'\nThe doctor smiled with a furrowed brow, folding an extra corner in a medical tome. 'I'll see what I can do.'\n\nThe doctor traveled far and wide, and by the time she knocked on the doors of that small courtyard once more, several more tombstones were dotting the wilderness.\nThe farmer was sitting at the doorstep, holding a shriveled ear of wheat. His face had become wrinkled, his fist beating at his chest as he gasped for breath. 'The old burdenbeast passed on. The poor fella didn't even last as long as me.'\nThe doctor had seen this before. She said that he wasn't sick, only that he should avoid excessive exertion, before writing a few more prescriptions.\nThe farmer set the herbs aside: 'I wanna send my youngest to a nomadic city, where he'd have a better future. But, there ain't enough money here, not enough land.'\nHe grasped the reins of the newly-purchased young burdenbeast, and thought long and hard. 'Doctor, if I keep on farmin' like this, I don't think I'm gonna last very long... What do you reckon I do? If I'm gone, what's my kid gonna do? ...I don't suppose you could give me a few extra years?'\nThe doctor did not know what else to say; all she could do was take out a few pellets of medicine: 'These can either bolster your vitality, or...'\n\nWhen the doctor passed through countless fields, walked through villages and towns of all shapes and sizes, and heard all manner of prayers, she would think back to that gaunt, bony burdenbeast and the farmer goading it onward.\nThere were more people in the small courtyard than usual. The farmer was lying there on the bed, his sons and daughters holding his hands. Behind them stood <i>their</i> sons and daughters, looking at her as if imploring her to do something.\nThe doctor approached. 'You asked me before if there was a medicine that could grant you long life. I've made it, so if you take it now, you can still...'\nThe old man remained silent, his shrunken face finally moving: 'No need. How could something like that really exist? ...Doctor, you won't get any older, but even if I took it, it probably wouldn't do anything...'\nThe doctor followed his gaze outside the room. The seeds had only been half-sown, and the farmer's youngest son was still there, his legs covered in mud. The old farmer let out a sigh and closed his eyes, and the son began to cry softly.\n\nThe doctor stepped into the mountainous woods.\n'Is there no cure for old age?' Nobody answered, only the whispers of the mountains and trees, and the low cries of the fowlbeasts.\nThe wild mountain lotus spoke: 'There is no cure for old age. The search for immortality is but the pipe dream of nobles and aristocrats.'\n'Is there no cure for illness?'\nThe beastling spoke: 'Illness can be cured. All sentient beings seek only to be free of disease and disaster.'\nThe doctor turned around. The wild mountain lotus bloomed, the beastling lapped at water, but neither said a word.\nThe doctor then understood. 'Not for immortality, but to avert disaster. The people are suffering, and I shall only treat illness from now on.'",
      "typeIcon": "bls-x",
      "uniEquipIcon": "uniequip_002_ncdeer",
      "typeName1": "BLS",
      "typeName2": "X",
      "showEvolvePhase": "PHASE_2",
      "unlockLevel": 50,
      "missionList": [
        "uniequip_002_ncdeer_1",
        "uniequip_002_ncdeer_2"
      ],
      "unlockFavors": {
        "1": 0,
        "2": 2732,
        "3": 10070
      },
      "itemCost": {
        "1": [
          {
            "id": "mod_unlock_token",
            "count": 2,
            "type": "MATERIAL"
          },
          {
            "id": "30044",
            "count": 3,
            "type": "MATERIAL"
          },
          {
            "id": "4001",
            "count": 40000,
            "type": "GOLD"
          }
        ],
        "2": [
          {
            "id": "mod_unlock_token",
            "count": 2,
            "type": "MATERIAL"
          },
          {
            "id": "mod_update_token_1",
            "count": 20,
            "type": "MATERIAL"
          },
          {
            "id": "31054",
            "count": 4,
            "type": "MATERIAL"
          },
          {
            "id": "4001",
            "count": 50000,
            "type": "GOLD"
          }
        ],
        "3": [
          {
            "id": "mod_unlock_token",
            "count": 2,
            "type": "MATERIAL"
          },
          {
            "id": "mod_update_token_2",
            "count": 8,
            "type": "MATERIAL"
          },
          {
            "id": "30104",
            "count": 5,
            "type": "MATERIAL"
          },
          {
            "id": "4001",
            "count": 60000,
            "type": "GOLD"
          }
        ]
      },
      "module_upgrades": [
        {
          "equipLevel": 1,
          "attributeBlackboard": [
            {
              "key": "atk",
              "value": 25,
              "valueStr": null
            },
            {
              "key": "def",
              "value": 15,
              "valueStr": null
            }
          ],
          "tokenAttributeBlackboard": {},
          "parts": [
            {
              "target": "TRAIT_DATA_ONLY",
              "isToken": false,
              "talents": [],
              "trait": [
                {
                  "additionalDescription": null,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "blackboard": [
                    {
                      "key": "heal_scale",
                      "value": 1,
                      "valueStr": null
                    }
                  ],
                  "overrideDescripton": "Deals <@ba.kw>Arts damage</>; When skill is active, attacks instead restore the HP of allies (heal amount is equal to <@ba.kw>{heal_scale:0%}</> of ATK)",
                  "prefabKey": null,
                  "rangeId": null
                }
              ]
            }
          ]
        },
        {
          "equipLevel": 2,
          "attributeBlackboard": [
            {
              "key": "atk",
              "value": 40,
              "valueStr": null
            },
            {
              "key": "def",
              "value": 20,
              "valueStr": null
            }
          ],
          "tokenAttributeBlackboard": {},
          "parts": [
            {
              "target": "TRAIT_DATA_ONLY",
              "isToken": false,
              "talents": [],
              "trait": [
                {
                  "additionalDescription": null,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "blackboard": [
                    {
                      "key": "heal_scale",
                      "value": 1,
                      "valueStr": null
                    }
                  ],
                  "overrideDescripton": "Deals <@ba.kw>Arts damage</>; When skill is active, attacks instead restore the HP of allies (heal amount is equal to <@ba.kw>{heal_scale:0%}</> of ATK)",
                  "prefabKey": null,
                  "rangeId": null
                }
              ]
            },
            {
              "target": "TALENT_DATA_ONLY",
              "isToken": false,
              "talents": [
                {
                  "displayRangeId": false,
                  "upgradeDescription": "Grants a 23% <$ba.protect>Sanctuary</> effect to all friendly units within range with less than 50% HP",
                  "talentIndex": 0,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "prefabKey": "1",
                  "name": "Ethereal Iridescent Clouds",
                  "description": null,
                  "rangeId": null,
                  "blackboard": [
                    {
                      "key": "hp_ratio",
                      "value": 0.5,
                      "valueStr": null
                    },
                    {
                      "key": "damage_resistance",
                      "value": 0.23,
                      "valueStr": null
                    }
                  ],
                  "tokenKey": null,
                  "isHideTalent": false
                }
              ],
              "trait": []
            }
          ]
        },
        {
          "equipLevel": 3,
          "attributeBlackboard": [
            {
              "key": "atk",
              "value": 50,
              "valueStr": null
            },
            {
              "key": "def",
              "value": 25,
              "valueStr": null
            }
          ],
          "tokenAttributeBlackboard": {},
          "parts": [
            {
              "target": "TRAIT_DATA_ONLY",
              "isToken": false,
              "talents": [],
              "trait": [
                {
                  "additionalDescription": null,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "blackboard": [
                    {
                      "key": "heal_scale",
                      "value": 1,
                      "valueStr": null
                    }
                  ],
                  "overrideDescripton": "Deals <@ba.kw>Arts damage</>; When skill is active, attacks instead restore the HP of allies (heal amount is equal to <@ba.kw>{heal_scale:0%}</> of ATK)",
                  "prefabKey": null,
                  "rangeId": null
                }
              ]
            },
            {
              "target": "TALENT_DATA_ONLY",
              "isToken": false,
              "talents": [
                {
                  "displayRangeId": false,
                  "upgradeDescription": "Grants a 26% <$ba.protect>Sanctuary</> effect to all friendly units within range with less than 60% HP",
                  "talentIndex": 0,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "prefabKey": "1",
                  "name": "Ethereal Iridescent Clouds",
                  "description": null,
                  "rangeId": null,
                  "blackboard": [
                    {
                      "key": "hp_ratio",
                      "value": 0.6,
                      "valueStr": null
                    },
                    {
                      "key": "damage_resistance",
                      "value": 0.26,
                      "valueStr": null
                    }
                  ],
                  "tokenKey": null,
                  "isHideTalent": false
                }
              ],
              "trait": []
            }
          ]
        }
      ]
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "The files that needed sorting have all been put away. I hope it'll help reduce some of your pressure, Doctor.",
      "voiceAsset": "char_4019_ncdeer/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "The atmosphere in here is duly soothing, much like my mountain forest. Doctor, you're free to come play when you're not busy.",
      "voiceAsset": "char_4019_ncdeer/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "I've talked a lot with the Medical Department's operators, and now I can understand what everyone's goal is. Doctor, allow me to rescue this land together with you.",
      "voiceAsset": "char_4019_ncdeer/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "This herbal pill... it's fine work. Myrrh's combined the properties of the medicinals and processed them in a special way. Hmm... I've never attempted such a manner of processing myself. In a little while, I'll see about learning from Myrrh.",
      "voiceAsset": "char_4019_ncdeer/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "Aid and sanctuary are unalike. The former cures the body, the latter saves the soul.",
      "voiceAsset": "char_4019_ncdeer/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "To live is an endless cycle, reaping what one sows, all beings beholden to this. I imagine you can understand, having been through so much. Leaving your own memories behind in a different incarnation, constructing your own view of the outside world; that is the purpose of this life.",
      "voiceAsset": "char_4019_ncdeer/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "These pills have not just the aroma of tea, but all sorts of flowers too. Many patients consider herbal pills bitter, so I've put my mind to diminishing that bitterness. I hope... the people of Rhodes Island won't dislike this flavor.",
      "voiceAsset": "char_4019_ncdeer/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "I very much agree with the tea here, its aroma calm, its true flavor apparent. As with tea, so with man. In this dwelling, those irrelevant rumors can be kept away; it's a rare place of respite.",
      "voiceAsset": "char_4019_ncdeer/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "Doctor, the operators can have the dishes labelled with my name to eat, as well as some bottles of drinks I made myself. Everyone's been to truly tiresome lengths as of recent, and I wanted to do a thing or two to help alleviate their fatigue...",
      "voiceAsset": "char_4019_ncdeer/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Are you tired? Rest well for a while. Don't worry; I'll protect you.",
      "voiceAsset": "char_4019_ncdeer/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "It's nice to meet you; I'm Nine-Colored Deer. Hm? Are these motifs so beautiful? Th-Thank you... please, observe them as you like.",
      "voiceAsset": "char_4019_ncdeer/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "May I go with you next time? I want to ensure everyone's safety.",
      "voiceAsset": "char_4019_ncdeer/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "You've endorsed me? So I have been of help to you, then. Wonderful...",
      "voiceAsset": "char_4019_ncdeer/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "The things I've learned may save many, but there remain yet more in need of aid. Doctor, can I still be more powerful than I am now?",
      "voiceAsset": "char_4019_ncdeer/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Worry not, I won't betray your trust.",
      "voiceAsset": "char_4019_ncdeer/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Am I taking command? No problem.",
      "voiceAsset": "char_4019_ncdeer/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Don't worry, I'll bring everyone home safely.",
      "voiceAsset": "char_4019_ncdeer/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Don't separate. We meet the battlefield now.",
      "voiceAsset": "char_4019_ncdeer/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "I see them... an unknown enemy.",
      "voiceAsset": "char_4019_ncdeer/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Are these new orders? Mm, acknowledged.",
      "voiceAsset": "char_4019_ncdeer/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "This... is the chill of the battlefield.",
      "voiceAsset": "char_4019_ncdeer/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "I'm ready.",
      "voiceAsset": "char_4019_ncdeer/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "The mind is as truth, a mirror reflecting all ways.",
      "voiceAsset": "char_4019_ncdeer/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "A thought leaving reality, delusion in all cases.",
      "voiceAsset": "char_4019_ncdeer/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Heaven and earth come alike, all beings come together.",
      "voiceAsset": "char_4019_ncdeer/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Everything has its way, per flame and per current.",
      "voiceAsset": "char_4019_ncdeer/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Mm... this battle was very smooth.",
      "voiceAsset": "char_4019_ncdeer/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Life is sincerely precious, but base and wicked life is punished in the end.",
      "voiceAsset": "char_4019_ncdeer/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "You needn't be sad. Though there were slight faults, with a little more of a try, you will always succeed.",
      "voiceAsset": "char_4019_ncdeer/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "If it has no power, no one should be shown that mercy.",
      "voiceAsset": "char_4019_ncdeer/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "What a strange place. So much I've never seen before.",
      "voiceAsset": "char_4019_ncdeer/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "'Kindness' is something not to be exploited, Doctor.",
      "voiceAsset": "char_4019_ncdeer/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Doctor, here's a scented tea for you. It'll perk you up.",
      "voiceAsset": "char_4019_ncdeer/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_4019_ncdeer/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "I hear this is a day of reunions. May you and all at Rhodes Island be in good health.",
      "voiceAsset": "char_4019_ncdeer/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "You seem very energetic, Doctor.",
      "voiceAsset": "char_4019_ncdeer/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "workshop_formula_bonus1[000]",
      "buffName": "Causality",
      "desc": "When this Operator is assigned to the Workshop, a byproduct is guaranteed when <@cc.kw>40</> points of <$cc.w.ncdeer1><@cc.rem>Causality</></> are accumulated",
      "skillIcon": "bskill_ws_bonus1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "workshop_formula_bonus2[000]",
      "buffName": "Karma",
      "desc": "When this Operator is assigned to the Workshop, a byproduct is guaranteed when <@cc.kw>80</> points of <$cc.w.ncdeer2><@cc.rem>Karma</></> are accumulated",
      "skillIcon": "bskill_ws_bonus2",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "tokens": [],
  "patch_info": {}
}