{
  "id": "char_484_robrta",
  "meta_info": {
    "name": "Roberta",
    "appellation": " ",
    "voiceActor": {
      "en": "Becky Wright",
      "jp": "Ayako Kamegai",
      "kr": "Kim Bo-min",
      "cn": "Anita Luo"
    },
    "rarity": 4,
    "profession": "Supporter",
    "subProfessionId": "Artificer",
    "position": "MELEE",
    "team": "",
    "tagList": [
      "Defense",
      "Support"
    ],
    "nationId": "Columbia",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Roberta\n[Gender] Female\n[Combat Experience] None\n[Place of Birth] Columbia\n[Date of Birth] May 10\n[Race] Anaty\n[Height] 155cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Normal\n[Mobility] Normal\n[Physical Resilience] Standard\n[Tactical Acumen] Standard\n[Combat Skill] Standard\n[Originium Arts Assimilation] Normal",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Roberta, a well-known makeup artist from Columbia. At her own insistence, has been evaluated by the Engineering Department, displaying accomplishment in the field of automated machinery. With Closure's approval, has become an operator aboard Rhodes Island.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Roberta shows no signs of Originium infection.\n\n[Blood Originium-Crystal Density] 0.12u/L\nOperator Roberta rarely comes into contact with Originium.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "When I first saw her resume, I thought she was kidding. I watched the last Academy Awards ceremony from start to finish! The lead beautician on the movie that won Best Makeup and Hairstyling? Was this her? Same name? Same face?! If I remember right, you're gonna need way more than one hand to count all her nominations in the past five years, big or small!\nIs our pay seriously enough to draw in professionals as SUCCESSFUL as her already? Wait, that's not right... why do we even need a makeup artist?\nI read her evaluation records, and only then did I believe it: she was serious. Her engineering knowledge is definitely enough to handle our department's basic work, but what draws me most has to be her sketches for these automatic multifunctional support machines. She calls them full auto modelers, but I sure got new inspiration for modifications to give Lancet-2 once I read through them... oh, yeah, and also, what do you all think of installing one of these modelers outside the dorms on every floor? Add on a payment module, get operators swiping their paycards to enjoy some quick and convenient makeup service!\n——Memo of Closure's remarks in an Engineering Department internal meeting, prior to Operator Roberta officially taking up her post",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Wrankwood, huh? It's a heck of a boring place.\nSee, you roll up in Wrankwood, Columbia, and the movie stars are merchandise, and behind them's a full assembly line. Someone even went in for surgery a full 36 times in one year just to keep the goods looking perfect! That's a horror story, isn't it? I eat less hotpot than that in a year!\nAlso, when you're around in Wrankwood, there's people all the time telling you how you should do and say things, and who you have to interact with. It's like being in a movie no matter where you go, and the script's all prepared. Agencies analyze what kind of persona's most popular with the current mainstream, and all you gotta do is act it. What does it matter if it's different every day? It's not like anyone cares what your true face is, they're all there for the constructed, perfected facade. And so what if they actually question it? Public relations has people who'll help you right the ship.\nSee, that's why I wasn't interested in heading to Wrankwood to broaden out. The way I see it, shooting a move's about hard work and art, not playing a mannequin people can gawk at all day, you know? \n——Operator FEater's point of view on the topic of Wrankwood\n\nWrankwood? Pretty decent place, easy to turn a buck.\nBut I hate its guts too. They always think if you just give the shiniest places more spit-shine, people'll just go ahead and ignore the dirt piling up in the corners. What gave them that idea? All styling can do is make a face look pretty—there's no way it can actually smooth out all the real bumps in your skin.\nTo me, fame is a hassle. It means even more boring work's on its way.\nBut I'm thankful for my fame, too—it lets me start picking my clients, and it got me here now, living the easy life.\nYou think I've got a lot of sense? Lemme tell you how many 'auteurs' are built on sensible foundations. Nothing but temper, blind to the real world, while every year hundreds in low-rent apartments right next to Wrankwood starve to death. Nobody in Columbia's really free until they've got enough money.\n——Operator Roberta's personal view on the topic of Wrankwood\n\nOn several occasions, we've seen Roberta exploring with operators how to 'decorate' their bodily crystals, in a natural way. Amazed at her approach, we inquired about her views on Oripathy.\n'Respect comes from within.' ——So she replied.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "When she was freshly aboard Rhodes Island, Roberta mentioned that she'd met the Doctor before. It was in Tkaronto in Columbia; she was invited to a dinner party, and sick of the social niceties on loop, she quietly slipped off and found a staircase. There, she met the Doctor, who had left a dinner partway through, same as her, wanting to catch a breath.\nNeither moved to greet the other at first; they simply sat on different steps and stared off. After ten minutes, the door to the staircase was opened, and they both chanced to duck to the side, giving a 'shh' to each other, and upon seeing the other do exactly the same thing, they chuckled derisively.\nAfter they each returned to their respective parties, Roberta still remembered the figure who'd hidden along with her by the staircase, subsequently wandering around questioning everyone who was in the building that day, eventually managing to contact Rhodes Island.\nShe tells us her work at that time had hit a bottleneck. She thought, originally, that her own creativity had been whittled down by endless assembly line duty. She always longed to meet someone with a face written full with stories, to give her ever more motivation to wield the makeup brush.\nNow, she believes she's found it.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Roberta's real name is Roberta Baker. When we asked for the codename she'd like to call herself, she chose her own name without hesitation. She even strictly guided us on how to pronounce it, with a proper Siracusan air. Though she moved to Columbia when she was very young, in her heart, Roberta remains a Siracusan.\nAfter a follow-up chat, we discovered that Roberta's childhood was by no means a wonderful one. Her family was based in a small Columbian town, working for a bigger family who, like them, came from Siracusa. This was not often decent work. She became used to seeing poverty, sickness and crime, and was aware from an early age that money could change a person's life.\nAfter entering the styling business, Roberta's situation didn't improve much. In Wrankwood, no one showed respect for this penniless Siracusan-blooded girl. Any random star with their fifteen minutes would be bossing her around, putting her through days in a row without even a break to sleep. She relied on her own skills, earned through blood, sweat and tears, and stubbornly climbed from the very bottom of the industry, up to its top. Money came rolling in along with the fame, but it never turned Roberta the slightest bit snobbish. Through years of Wrankwood experience, she never once forgot her old friends. But when she returned to her hometown, she found that of the friends she'd grown up with, several had lost their footing after contracting Oripathy.\nRoberta has never said it out loud, but her favorable opinion of Rhodes Island, we believe, is deeply rooted in the vision of 'true' Columbia reflected in her eyes.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "She said she's hiding away here on vacation? No, that's not right, she's super intense about pursuing her makeup skills... have you seen those 3D models in her workshop, for styling practice? I sure recognized a few familiar faces! Plenty of them are even from records of enemies we've faced... coming in and suddenly seeing them is a serious heart attack!\nIn the end I think she's pretty suited to Rhodes Island. We do have all sorts here, after all, and so many have a fire in them. No matter what makes it burn, they keep us going. They're the force that pushes Rhodes Island to keep sailing on!",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1976,
      "atk": 444,
      "def": 349,
      "magicResistance": 0,
      "blockCnt": 2,
      "baseAttackTime": 1.5,
      "respawnTime": 70,
      "cost": 17
    }
  },
  "skins": [
    {
      "skinId": "char_484_robrta#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_484_robrta",
      "portraitId": "char_484_robrta_1",
      "illustId": "illust_char_484_robrta_1",
      "modelName": "Roberta",
      "drawerList": [
        "IRIS_呓"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_484_robrta#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_484_robrta_2",
      "portraitId": "char_484_robrta_2",
      "illustId": "illust_char_484_robrta_2",
      "modelName": "Roberta",
      "drawerList": [
        "IRIS_呓"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_484_robrta@summer#10",
      "skinName": "Summer Flowers FA374",
      "skinGroupName": "Coral Coast/X",
      "skinGroupId": "2022#summer#3",
      "avatarId": "char_484_robrta_summer#10",
      "portraitId": "char_484_robrta_summer#10",
      "illustId": "illust_char_484_robrta_summer#10",
      "modelName": "Roberta",
      "drawerList": [
        "IRIS_呓"
      ],
      "description": "<color name=#ffffff>MARTHE [Coral Coast] Summer Flowers Series FA374. Brings out a girl’s figure and physique using all-natural materials. Pursue this summer’s hottest trend.</color>",
      "rarity": 88
    },
    {
      "skinId": "char_484_robrta@ambienceSynesthesia#3",
      "skinName": "Granter of Colors",
      "skinGroupName": "Ambience Synesthesia/III",
      "skinGroupId": "2023#ambienceSynesthesia",
      "avatarId": "char_484_robrta_ambienceSynesthesia#3",
      "portraitId": "char_484_robrta_ambienceSynesthesia#3",
      "illustId": "illust_char_484_robrta_ambienceSynesthesia#3",
      "modelName": "Roberta",
      "drawerList": [
        "IRIS_呓"
      ],
      "description": "<color name=#ffffff>Ambience Synesthesia Tailor-Provided/Granter of Colors. Roberta's work outfit. With the other operators' help and encouragement, Roberta finally found the time to design a look for herself as well.</color>",
      "rarity": 158
    }
  ],
  "phases": [
    {
      "maxLevel": 45,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1123,
            "atk": 226,
            "def": 188,
            "magicResistance": 0,
            "cost": 13,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.5,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 45,
          "data": {
            "maxHp": 1539,
            "atk": 333,
            "def": 270,
            "magicResistance": 0,
            "cost": 13,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.5,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 60,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1539,
            "atk": 333,
            "def": 270,
            "magicResistance": 0,
            "cost": 15,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.5,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 60,
          "data": {
            "maxHp": 1976,
            "atk": 444,
            "def": 349,
            "magicResistance": 0,
            "cost": 15,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.5,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3271",
          "count": 3,
          "type": "MATERIAL",
          "name": "Supporter Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_SUP1"
        },
        {
          "id": "30012",
          "count": 1,
          "type": "MATERIAL",
          "name": "Orirock Cube",
          "rarity": 2,
          "iconId": "MTL_SL_G2"
        },
        {
          "id": "30042",
          "count": 1,
          "type": "MATERIAL",
          "name": "Oriron",
          "rarity": 2,
          "iconId": "MTL_SL_IRON2"
        }
      ]
    },
    {
      "maxLevel": 70,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1976,
            "atk": 444,
            "def": 349,
            "magicResistance": 0,
            "cost": 17,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.5,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 2470,
            "atk": 535,
            "def": 415,
            "magicResistance": 0,
            "cost": 17,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.5,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3272",
          "count": 5,
          "type": "MATERIAL",
          "name": "Supporter Chip Pack",
          "rarity": 4,
          "iconId": "MTL_ASC_SUP2"
        },
        {
          "id": "31043",
          "count": 14,
          "type": "MATERIAL",
          "name": "Semi-Synthetic Solvent",
          "rarity": 3,
          "iconId": "MTL_SL_SS"
        },
        {
          "id": "30063",
          "count": 7,
          "type": "MATERIAL",
          "name": "Integrated Device",
          "rarity": 3,
          "iconId": "MTL_SL_BOSS3"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_robrta_1",
      "skillName": "Siracusan-Style Makeup",
      "desc": "ATK<@ba.vup>+{atk:0%}</>, DEF<@ba.vup>+{def:0%}</>",
      "iconId": "skchr_robrta_1",
      "spCost": 25,
      "initSp": 15,
      "duration": 35,
      "blackboard": [
        {
          "key": "atk",
          "value": 0.5
        },
        {
          "key": "def",
          "value": 0.5
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 2,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 1,
              "type": "MATERIAL"
            },
            {
              "id": "30073",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 2,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 2,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 2,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 2,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_robrta_2",
      "skillName": "Full Auto Modeler",
      "desc": "Stops attacking; Block <@ba.vup>+{block_cnt}</>, DEF <@ba.vup>+{def:0%}</>; When the skill ends, obtain 1 Modeler",
      "iconId": "skchr_robrta_2",
      "spCost": 30,
      "initSp": 10,
      "duration": 25,
      "blackboard": [
        {
          "key": "block_cnt",
          "value": 1
        },
        {
          "key": "def",
          "value": 0.8
        },
        {
          "key": "robrta_s_2[recharge].cnt",
          "value": 1
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 2,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 1,
              "type": "MATERIAL"
            },
            {
              "id": "30083",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 2,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 2,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 2,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 2,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_robrta",
      "moduleName": "Roberta's Badge",
      "desc": "Operator Roberta has demonstrated a remarkable aptitude for utilizing installations so as to aid teammates in combat.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Supporter Operator during field operations to exercise Artificer responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_robrta",
      "moduleName": "Semi-Auto Stylist Toolkit",
      "desc": "Your makeup skills are awful, they're bottom of the barrel!\nThree whole times I've trusted you, and three whole times you've gone and defiled my handsome face!\nGod! I should never have called the number on that poster, should never have believed you. 'Wrankwood's Future Number One Makeup Artist' my ass, you're renting out a basement for a studio. Does Wrankwood even mean anything to you?\nI know, you don't have to tell me, I'm past my prime as an actor. But I just need to turn things around. I'm done being cast as the mayor's bodyguard just to get shot in the head. Done with being the cop they kill off in a shootout. Why else would I even come to you?!\nAt least I've still got my bottom line as a performer.\nWhat bottom line? A perfect face, that's what my bottom line is! Everyone wants to see a perfect face! In Wrankwood, they'll keep both our wallets stuffed as long as you can faithfully show off my good looks! Simple, right?\nBut what did you do?\nThe first time, I asked you to make me a heroic and honest young laborer, and you turned me into a miner who'd just crawled out of a pit.\nSecond time, I wanted be a Pioneer leader, but you dumped half a bag of sand over my head and covered me in sticky-ass paint. Security at the shoot thought I was a tramp and almost escorted me out!\nAnd then you started lecturing me on how creators have their own artistic pursuits, and the need to have fidelity to reality, and how fine work always shines.\nSure! I'll give you that, I was a dumbass who went and believed your crazy talk again, which is why I let you stick that freakish machine on my face again!\nI emphasized that this was a horror movie, and you promised you'd give me the scariest look of all. And what did you give me? Plasma smears? Leaking ulcers? Fangs? Not a single element to catch the eye, but a hell of a lot of causes for concern!\nAnd worst of all, I spend just a single moment by a heater, and the cameraman yells my face is melting once they start rolling! I give it a wipe and there's fake teeth and glass eyeballs falling off, all of it! FALLING OFF!\nIf the producer didn't see how much my role cost, he would've kicked me straight off the goddamn set!\nSo, you understand? I'm not coming to you anymore. You can rent your goddamn basement for the rest of your goddamn life!\nHello? Yes, speaking. Sir?!\n'The Man With No Face'? Oh, the director changed the name, no doubt. Yes, I starred.\nWhat? The premiere was a hit? Full house?\nDoes this mean I'm... back on track? Hold on? No, sir... I want to know right now—My makeup artist? She's right next to me. Huh?\nRight, the film exec's asking for you.\nWait, wait, Roberta, how did you manage to make it in Wrankwood this fast? Whatever your secret is, you've got to tell me...\n—I never once changed.\n......\nSo this is Wrankwood, huh, sir."
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "Hello, Doctor. Have you figured out the style you wanna go with today? Huh...? You didn't call me here for that? I really, really hope you can give it at least a little more thought. Please?",
      "voiceAsset": "char_484_robrta/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Watch out! I've got tons of stuff in my pocket here. If this negative ion hair softener bumps into the horn growth stimulant and spills... Well... I could end up getting hanged on the deck! It's no joke!",
      "voiceAsset": "char_484_robrta/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "You've probably heard how assassins who know their stuff in anatomy work more efficiently, no? Of course, my goal's not to take anyone's hope to survive away. Instead, I want to turn that hope into something more vivid and brilliant! Styling is an art, but it's also a science!",
      "voiceAsset": "char_484_robrta/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "She looks familiar... Is that the girl who shows up in all those kung fu movies? Whoa, don't ever tell her I'm here! Nah, it's not her that I'm afraid of, but I really don't wanna run into her stylist, Lauder! The last thing I need is anybody calling me 'Bobbi'...",
      "voiceAsset": "char_484_robrta/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "I'm a researcher, not a modeler, and I definitely don't want to be the kind of girl who works her mindless brush on monotonous faces under spot light day in and day out! Coming on the ship's been kind of like a vacation to me, I guess? If I had to stare at those lifeless faces all day, my brain would get completely fried sooner or later. I'm not doing that no matter how much I get paid.",
      "voiceAsset": "char_484_robrta/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "If I got no money, I can't buy any new tools or materials. That's why even I got to work sometimes. Hm... I think the girl who came to me last time just got an academy award? She'd be fine to spot me, right?",
      "voiceAsset": "char_484_robrta/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Doctor, I asked Dr. Warfarin for some info about your body... and modified my brush texture based around that. I promise you it won't trigger any allergies this time!",
      "voiceAsset": "char_484_robrta/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "If you want to touch my hair, go right ahead. It's pretty messy already anyway. Is that weird? When you do styling work for as many people as I do, you definitely won't find yourself in the mood to work on yourself even if you have the time.",
      "voiceAsset": "char_484_robrta/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "Interesting faces are like stories in their own right. Dr. {@nickname}, you are like... a kinda damaged videotape, waiting for someone to dust you off. If the day ever comes that you get repaired, what kind of story will you reveal?",
      "voiceAsset": "char_484_robrta/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Did you really fall asleep? In that case, I guess I can get to work? Your bone structure, your skin... Whoa, this is even more spectacular than I thought!",
      "voiceAsset": "char_484_robrta/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Hello, I'm Roberta! We meet again! Once I sign here, I'll be your personal stylist, right? Huh... 'You'll be an operator?' Doesn't matter as long as I get to stay!",
      "voiceAsset": "char_484_robrta/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "Beat up all the annoying guys, right? No more difficult than swinging ten brushes around while taking a sip of coffee. I'm from Siracusa, after all.",
      "voiceAsset": "char_484_robrta/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "I've got an entire room full of medals like this one back in my studio in Wrankwood... Hey, Doctor, can't you give me something a little more interesting for my reward?",
      "voiceAsset": "char_484_robrta/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "Since you're giving me another promotion, I want a bigger studio. You'll approve it, right?",
      "voiceAsset": "char_484_robrta/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Should I go with eyeshadow palette #3001... or perhaps #3002?",
      "voiceAsset": "char_484_robrta/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Doesn't look like we have a color base that works for all of us...",
      "voiceAsset": "char_484_robrta/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Let's go, everyone! I'll do the re-touch in case your makeup slides off.",
      "voiceAsset": "char_484_robrta/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "I know exactly which part of the face is the most fragile!",
      "voiceAsset": "char_484_robrta/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "You gotta put on the most suitable style even when you're giving out commands in the frontlines.",
      "voiceAsset": "char_484_robrta/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "These real battlefields give me so much more inspiration than any film set I've been to.",
      "voiceAsset": "char_484_robrta/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Bring your face closer this way, okay? Thanks. I'll pay attention to how much force I use.",
      "voiceAsset": "char_484_robrta/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Even the biggest stars out there gotta book me in advance, you know? You should count yourselves lucky!",
      "voiceAsset": "char_484_robrta/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Surface electrode tracking auto-filling concealer!",
      "voiceAsset": "char_484_robrta/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Infused Originium Slug acid styling spray!",
      "voiceAsset": "char_484_robrta/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Facial bone full structured self-image shading highlighter!",
      "voiceAsset": "char_484_robrta/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Wet/Dry ambient color adapted lipstick and blusher!",
      "voiceAsset": "char_484_robrta/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Whoa... Not even I can replicate that look on your face right now.",
      "voiceAsset": "char_484_robrta/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "What a perfect operation. Makes me want to add a few more touches to bring out that joy on your face.",
      "voiceAsset": "char_484_robrta/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "There's nothing as boring as watching the cowards run. They always stiffen up like Rock Spiders that've spent a bit too much time in antiseptics.",
      "voiceAsset": "char_484_robrta/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Doctor, need me to give your face a little blush? If you go back like this, the others might worry when they look at you.",
      "voiceAsset": "char_484_robrta/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Can I do my experiments here? Relax, I won't blow the walls out. At most... I guess the doors and windows might bend a little?",
      "voiceAsset": "char_484_robrta/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Didn't I say I'm not seeing anyone...? Oh, it's you.",
      "voiceAsset": "char_484_robrta/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Doctor, can I come over to your room this evening? Your face could really use a massage.",
      "voiceAsset": "char_484_robrta/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_484_robrta/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "New Year, new scenery! Doctor, this stack of paper... Oh, no, actually, all these papers are brand new looks I've been thinking up just for you... Hey! Why are you running away, Doctor?!",
      "voiceAsset": "char_484_robrta/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Hey, Doctor, want to try this new look I designed just for you?",
      "voiceAsset": "char_484_robrta/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Tons of celebrities in Wrankwood would ask me to do their makeup for their birthday parties. Cover every trace of time on their faces, no matter the cost. But is that really beauty? Doctor, this mirror's my gift to you. I hope you'll find a true and beautiful you staring back.",
      "voiceAsset": "char_484_robrta/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "I've noticed a lot of operators and patients covering up their Originium crystals. That's not gonna cut it! I've got a plan: I'm going to design a whole set of patterns for decorating your crystals. That's the most meaningful thing I can do for Rhodes Island as a makeup artist!",
      "voiceAsset": "char_484_robrta/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "workshop_formula_probability[200]",
      "buffName": "Engineering",
      "desc": "When this Operator is assigned to the Workshop to process <@cc.kw>Building material</>, the production rate of byproduct increases by <@cc.vup>70%</>",
      "skillIcon": "bskill_ws_build1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "manu_prod_spd[010]",
      "buffName": "Standardization β",
      "desc": "When this Operator is assigned to a Factory, productivity <@cc.vup>+25%</>",
      "skillIcon": "bskill_man_spd2",
      "phase": "PHASE_1",
      "level": 1
    }
  ],
  "patch_info": {}
}