{
  "id": "char_4043_erato",
  "meta_info": {
    "name": "Erato",
    "appellation": " ",
    "voiceActor": {
      "en": "",
      "jp": "Kotomi Aihara",
      "kr": "Kim Yun-chae",
      "cn": "Kousou Mao"
    },
    "rarity": 5,
    "profession": "Sniper",
    "subProfessionId": "Besieger",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "DPS",
      "Crowd-Control"
    ],
    "nationId": "Minos",
    "isNotObtainable": false,
    "itemObtainApproach": "Event Reward",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Erato\n[Gender] Female\n[Combat Experience] 3 Years\n[Place of Birth] Minos\n[Date of Birth] Mar 14\n[Race] Liberi\n[Height] 158cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Standard\n[Mobility] Excellent\n[Physical Resilience] Standard\n[Tactical Acumen] Normal\n[Combat Skill] Standard\n[Originium Arts Assimilation] Excellent",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Erato, a wandering bard from Minos and a member of the guerrilla opposing the Sargonian colonizers.\nDespite Erato's repeated claims of being 'three-time Hymnic Games archery champion' and 'Minos's foremost harp player,' none of these claims can be substantiated and will therefore be left out of this file for the time being.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Erato shows no trace of Originium infection.\n\n[Blood Originium-Crystal Density] 0.16u/L\nThis is considered a somewhat dangerous level for a non-Infected. Regular testing is required.\n'It's hard to believe that Erato has visited so many places alone without any protective measures. I really have no idea if she just knows how to avoid danger by instinct or luck's really on her side, but she can't keep doing this anymore.'\n—Medical Operator",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'Who am I? Before I answer your question, let me tell you a story. When the majestic Mt. Hymnoi was still nothing but a swath of flat land, there was a—Not up for a story? Could you answer my question first, then? Is Pallas here or not?'\nWhen Erato arrived at Rhodes Island after her long, weary travels, her first question was, 'Is Pallas here or not?' Common sense tells us that those who harbor ill will against Pallas wouldn't come knocking on our door directly, but considering the sensitive issue regarding Pallas's status, we immediately verified Erato's identity.\nErato was born in a village in southern Minos. She is skilled in archery and harpistry, and she participated in Minos's war against Sargon's invasion, going on to achieve many great feats on the battlefield. All of the above information was verified to be true after a thorough investigation by the HR Department.\nJust like Pallas, Erato participated in the war against Sargon, but the two of them fought on different battlefields. After the invaders were chased out of her homeland, Erato, who has grown weary of living a peaceful life, heard rumors of the 'Goddess of Victory' and wanted to meet this heroine in person. After she asked around, she learned that Pallas is undergoing Oripathy treatment at a certain medical company in secret, and after an arduous journey, she finally found Rhodes Island.\nHaving confirmed with Pallas and found that she, too, has a strong urge to meet this warrior from her homeland, HR arranged for the two to meet. As the two came from the same area and share similar interests and senses of aesthetics, they naturally hit it up with one another very quickly, but they also went their separate ways just as quickly after a long night of conversation.\n'If Pallas wishes to go into hiding here, then let her, but even if all of Minos and the Twelve Heroes accept that image of a perfect 'Goddess of Victory' she tries to maintain, I will never accept it myself!' Pallas, on the other hand, simply lamented regretfully: 'If only Erato had a little more tolerance for alcohol.'\nIn the end, Erato found herself fascinated by the epic adventures and tales of Rhodes Island as recounted by Pallas and decided to stay, eventually becoming a Field Operator after passing the onboarding exams.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Although Erato's frequent claims to be a 'three-time consecutive Hymnic Games archery champion' and a 'top guest harp player of Minos's most renowned troupe' remain unsubstantiated, there is no doubt that she is remarkably proficient in both of these talents.\nEver since the Minoans overthrew the Sargonian colonists, there has never been peace between the two countries. This is particularly visible in the villages near Minos's borders, which still see Sargonian aggression from time to time. The Minoan people banded together and formed a guerilla force to fend against the Sargonian army. Erato was a member of this guerilla force, and her performance as an Operator during missions shows us that her archery skills were truly battle-tested on the frontlines.\nErato's techniques as a harp player are no less impressive than her archery. Setting aside the issue of her past performance history, her regular harp and minstrelry performances at the Convalescent Garden quickly became a popular entertainment mainstay at Rhodes Island. Erato is also able to disturb her enemies' neural systems with her unique Originium Arts by playing her harp. Some Leithanian Operators believe that this type of Originium Arts is fundamentally the same as the musical Originium Arts frequently seen in Leithanien. Although Erato keeps her Originium Arts education background a closely guarded secret, one thing that is certain is that her mastery of this form of Originium Arts still has much room for improvement. This is especially visible in her ability to put her enemies to sleep with her harp as it just as frequently puts her audience to sleep too. It seems Erato herself doesn't seem to mind that at all, however.\n'They are about to have a nice dream. Let the story continue there.'\n\n[Addendum]\nThe Hymnic Games, alternately known as the Warriors' Gathering, is a time-honored sporting event held in the Hall of the Twelve Heroes in Athenius. The Games promote the strengthening of the body and maintaining a proactive mindset. Indeed, the Games are very popular among the populace and attracted talented entrants from all over Minos to participate in its competitions in Athenius, and the Games have also had many new competitions added over the years.\nAside from Athenius, many other cities have also held competitions of a similar format that are also named the 'Hymnic Games.' The Games that Erato participated in were actually jointly held by a few smaller towns in the southern part of Minos. Given their scale, the competitions are definitely nothing to be scoffed at, but they simply do not compare to the Hymnic Games of Athenius. That being said, Erato's gold medals are indeed all officially certified.\nGiven her skills, perhaps we can look forward to her scoring big at the next Athenius Games.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Erato was already a seasoned traveler who has visited many destinations prior to her arrival to Rhodes Island. This naturally isn't because she was simply lost. Rather, searching for Pallas was never the sole objective of her journey. From Minos, she traveled to Bolívar, Columbia, Kazimierz, Leithanien, and at last found Rhodes Island at Victoria. Although Erato saw this as a fun little trip, all of us know that such a long journey required extraordinary willpower and determination.\nDuring her journeys, Erato kept a notebook in which she detailed her travel experiences. She did so in all manners, from long epics about her travels to mere scribbles describing the nameless sights she saw. Sometimes, she even wrote a few poems spontaneously. She didn't take much care to organize these records, but the culture and customs of each region she visited were more than adequately captured in her chronicles.\nAside from the sights she saw on the way, the notebook also included many mythologies and heroic legends that Erato collected during her journeys. Although she is unaware of it herself, these mythologies from these many different regions reflect the locals' values and historical views to a certain extent. 'Survival is the force behind all human intelligence. With time, they become experience, and through legends and mythologies, they become the truth.' With the large array and variety of stories Erato collected throughout her journeys, one could say her notebook itself is worthy of folkloristic study.\nErato is certainly enthusiastic when it comes to collecting the legends and stories of different regions, but she is a bona fide expert when it comes to Minoan folklore. Throughout the centuries of Sargonian invasion, Minos lost much of its cultural literature, and all the stories passed down through the word of mouth became the only records of many historical events. Despite how their conversation ended on an unpleasant note, Pallas frequently talks to Erato to record the Minoan legends she has heard of.\n'Why are you sorting out these stories now? Are you going to take them back to the Hall of the Twelve Heroes with you?'\n'If you don't mind, I would actually rather you bring them there yourself...'\n'I knew it! You boring, perfectionist priestess! Very well. I'll write down all your drunken mishaps at Rhodes Island and bring them there!'\n\n[Classified Log]\nAfter Erato, a lover of botany and flora, discovered the Rhodes Island Convalescent Garden, she quickly became one of its most frequent visitors. However, it seems there is more than just flowers on Erato's mind. We have received reports that, on several occasions, Erato stared at Perfumer as she worked, awestruck. She seemed like she wanted to strike up a conversation, yet she always held herself back. As requested by Pallas, this record will be kept hidden for the time being.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Erato has never thought of herself as a wandering bard.\n'A wandering bard? They only write down and tell the stories of others, don't they? I think of myself more as a character of a story. I hope that many, many years later, there will be people telling my story, and it'll be a story that will fill its listeners with love and hope when they reach its end.'\nMany Minoans seek the glory of heroes, and Erato is no exception. However, Erato also has her own understanding about heroes and glory beyond that.\nHeroes should stand with the people and be spiritual leaders to them. They need to be able to inspire later generations to pick up arms against their oppressors like the legends of the Twelve Heroes. They must also be able to guide the masses with their songs of beauty and poems and benevolence, and embrace the lands with a gentle heart. In Erato's songs, the main characters are in general not particularly strong, and sometimes they even have very obvious flaws, but all of them are optimistic and kind-hearted without fail. The main characters go through many trials and tribulations, and in the end always reach a satisfactory ending. Perhaps this is the concept that Erato has of heroes: through some gentle way, they inspire the masses to live with passion. The pursuit of love and beauty can become a belief for people to live by. Perhaps that is the source of Erato's interest in everything and her seemingly endless enthusiasm.\nThose who don't have a firm understanding of ugliness do not deserve to discuss beauty, and those who have never experienced hardship should never speak of hope. Having visited so many places and seen so many sights, the beauty that Erato sings of in her songs and poems indeed has that kind of inspirational power.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'Have you ever imagined that perhaps there's a place where there aren't different races, conflicts between countries, and differences between those who are infected and those who are not. There are only poetry, music, flowers, and sunshine. This isn't mere legend. It might just exist somewhere in the world.'\n'Of course, this place isn't so easy to find. It takes a lot, and I mean a lot of setbacks and difficulties, and only heroes who truly have courage and love can find this place.'\n'That's why the first thing we have to do is to believe that this place exists. Yep, we need to truly believe its existence. Only then will you have the motivation to find it. And when you start seeking it out, you will definitely find something in the end. Doctor, will you look for this place with me?'",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1318,
      "atk": 784,
      "def": 102,
      "magicResistance": 0,
      "blockCnt": 1,
      "baseAttackTime": 2.4,
      "respawnTime": 70,
      "cost": 23
    }
  },
  "skins": [
    {
      "skinId": "char_4043_erato#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_4043_erato",
      "portraitId": "char_4043_erato_1",
      "illustId": "illust_char_4043_erato_1",
      "modelName": "Erato",
      "drawerList": [
        "温泉瓜"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_4043_erato#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_4043_erato_2",
      "portraitId": "char_4043_erato_2",
      "illustId": "illust_char_4043_erato_2",
      "modelName": "Erato",
      "drawerList": [
        "温泉瓜"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_4043_erato@snow#5",
      "skinName": "Untold Stories",
      "skinGroupName": "Icefield Messenger/IV",
      "skinGroupId": "2022#xmas",
      "avatarId": "char_4043_erato_snow#5",
      "portraitId": "char_4043_erato_snow#5",
      "illustId": "illust_char_4043_erato_snow#5",
      "modelName": "Erato",
      "drawerList": [
        "温泉瓜"
      ],
      "description": "Erato's home attire/Untold Stories. Soft, tight-fitting fabric with a thick and comfy scarf; comfortable attire for relaxing at home.",
      "rarity": 118
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "4-4",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 811,
            "atk": 428,
            "def": 60,
            "magicResistance": 0,
            "cost": 21,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.4,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1054,
            "atk": 595,
            "def": 81,
            "magicResistance": 0,
            "cost": 21,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.4,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 70,
      "rangeId": "4-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1054,
            "atk": 595,
            "def": 81,
            "magicResistance": 0,
            "cost": 23,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.4,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 1318,
            "atk": 784,
            "def": 102,
            "magicResistance": 0,
            "cost": 23,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.4,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3241",
          "count": 4,
          "type": "MATERIAL",
          "name": "Sniper Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_SNP1"
        },
        {
          "id": "30052",
          "count": 4,
          "type": "MATERIAL",
          "name": "Polyketon",
          "rarity": 2,
          "iconId": "MTL_SL_KETONE2"
        },
        {
          "id": "30062",
          "count": 2,
          "type": "MATERIAL",
          "name": "Device",
          "rarity": 2,
          "iconId": "MTL_SL_BOSS2"
        }
      ]
    },
    {
      "maxLevel": 80,
      "rangeId": "4-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1318,
            "atk": 784,
            "def": 102,
            "magicResistance": 0,
            "cost": 23,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.4,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1648,
            "atk": 957,
            "def": 125,
            "magicResistance": 0,
            "cost": 23,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.4,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3243",
          "count": 3,
          "type": "MATERIAL",
          "name": "Sniper Dualchip",
          "rarity": 5,
          "iconId": "MTL_ASC_SNP3"
        },
        {
          "id": "30064",
          "count": 5,
          "type": "MATERIAL",
          "name": "Optimized Device",
          "rarity": 4,
          "iconId": "MTL_SL_BOSS4"
        },
        {
          "id": "30103",
          "count": 11,
          "type": "MATERIAL",
          "name": "RMA70-12",
          "rarity": 3,
          "iconId": "MTL_SL_RMA7012"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_erato_1",
      "skillName": "Lullaby's Meter",
      "desc": "The next attack deals <@ba.vup>{atk_scale:0%}</> ATK as Physical damage and inflicts <$ba.sleep>Sleep</> for <@ba.vup>{sleep}</> seconds",
      "iconId": "skchr_erato_1",
      "spCost": 9,
      "initSp": 0,
      "duration": 0,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 2.4
        },
        {
          "key": "sleep",
          "value": 5
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 2,
              "type": "MATERIAL"
            },
            {
              "id": "30043",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 2,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_erato_2",
      "skillName": "Heroes' Paean",
      "desc": "ATK <@ba.vup>+{atk:0%}</>, ASPD<@ba.vup>+{attack_speed}</>; prioritizes <$ba.sleep>Sleeping</> enemies",
      "iconId": "skchr_erato_2",
      "spCost": 25,
      "initSp": 15,
      "duration": 20,
      "blackboard": [
        {
          "key": "atk",
          "value": 0.5
        },
        {
          "key": "attack_speed",
          "value": 50
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30053",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_erato",
      "moduleName": "Erato's Badge",
      "desc": "Operator Erato has demonstrated a remarkable aptitude for maintaining distance whilst conducting suppressive fire against enemies of heavy caliber.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Sniper Operator during field operations to exercise Besieger responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_erato",
      "moduleName": "Change of Ways",
      "desc": "Erato has been in the forest south of the village for a whole month.\nShe sits on a tree branch, idly plucking her bowstring. Not long ago, this was a battlefield where the village's guerrilla forces fought the invaders for control of the land. Sargon's colonial rule over Minos is now merely history, and the small invasion force has left this land that did not belong to them.\n'The brave archer repelled the enemy and became a hero admired far and wide. She also won the national archery championship. Then she returned to her hometown, settling into a life with her farm and garden... No, this ending is too bland. How can a tale of heroic adventure end so simply?'\nThe forest is quiet, and Erato's murmured storytelling is the only sound to be heard. The stiff bowstring vibrates, producing a faintly melodious sound. Several fowlbeasts settle in to form an audience, landing on the branches beside her, as well as her shoulders.\nErato looks south and sighs. The starlight above her head filters through layers of branches, leaving only a faint light. The vast sea of trees blocks the wind blowing in from the distance.\n'They say that the land beyond this forest is an endless desert. The invaders they expelled came from that desert.'\n'Life in places without grass and flowers must be difficult. But why is our world like this? Some places are full of flowers and grass, while others are barren?\n'Maybe the gods were lazy when shaping the lands, and in some places, they sculpted meticulously, creating mountains and lakes full of flowers and grass. In others, they just scribbled, resulting in desert and tundra. Because they live in such different environments, people in different places cannot understand each other, bringing about all manner of conflict... What do you think?'\nOf course, the fowlbeasts do not answer, they only take the flowers from Erato's hairpins and bring them back to their nests.\nErato proceeds with this opening, telling her story while playing and singing. From the hero leaving her hometown to the adventures on the road, meeting like-minded friends and teaching lessons to villains. By the time the story reaches 'The brave archer finally came to the place where the land ends and shot an arrow at the lazy creator god hiding there,' the last fowlbeast had fallen asleep by her side.\nErato jumps down from the tree branch and lands on the soft grass.\n'I should go and see for myself. Maybe I can find a similar story in my travels.'"
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "You want me to be your accompanist? Sure thing.",
      "voiceAsset": "char_4043_erato/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Whether in harpistry or archery, my skill is second to none in all of Minos. Look, this is the medal I won in Hymnic archery. Beautiful, isn't it? Proof of my skills as a harpist? Several troupes have asked me to accompany them, you know~ Hmm... Actually, sit down. I'll play something for you.",
      "voiceAsset": "char_4043_erato/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Minos is a land of Romance. Day in and day out, you can see philosophers debating, warriors competing, and actors rehearsing grand epics. I will say though, our booze is some dangerous stuff. It's enough to drive one crazy, make one do fearsome things... How do I know? As if I'd tell you!",
      "voiceAsset": "char_4043_erato/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Tragedies are the most dazzling gems among our grand epics... or so I'd like to say, but Pallas's story is one of great disappointment. There is no greater humiliation than for a hero to remain unsung. 'There must be no flaws in a hero's mythos?' She said that? I simply cannot agree.",
      "voiceAsset": "char_4043_erato/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "From Minos to Bolívar, from Columbia to Leithanien. Each place has its own scenery and its own romance, and it is precisely because of this uniqueness that endless enmity and conflict are inevitable. But just as roses do not lose their beauty simply because they have thorns, this great land is equally worthy of love.",
      "voiceAsset": "char_4043_erato/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "Even the mightiest hero cannot win a war alone. Just as an epic must be passed down to be meaningful, a hero must stand with others to even become a hero. In the past, I always felt as if something was missing from my journey. That 'something' has been found since I came here.",
      "voiceAsset": "char_4043_erato/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "The Supreme One spread an incurable disease across the land, and the Healer was banished for opposing Him. The Healer, stripped of the power of divinity, descended to alleviate humankind's suffering through knowledge... Oh, this isn't Minos mythology or anything, it's just a story I made up.",
      "voiceAsset": "char_4043_erato/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Is this instrument a bow or a harp? Both~ The techniques behind the two are similar, both requiring discipline and elegance. Like this, gently place your fingertips on the strings, and thoughtfully acquaint yourself with the vibration from your fingertips. Want to give it a try? No, no, not like that. Give me your hand, I'll teach you.",
      "voiceAsset": "char_4043_erato/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "What am I reading? A volume of Victorian love poems. Shall I read some aloud for you? There's no need to be bashful; love and courage are one in the same – they should be red-hot and eye-catching, things that need not be concealed. Come, let's read some poetry together, Doctor.",
      "voiceAsset": "char_4043_erato/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Doctor, Doctor? Oh, you're asleep, huh? I was thinking about playing a little song for you, oh well...",
      "voiceAsset": "char_4043_erato/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "So this is Rhodes Island, huh? At last, at long last... No, all of this was ordained by fate, so I should be saying, it's about time! You can call me Erato. Is Pallas here, may I ask?",
      "voiceAsset": "char_4043_erato/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "I didn't realize there was still so much to learn when it comes to team combat...",
      "voiceAsset": "char_4043_erato/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "Rankings? Promotions? No, no, heroes ought not focus their sights on such trivial things. But, I will accept this accolade as proof of our mutual trust.",
      "voiceAsset": "char_4043_erato/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "Should I celebrate this occasion by playing a song, or no? Let me think about what to say... Hmm, in the name of the Twelve Heroes of Minos, I dedicate my bowstring to thee, and my harp shall accompany thee into the ages.",
      "voiceAsset": "char_4043_erato/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Witness the crown jewel of Minoan archery.",
      "voiceAsset": "char_4043_erato/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Leave everything to me.",
      "voiceAsset": "char_4043_erato/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "My arrow points toward victory.",
      "voiceAsset": "char_4043_erato/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "I shall witness your end.",
      "voiceAsset": "char_4043_erato/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "As you wish.",
      "voiceAsset": "char_4043_erato/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "I will not disappoint.",
      "voiceAsset": "char_4043_erato/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "What wonderful scenery. A fine place for a battle.",
      "voiceAsset": "char_4043_erato/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Fate guides me here.",
      "voiceAsset": "char_4043_erato/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "One shot, one kill.",
      "voiceAsset": "char_4043_erato/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Sleep to the sound of my harp. Sleep and death are of a kind.",
      "voiceAsset": "char_4043_erato/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Listen well to the requiem I play for thee.",
      "voiceAsset": "char_4043_erato/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Be scattered upon the wind!",
      "voiceAsset": "char_4043_erato/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Life must eventually end, but legends live on forever. We've done it, Doctor.",
      "voiceAsset": "char_4043_erato/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "A victory worth celebrating. Let us sing! Doctor, did you witness my performance?",
      "voiceAsset": "char_4043_erato/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Chasing stragglers is scarcely fit for heroes of legend. Let them be.",
      "voiceAsset": "char_4043_erato/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Hurry, run...! Our story mustn't end here!",
      "voiceAsset": "char_4043_erato/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Can I play some music here?",
      "voiceAsset": "char_4043_erato/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Hm?",
      "voiceAsset": "char_4043_erato/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "You seem to be in a good mood today, Doctor. Did you want to share a dance?",
      "voiceAsset": "char_4043_erato/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_4043_erato/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Another year, huh...? Though I am still unfamiliar with Rhodes Island's customs, the importance of ceremony cannot be understated. If there is no ceremoniousness to counterbalance the atmosphere of levity, the occasion is forgotten easily. Happy New Year, Doctor. As a present, I'll play a song for you. What would you like to hear?",
      "voiceAsset": "char_4043_erato/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Doctor, did you want to listen to me sing?",
      "voiceAsset": "char_4043_erato/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "In mythology, every hero's birth is accompanied by a strange phenomenon. For example, the once-in-a-century blooming of a flower, or a falling star... Just what happened on this day, years ago? It must've been a spectacular sight. Happy birthday, Doctor. Go ahead and make a wish.",
      "voiceAsset": "char_4043_erato/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "Rhodes Island is a unique place, where people from all over the world come together to fight for a common cause - it's practically something you can only find in mythology. I wish to continue to witness the story of Rhodes Island as it unfolds. Surely, we shall compose the most grand of epics together.",
      "voiceAsset": "char_4043_erato/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "train_spd&profession2[040]",
      "buffName": "Sniper Expert α",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, <@cc.kw>Sniper</> Operators' Specialization training speed <@cc.vup>+30%</>",
      "skillIcon": "bskill_train_sniper1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "train_spd&profession2[240]",
      "buffName": "Pluck String",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, <@cc.kw>Sniper</> Operators' Specialization training speed <@cc.vup>+30%</>; if training this skill to Specialization Level <@cc.vup>2</>, training speed will be further increased by <@cc.vup>+45%</>",
      "skillIcon": "bskill_train2_sniper1",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}