{
  "id": "char_4110_delphn",
  "meta_info": {
    "name": "Delphine",
    "appellation": " ",
    "voiceActor": {
      "en": "Amber Lee Connors",
      "jp": "Risa Sekiguchi",
      "kr": "Kim Ji-yune",
      "cn": "Tong Zeng"
    },
    "rarity": 5,
    "profession": "Caster",
    "subProfessionId": "Mystic Caster",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "DPS"
    ],
    "nationId": "Victoria",
    "isNotObtainable": false,
    "itemObtainApproach": "Event Reward",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Delphine\n[Gender] Female\n[Combat Experience] 3 Years\n[Place of Birth] Victoria\n[Date of Birth] Nov 2\n[Race] Feline\n[Height] 152cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Standard \n[Mobility] Standard \n[Physical Resilience] Standard \n[Tactical Acumen] Excellent \n[Combat Skill] Standard \n[Originium Arts Assimilation] Standard",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Delphine, formerly an active intelligence officer in Norport for many years, later participating in a series of military campaigns near Londinium as a member of the Exemplars. After the Victoria incident, she worked out a number of cooperative strategic agreements with Rhodes Island to assist the Victorian branch office.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, the operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Delphine shows no signs of Originium infection.\n\n[Blood Originium-Crystal Density] 0.14u/L\nOperator Delphine's BOCD is on the high side, and the fighting in Londinium must have affected her health to some degree. She needs to be extra careful to lower her risk of contracting Oripathy.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Delphine is the daughter of Victoria's famous Duke of Windermere, and first in line to the title. This is practically an open secret in Rhodes Island. \nWe have plenty of operators with status and power, but even among them, the authority Delphine wields—or perhaps we should say 'could wield'—is still an extraordinary case. No matter how Victoria is perceived today, being the heir to a truly powerful dukedom implies being able to command an entire fleet of high-speed battleships, having full control over the territory, and access to a considerable amount of wealth. However, Delphine seems to have voluntarily given up all of these enviable resources. The only things she has kept for herself appear to be the coat embroidered with the Windermere name and the saber left by her mother. \nNowadays, other than the training room, she spends most of her time on Rhodes Island consulting a variety of travel guides and well-traveled operators. She carefully notes down valuable information and researches the best routes, just like a seasoned backpacker. However, she does not seem to have any passion for sightseeing, as neither the natural nor cultural tourist attractions that ordinary travelers flock to are ever a priority in her plans. She has not divulged much detail about her itinerary, but one thing we are sure of is that she seems to prefer visiting more chaotic regions that most prefer to avoid. \n\nDelphine and I talked a bunch about fun places and delicious shops near my place! But most people don't pay special attention to places like metallurgical factories and mines when they're plannin' a travel route, aye? ——Bagpipe \nMm-hmm, the habits of a workaholic. Understandable. ——Harmonie",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Delphine rarely talks about her past, but sometimes she tells her friends from the Glasgow gang about the summers she spent as a child at Lynncardine. \nLynncardine is located on Victoria's northeastern border with Leithanien. It is Victoria's military stronghold and the most important nomadic city in the Duke of Windermere's demesne—these descriptions often conjure an image of a stark and daunting nomadic fortress, but Delphine describes the place is completely differently. \nNaturally, since it is her hometown. \nShe will speak of a small lake that shows up on the road to the city. Only during the summer do the city's denizens have the privilege to catch a glimpse of its always-clear waters. She will also mention a strange tree by the lake, and the seven or eight insect species one can find in June. Sometimes the city comes close to a woodland in summer, and she will always enthusiastically list off every type of tree one can find whenever she mentions it. Also, when Lynncardine sails into the shadow of a mountain, or when it heads toward a huge raincloud... \nThere is no doubt that Delphine spent the best moments of her childhood there. But no fragment of these memories matches what we'd expect from 'a Duke's successor.' The Duke of Windermere was known in Victorian aristocratic circles for her strictness, and many speculated that even her heirs would be spared no quarter. Delphine's adeptness at combat and the calluses on her hands are proof her mother did indeed have high expectations of her. But on the other hand, her mother also wished to protect her daughter's smile more than she wanted to prepare her successor to become the next Duke by shuttling her between banquets and military camps as the Duke of Windermere. \nPerhaps precisely because she knew that her child would find it difficult to earnestly raise the corners of her lips again, upon inheriting her responsibilities.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Classified Log] \nThe chaos erupting in several counties under Windermere came as no surprise to us. \nAfter the Duke was KIA, all her troops retreated from Londinium's frontlines, effectively withdrawing from the war. The nomadic fortresses sent to the frontlines were also called back. According to several statements from Lynncardine, Duke Amphelise Windermere and her heir, Delphine Windermere, died on the battlefields near Londinium. Several factions with succession rights have begun competing for control over Windermere's demesne, and one can see the various supporters behind their backs: traditional military corporations, other Victorian dukes, and even Leithanien's Kurfürsten. \nBut Delphine shows a rather negative attitude toward the situation in Windermere, reluctant to return to Lynncardine or to use her identity to regain any faction's support. She told us she would not use any connections or assets available to her as Windermere's successor, and that Lynncardine has nothing to do with what she plans to do next. \n\nThis archive includes a recorded conversation approved by the concerned parties: \nEnough asking, Hannah. I'm not going back. I know you mean well, but I won't change my mind. It's not because I think I'm not up for it, or that I'm afraid of giving myself all that trouble. I know all too well how to play those political games, win over a few people, suppress a few more, and promise another few some benefits... Don't forget, I've spent a considerable number of years doing intelligence work. \nThe question is: Do I want to continue playing these games? \nOf course I love my mother and father who dedicated their lives to the demesne, and I don't want to deny their efforts, but we've seen how everything ended. Lynncardine's savior won't be me, or any one person, that's just not possible. I'd rather do more concrete work, to kill the specific culprits instead of continuing to get myself hopelessly entangled with those conspirators as a 'Duke's daughter' or a 'Duke.' \nThat's how I feel about Lynncardine, and Victoria too. Don't underestimate the people living there, they can make their own choices. What they need are not leaders, but companions. \nI'm one of you guys, part of the Exemplars. We help everyone we meet with practical work, and it'd be no different even if I took on some kind of position. \nWe praise those who 'take up responsibility,' but whoever said that responsibility requires entering the palace?",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "An unsent letter: \nDon't worry, Mum. I'm doing fine here. \nI'll be heading out again soon, to Castshire County this time. I still have no plans to return to Lynncardine just yet, and there's no way I can see you in person, so all I can do is to write you a letter about my current situation. \nI'm still in Norport, and the reconstruction work here is going pretty smoothly. The 'Slobberknocker' has reopened, and Hannah made a vow to make it the best in Victoria. I have no doubts about that. We paid Baird a visit too, and Morgan wanted to bring her some new tapes. I know she liked going over to the video shop just to sleep, and not for a love of movies, but as long as they're happy, I'm fine with that. Baird would definitely be glad to know that we plan to reopen the place in a while after saving up enough money, and we'll always leave a chair out for her. \nI've seen so many things these days, so much more than I ever saw on my trips with Papa. I'm starting to realize that I don't really know the country I grew up in. I learned how crude ale is brewed, and that people go door-to-door buying burdenbeast dung to use as fuel. I learned too little from you and Papa, but it's also because of this that I feel I've made the right choice. \nTwo days ago, I dug out an old photo that I must have used as a bookmark and brought all the way to Londinium. I already forget how old I was back then, but Papa was holding up a huge fin with both hands while you were holding onto my shoulders with a scowl on my face—probably because that was yet another vacation that ended early. It was only then that we were nobodies, and nothing happened. \nI really miss you, Mum.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "The doctor's seen your mum. She told me she's injured, but she'll wake up in no time. \n'I know how you feel. You're thinking: if only you were stronger, less hesitant, if you hadn't been slacking on your training, if you'd walked a different path... would your mum be fine now? \n'But... there's no way to change what's already happened. Your mum put herself out there to protect you, so if you want to repay her for that, then you have to become stronger, strong enough to stand in front of her the next time she's in danger. \n'So, don't cry anymore. She's waiting for you to grow up and protect her too, you know!' \nAfter the Londinium incident concluded, Delphine rescued a mother and daughter duo at the Victorian border who survived a bandit raid. She handed the seriously injured and comatose woman over to the doctor, and held the incessantly crying girl in her arms, spending the entire night calming her down until she finally fell asleep at dawn.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1240,
      "atk": 1004,
      "def": 114,
      "magicResistance": 20,
      "blockCnt": 1,
      "baseAttackTime": 3,
      "respawnTime": 80,
      "cost": 26
    }
  },
  "skins": [
    {
      "skinId": "char_4110_delphn#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_4110_delphn",
      "portraitId": "char_4110_delphn_1",
      "illustId": "illust_char_4110_delphn_1",
      "modelName": "Delphine",
      "drawerList": [
        "Cenm0"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_4110_delphn#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_4110_delphn_2",
      "portraitId": "char_4110_delphn_2",
      "illustId": "illust_char_4110_delphn_2",
      "modelName": "Delphine",
      "drawerList": [
        "Cenm0"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "3-13",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 667,
            "atk": 541,
            "def": 48,
            "magicResistance": 10,
            "cost": 24,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 954,
            "atk": 773,
            "def": 82,
            "magicResistance": 10,
            "cost": 24,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 70,
      "rangeId": "3-14",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 954,
            "atk": 773,
            "def": 82,
            "magicResistance": 15,
            "cost": 26,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 1240,
            "atk": 1004,
            "def": 114,
            "magicResistance": 15,
            "cost": 26,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3251",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30062",
          "count": 3,
          "type": "MATERIAL"
        },
        {
          "id": "30012",
          "count": 4,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 80,
      "rangeId": "3-14",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1240,
            "atk": 1004,
            "def": 114,
            "magicResistance": 20,
            "cost": 26,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1532,
            "atk": 1240,
            "def": 128,
            "magicResistance": 20,
            "cost": 26,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 3,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3253",
          "count": 3,
          "type": "MATERIAL"
        },
        {
          "id": "31084",
          "count": 8,
          "type": "MATERIAL"
        },
        {
          "id": "31043",
          "count": 10,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_delphn_1",
      "skillName": "'Concentration'",
      "desc": "Attack range <@ba.vup>changes</>, attack interval is <@ba.vup>significantly reduced </>, and each attack deals <@ba.vup>{attack@atk_scale:0%}</> ATK as Arts damage",
      "iconId": "skchr_delphn_1",
      "spCost": 15,
      "initSp": 5,
      "duration": 5,
      "blackboard": [
        {
          "key": "attack@atk_scale",
          "value": 0.5
        },
        {
          "key": "base_attack_time",
          "value": 0.2
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30093",
              "count": 1,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30155",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 2,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_delphn_2",
      "skillName": "'Preemptive Strike'",
      "desc": "ATK <@ba.vup>+{atk:0%}</>, but no longer targets enemies below <@ba.vup>50%</> HP. Attacks cause targets to take <@ba.vup>{damage_addition:0%}</> of Delphine's ATK per second as Arts damage (stacks up to 4 times, lasts until the skill ends)",
      "iconId": "skchr_delphn_2",
      "spCost": 40,
      "initSp": 20,
      "duration": 30,
      "blackboard": [
        {
          "key": "atk",
          "value": 1
        },
        {
          "key": "max_cnt",
          "value": 0.24
        },
        {
          "key": "attack@max_cnt",
          "value": 0.24
        },
        {
          "key": "damage_addition",
          "value": 0.06
        },
        {
          "key": "attack@damage_addition",
          "value": 0.06
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31063",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31064",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_delphn",
      "moduleName": "Delphine's Badge",
      "desc": "Operator Delphine has demonstrated a perennial commitment to Originium Arts.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Caster Operator during field operations to exercise Mystic Caster responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_delphn",
      "moduleName": "Gloomy Justice",
      "desc": "'It's now my 231st day on field assignment. Everything around me has become unfamiliar as can be...'\nDawn. By the soft glow of the campfire's dying embers, Delphine writes the first sentence in her diary entry, then halts, suddenly realizing how it's been almost a year since the close of that great Londinium war. When she first went over Victoria's borderlands, then a knight-errant, she discovered iniquity in spades that had scant weighed on her before, so as time passed, her sword became a habit, dispensing the justice she felt right.\nThus, when she learns of a still nearby band of Sarkaz vagrants disquieting the locals and looting wherever they please, she finds a destination. 'Perhaps just more wretches who found the war had ended before they even made it to Londinium.'\n'Help me...'\nEyes following the voice, she looks back. A young Feline girl pokes her head out from the shadows.\nShaking, the girl points to the far black horizon, whereupon Delphine finally catches sight of the blade-wielding figures, four in total. They approach.\n'It's devils, the lot of them. Could you get me home?' the girl asks.\nFrom its hefty scabbard, Delphine draws what was once her mother's saber, through which courses Originium Arts. Their glow casts light on the girl's frightened face, shallow scars and black crystals thrown into sharp relief.\nThe distant figures pause, then not a moment later turn to leave, and disappear back into the dark of the horizon.\n'You want me to take you home?'\nBriefly, the girl hesitates. Without the courage to meet Delphine's fierce gaze, she merely hangs her head and nods.\nYet once back at the camp, they are refused at the gate. The camp's leader is wary, on guard against Delphine who follows the girl closely.\nAnd Delphine needs but a glance to see how the camp's Feline Infected gather, whips stowed at the ready, trying to hide the Sarkaz children quaking in terror.\nDelphine's fury ignites. 'You make an innocent child pretend she's hunted. You trick countless people to this camp, only to hurt them.'\n'Be on your way.' Delphine lets the girl go, then singles out the leader. 'You, with me. There will be a price to pay for the innocents you've hurt.'\n'I'm only helping my people out.'\nDelphine shakes her head. 'That's no excuse. Have you given any thought to how these children will be when they grow up?'\nShe takes the leader far away, far enough that no eye in the camp could reach them.\n'I'll contact Rhodes Island to assist them. Now, en garde.'\nOn her 231st day on field assignment, Delphine bears a scabbard with one scar more, and sallies forth for a direction that leaves Victoria only further behind."
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "Be at ease. I won't let another assassin do his work right in front of me, ever again.",
      "voiceAsset": "char_4110_delphn/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "There's nothing that can derail the historical trajectory of Victoria, not even Theresis, or even the dukes. It's nothing but different people taking turns to wallow in the same puddle of mud. You want my honest opinion? Heh. Stay back, lest you get mud splashed on you.",
      "voiceAsset": "char_4110_delphn/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "I lived with Mum for a long time when she was stationed on the border all year round, and the towers of Londinium were never in sight... I never so much as asked her. Just what it was that made her so willing to toil away all those years, out on the border?",
      "voiceAsset": "char_4110_delphn/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Say. I hear Her Royal Highness Alexandrina is continuing to gather more supporters? Very well... Sooner or later, Vina will have to face the same choice as I did. Though all told, taking off a crown invites far more obstacles than giving up a dukedom. If you get the chance, do tell her I wish her all the best.",
      "voiceAsset": "char_4110_delphn/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "The sword brandished and never sheathed is the sword of the weak. Even though my mum taught me swordplay from a young age, more than anything, she made me practice the art of stowing my blade. If I'm to inherit her position, then I can't be daggers drawn for most issues that greet me... And just knowing that chafes.",
      "voiceAsset": "char_4110_delphn/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": " 'Self-evident?' 'Just?' Great nobles in their ivory towers, engaging in nefarious deeds so that their country endures and prospers, is that self-evident? The starving Infected robbing the innocent in a desperate attempt to live another day, is that just? These are questions I won't give up on finding the answers to.",
      "voiceAsset": "char_4110_delphn/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Rhodes Island has shown its sincerity to me, so even though she's... no longer with us, our deal still stands true. Of course, this is as long as you don't mind my currently utterly powerless status, Doctor.",
      "voiceAsset": "char_4110_delphn/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Did you find these... at the video shop? I actually picked these out just for Baird, but she never gave them the time of day, saying they were just so noisy... They're useless now, so you can have them. These are some of Wrankwood's must-watch comedy classics.",
      "voiceAsset": "char_4110_delphn/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "There's countless scenarios I've thought of to prevent my mum from being assassinated, and always, always, the result is the same... She was so strong, she never had a need to question her own decisions. Tears? Hah, you must be mistaken, Doctor. I learned long ago to never cry.",
      "voiceAsset": "char_4110_delphn/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "You can rest easy, I'll be here. There aren't many chances to take a nap on the battlefield.",
      "voiceAsset": "char_4110_delphn/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "We can save each other the trouble of introducing ourselves, and I'll treat this contract as a token of you approving how we cooperate. Can I get back to work now, Doctor?",
      "voiceAsset": "char_4110_delphn/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "This battle record is a five out of five. It's as good as the Wrankwood action blockbusters I used to watch at the video shop.",
      "voiceAsset": "char_4110_delphn/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "Interesting. A 'medical organization,' employing a standard military promotion system...? Hmm. I can already see certain people getting their just desserts for underestimating you.",
      "voiceAsset": "char_4110_delphn/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "A higher position often means taking more responsibilities, but I'm sick of people in those positions using responsibility as a shield for their own selfishness, so I hope things will be different here. In any case, our partnership has at least for now, taken another step forward.",
      "voiceAsset": "char_4110_delphn/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "I'll cooperate at all times.",
      "voiceAsset": "char_4110_delphn/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Don't worry. I'll make sure everyone on the squad is safe.",
      "voiceAsset": "char_4110_delphn/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Bury the habit of fighting each to your own!",
      "voiceAsset": "char_4110_delphn/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Survey the terrain, and clear out those despicables in hiding.",
      "voiceAsset": "char_4110_delphn/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Hesitancy is forbidden on the battlefield!",
      "voiceAsset": "char_4110_delphn/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "May I draw my sword now?",
      "voiceAsset": "char_4110_delphn/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "A radical strategy, but I can work with it.",
      "voiceAsset": "char_4110_delphn/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Judge by appearance, and suffer the consequences.",
      "voiceAsset": "char_4110_delphn/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Do not disregard me!",
      "voiceAsset": "char_4110_delphn/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "You picked the wrong foe!",
      "voiceAsset": "char_4110_delphn/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "A fine opportunity.",
      "voiceAsset": "char_4110_delphn/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "No need to hold back.",
      "voiceAsset": "char_4110_delphn/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "That was some clean commanding. We have a bit of time before our mission is estimated to end, so you should grab the chance to think about how to reward yourself.",
      "voiceAsset": "char_4110_delphn/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "A reasonable result. I'd doubt your ability to achieve your ambitions, if coping with this was beyond you.",
      "voiceAsset": "char_4110_delphn/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "It's not for us to leave without regrets, Doctor... Let's accept reality.",
      "voiceAsset": "char_4110_delphn/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Am I... still not good enough?",
      "voiceAsset": "char_4110_delphn/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "This style... it fits my impression of you.",
      "voiceAsset": "char_4110_delphn/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "That's rude.",
      "voiceAsset": "char_4110_delphn/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Want some canned food? The sugar will get you fat though.",
      "voiceAsset": "char_4110_delphn/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_4110_delphn/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Happy New Year, Doctor... Um, everyone's asking me to attend the party? I used to spend the day with just Mum, so I don't know... Never mind, I have nothing else to do today anyway, so let's go, Doctor.",
      "voiceAsset": "char_4110_delphn/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "It's been a while, Doctor. Ready to move out?",
      "voiceAsset": "char_4110_delphn/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "I took this photo from someplace high up while on a certain trip. Can you tell who these people are fighting for, when they've been reduced to dots? Perhaps you've never seen the land of Victoria from such a perspective, so who knows just what ideas you might have. No need to tell me though. Happy birthday, Doctor. ",
      "voiceAsset": "char_4110_delphn/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "We were all there when that happened out of the blue... Even now I still can't forget just how powerless I felt then. Such occasions will only happen even more often, as you get more and more factions watching you. Can you still persevere on, even when facing an unstoppable disaster?",
      "voiceAsset": "char_4110_delphn/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "hire_spd&clue2[260]",
      "buffName": "Old Acquaintances, New Friends",
      "desc": "When this Operator is assigned to the HR Office, HR contacting speed <@cc.vup>+20%</>, and for every <@cc.vup>1</> contact made, increases the likelihood of obtaining <$cc.g.glasgow><@cc.kw>Glasgow Gang</></> clues (working time and recruit slots improve the likelihood)",
      "skillIcon": "bskill_hire_spd&glasgow",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "control_tra_limit&spd[010]",
      "buffName": "Master Strategist",
      "desc": "When this Operator is assigned to the Control Center, for <@cc.vup>each</> <$cc.g.glasgow><@cc.kw>Glasgow Gang</></> Operator assigned to the same Trading Post, order acquisition efficiency <@cc.vup>+10%</>",
      "skillIcon": "bskill_ctrl_g_limit&spd",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}