{
  "id": "char_391_rosmon",
  "meta_info": {
    "name": "Rosmontis",
    "appellation": " ",
    "voiceActor": {
      "en": "",
      "jp": "Yui Ogura",
      "kr": "Yoon Eun-seo",
      "cn": "Ruoyu Zhang"
    },
    "rarity": 6,
    "profession": "Sniper",
    "subProfessionId": "Flinger",
    "position": "RANGED",
    "team": "Rhodes Island Elite Operators",
    "tagList": [
      "DPS"
    ],
    "nationId": "Rhodes Island",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Rosmontis\n[Gender] Female\n[Combat Experience] 1 Year\n[Place of Birth] Columbia\n[Date of Birth] July 6\n[Race] Feline\n[Height] 142cm\n[Infection Status] \nCrystals have appeared on her body. Infection confirmed by medical examination.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Normal/■■\n[Mobility] Standard/Excellent\n[Physical Resilience] Normal/Outstanding\n[Tactical Acumen] Standard/——\n[Combat Skill] Normal/Standard\n[Originium Arts Assimilation] Outstanding/——\n\nThe above results represent the highest recorded performance achieved by Operator Rosmontis and her Originium Arts respectively. All examinations pertaining to Rosmontis's Originium Arts will be performed outdoors.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Rhodes Island Elite Operator Rosmontis possesses a high aptitude for a rare form of Originium Arts particularly adept at confronting large creatures, destroying hard objectives, immobilizing facilities under emergency, and putting a stop to small-scale skirmishes. She has been shown to possess a solid control of the battlefield and considerable tactical value in assault, positional, and annihilation scenarios. Under Kal'tsit's assignment, she is currently active as a core annihilation specialist. \nAll other files pertaining to Rosmontis have been moved to the high clearance database.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests have shown the outlines of some of her internal organs to be indistinct due to abnormal shadows. Originium granules have been detected in her circulatory system; there are signs of Oripathy infection. \n\n[Cell-Originium Assimilation] <1%\n\n[Blood Originium-Crystal Density] 0.13u/L\n\nMost currently known internal organ crystallization and Originium hyperplasia originate from localized lesions caused by the accumulation of Originium particles in the bloodstream. \nYes, Touch, your hypothesis is more or less on point. \nThis particular subject can perhaps be called an Infected, but it's hard to say this is Oripathy. \nThe Infected organ located in her brain stem isn't natural. That's right... It was an artificial implant. Having referenced Raidian's inspection report, we can say for certain that this device is unmistakably artificial in nature. \n\nIf, just like this particular subject, Specter's Infection was artificially induced... Leaving aside the question of how Specter's immune system is able to fight her Originium infection so fiercely... the liquid Originium density in Specter's cerebrospinal fluid has already reached such a high level that her life is undeniably in danger. We had to resort to all kinds of measures just to prevent her situation from getting any worse, as we naturally should do. \nLet's look at the experiment that was performed on this particular individual. One of the objectives of this experiment was to figure out how to contain the Originium Infection and the negative effects it produces. \nAnd they managed to pull it off, albeit only temporarily. \nFrom the project's inception, their plan was to create an individual who is not afflicted by Oripathy but is nonetheless an Infected. A caster who doesn't need an Arts Unit. A master of Originium Arts who does not need to be trained in its theory. \nHer Infected organs do not exacerbate the Originium density in her body in any way. In a certain sense, this individual is as good as not Infected. \nWith her life functions still in perfect order, should we really remove this artificial organ? The organ that lets her breathe and swallow, and lets her blood flow normally? \nI'm afraid we haven't met that requirement. No one has. This experiment is likely impossible to reproduce in the short term, and we are supposed to reverse its results, to return her body composition to normal? \n\nThe Loken Watertank Laboratory is a shambles. The little research data they had were all wiped out as well. We will likely never know whether the data was destroyed or successfully retrieved by its sponsor. The lab's actual proprietor would prefer to keep news of the scandal under wraps. The technological companies looking to thrive in the wake of Loken Watertank's downfall are likely a dime a dozen, and who knows how many spies there are in the Columbian cities? \nLoken Williams was a genius, but his ignorance and apathy led to the deaths of many, including his own in the very end. Poetic justice, no doubt. \nThe Maylander Child Rights Protection Foundation's rescue of the individual from the laboratory ruins and their subsequent exfiltration from the country were the result of its board's careful deliberation. They were intent on keeping Loken's research results out of the hands of Columbian companies and interest groups. If the research conducted at Loken was allowed to continue to ferment, it would only result in further instability. This will not be tolerated. They will not allow it. They would rather pretend it happened in the first place. \nIn the end, the girl ended up under my care... Perhaps by fate, or perhaps because, along with Loken's mentor, I was the one who ended Loken's life as an Oripathy researcher in Columbian academia. But we both knew it in our hearts that he wasn't going to be stopped by that. It was nowhere close to enough to stop someone who would claim the lives of everyone who walks upon this land for his own benefit. \nWith this, our cooperation with Maylander came to an end. This would be the final mission ever to be sanctioned by them and carried out in secret by us. This individual, the experimental subject, will forever disappear from Columbia's records. \n\nMaylander doesn't care if she lives or dies. What happens to her from here onwards is up to us. \nBut what would her treatment—the removal of this artificial organ—entail? The damage this has on her system may be minimal. \nThe device does not have a replacement function. It had never crossed their minds to implement such a function. \nThe device has already become a part of the individual. They turned her Arts Unit... into her life source. \nI don't have the right to ask her to give up her own life. \n...However, ethics is a matter between you and me, not Rhodes Island. \n\n——Dr. Kal'tsit",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Hmm, we've already put together a two-way comparison table...Yeah, she is exactly as she looks. Just a little Feline girl. There isn't very much we can say about that...\nHowever, her Arts... Well, we've stopped holding the tests indoors already, but the data we got from the tests before explains a lot. \nI guess it's not a good idea to talk theories here. I mean, I don't really understand theories myself. The theoretical casters are always talking about stuff like perception reversal and thought impetus. Seems to have to do with cognitive science and neurology, and things I'm bound to never understand. \nLet's just talk about her Arts' performance. Right, I mean, there's quite a lot that's classified, and this information is just here to give you the gist. \nSome of us have started to call her Arts her spiritual entity. After all... This is a very fitting and convenient way to describe it. \nHer Arts can stretch out into a wide 'net' that can detect the movements of objects within its range. The 'net' covers a huge area, and most people are unaware of her 'touch.' Her Arts can also be used on just a single individual. I suppose it's like a big hand... I've tried asking her to keep her Arts's range to the smallest area possible, but, even then, she can only manage to shrink it down to a few square meters. I'm guessing that's because she's trying to 'grip' her target. Aside from that, it doesn't seem she can use this power on the inside of her target. Even when we gave her a transparent pitcher with its innards clearly visible, she couldn't make the pitcher burst from the inside. All she could do was squeeze it from the outside. This looks even more and morelike a flexible, malleable force-exerting entity. \nDuring the test process, still going by that 'hand' and 'grip' imagery, we surmised she's able to use at most four of those large, shapeless 'hands' of hers when her concentration is at its peak. It seems the test results were measured based on her Arts' activity and deep water testing. Both her speed and strength measurements go to show that there is tremendous power hiding in her Arts, yet we aren't even able to detect any signs of her using her Arts before they break something. \nWhy just four, and why are they all shapeless 'hands'? Is that how she imagines them? Indeed, when we were examining the deformation of her targets' structures, we can't help but think that some of the bumps might be the gaps between her fingers...\nAnd whenever there was a considerable temperature difference, she would also seem to get frostbite or burns when she uses her Arts... neurally speaking, at least. There weren't any apparent symptoms. She would just say... 'It's cold'... or 'It hurts.' And based on her cerebral cortex's activity, it's true. \n(The voice in the recording gets softer)\nI heard an explanation that's kinda out there... even scary. \nThey say her brother still lives within her. And her Arts are like... her brother reaching out his hands, either hugging the land or pounding it with force. \nI have no idea who was the first person to say that. It's unsettling. \n\n——Recording of Field Reporter Caster KK",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "It's been a while since the patient Maylander sent us began her training. I have no idea if this is Kal'tsit or Outcast's idea, but there's no doubt she's got better thanks to this. \nShe's not like the other experimentation victims I've seen. They're either always screaming their lungs out, or they've already lost their ability to live and take care of themselves; they're always just curled up in their vessels, trembling. \nMy first impression is that she is from a middle-class family and has received a certain amount of education. But when her mental state is unstable, the destruction she wreaks on the ship sure is a terrifying sight to behold. \nShe fears laboratories. She hates medical equipment. And even though our equipment is already several times hardier than normal armor, she even managed to lift one up into the air and crushed it into a ball about the size of a fist. I suppose if it wasn't for Logos, all of us would've long been dead several times over. \nBut thanks to that, we now have a pretty good picture of the kind of life she lived. Kal'tsit has recently requested Engineering to renovate some of the laboratories and rehab sickrooms. I also took the opportunity to replace some of the equipment in the testing facilities to give them a more comfortable, warmer feel. \nAnd now she doesn't make quite as much of a scene. \nTrying to talk to her about what's right or wrong isn't going to do us much good... She's a very sensible kid to begin with. She demonstrates a kind of mental sickness not dissimilar to memory loss. Sometimes, she even forgets her professional knowledge. \nNonetheless, we found that reinforcing her knowledge bit by bit is effective. Touch speculates that she hasn't actually forgotten. She's merely sealed her memories. We think this might have to do with the device in her brain. Or perhaps this is the result that she wanted, and her Arts helped her achieve that. \nHer Arts definitely isn't as simple as a kind of telekinesis. Her past torments her, and that's why she's trying to erase her memories. But she also isn't able to control the strong, unorderly emotions left over... It's a mess. Then, she gets upset that she's forgotten again, and gets anxious and confused because of that. She gets distressed for not meeting our expectations, even though we'd be more than willing to cheer her on and help her. She will still blame herself. \nAt the very least, it's not possible for us to retrace her participation in the experiments. She has practically dug her entire brain out. It's a violent way to go about it, almost like she sealed herself away. Her amnesic symptoms might even be side effects of this behavior. \nHer cognitive ability is being exhausted by herself relentlessly. My guess is her artificial organ is using it up to deal with her ongoing stress. \n\nI think she needs a recorder. I will make her a terminal. One that's easy to type on. That way she can go over her notes whenever she wants, dig up those scenes and dialogues she wants, and restore her emotions back to the truths in her head and reorganize them. Just like giving a movie its dialogues back. \nOnce she asked me why I wouldn't let her wear shoes in the room. As I explained the safety side of it, I also thought of borrowing a pair of shoes from Amiya for her to wear when she leaves the cabin. Amiya came over herself. She even brought with her a new pair of shoes, and were they not a perfect fit. The two kids were fast friends. Amiya was very skilled at comforting her. \nI thought to myself. That was the moment the patient's life truly began instead of some point in the past. There are still lots of mysteries surrounding her, but what does any of that matter? \nKal'tsit said she'll put up a poll for the casters and medical elite operators after a while. I'm in engineering, so I'm not voting, but if I had a vote, I would probably vote to let her stay on the island. If what she needs is someone to guide her through her stress, to teach her how to control her Arts, then we're the right men for the job. \n\n——Indistinct personal records found inside a folder.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Elite Operator File]\n1) Infected. \n2) Personality:\nA strong sense of togetherness, Proactive. \n3) Information Pertaining to Identity:\n Columbia \nPartnership status, Disastrous event, Agreement terminated. \nInfected, Protected, Experimental subject. \nFurther disclosure of information forbidden. \n4) Information Pertaining to Infected Status:\nAttachment, Understanding, Protective. \n5) Strategy Summary:\nCore of her squad, Annihilation, Focused. \n6) ■■ Possibility:\nMedium. \n7) Type B Events:\nAllowed. As carefully supervised. \n8) Mobilization Authority Granted:\nKal'tsit, Amiya\n\n Newly Granted: Doctor.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Loken Watertank isn't the source of the problem. \nWhen it all happened, Loken was likely under a lot of pressure. Otherwise, knowing his personality, he would not have made such a gamble. \nI'm not trying to defend him, but by trying to dissect his actions, I might also be able to verify a few of my viewpoints. \nMy guess is that he urgently needed some test results that supported his hypothesis, either to get his hands on some resources, to maintain his position, or to preserve his project. \nLoken implanted this artificial organ in this particular subject only because his research had to do with the Infected. If his research was in the bionics, then no matter how many of her organs ended up getting replaced, the subject would not have had even the tiniest traces of Oripathy. \nThe subject and her brother were dragged into this mess only because they had a somewhat unique gift in Originium Arts... Their adoption after their family was destroyed, their fraudulent guardian, the corrupt orphanage all played a hand. \nI won't rule out the possibility. Maylander's report clearly says that Loken murdered her brother to fulfill his experiment's objectives. The direct cause of the incident was that the 'consciousness' that he forcefully extracted from her brother activated her Infected organ. \nWhether this is purely a product of her imagination or is indeed just like what was reflected by the errors in the scans... It's eerie, I know. But her 'brother' might still exist somewhere in her brain. She probably doesn't want to know about this yet—This stems from her subconscious refusal, or perhaps it's the wishes of her 'brother.' \nExccessive theoretical neuroscience intersts me not. Such experiment was entirely profit-driven. Its data was tainted by blood. This kind of data can only be used to back theories that support war and violence. We don't need that. \nLoken Watertank had been under the table for long. The fact that a laboratory of its size was able to direct such deep, inhumane crimes just goes to show how far down this road of privilege Columbia's scientific research has come. \nCompared to Ursus and Sargon, Columbia's laws are no doubt more advanced and stringent. But how severe the law is has nothing to do with how many crimes have gone unpunished.it actually is. Both the ones who enforce the law and those who administer it are only people. A progressive society carries the burden of being even more 'civilized.' \nThat's how that fate befell her. Just simply because they needed her to be an Infected, they wanted her to have those powers, being able to expand her Arts casting by the way of compressing her consciousness... \n\nPerhaps it was Volvort Kochinski or Rhine Lab... and it's a bit of a stretch, but it could also have been pharmaceutical companies like Parasol or Tower Mountains... but in any case... It doesn't matter who Loken Watertank's benefactors were. \nWhoever they are, there's an even bigger disaster waiting for them sooner or later. \n\nSo, the vote's results... My guess is there are two votes against. \nLogos agreed as well, didn't he? Hm? No, I'm not surprised. You may think he doesn't care about anything other than Kazdel affairs, but if that was the case, he wouldn't have agreed to become an elite operator in the first place. \nIt's just like those two to vote no... Pith was against it, and I suppose that's only natural. \nI'll persuade them. \nOf course, you guys practically forced this one on me. Right, Touch, you guys voted yes. You guys should be the ones to persuade them. I'm merely trying to speed things up. \nMy reason for doing this? \nI was giving her a checkup this morning, and she asked me if I remember what her name was. \nShe wants to know what she used to be called. She's slowly trying to face her past... even if it's already ruined her once. Or perhaps she should get a new name. \n...If our cities and our residents are truly more advanced than the bloodthirsty barbarians of ages past, then we must at least prove that our personalities have improved. \nPreventing science from being used to harm the innocent is also a responsibility of mine. \nPerhaps it's still too early to give her a name. She should come up with her name herself. But we can give her a codename right now. \nI believe that by becoming an operator, her future, as well as that of the world itself, will become that much brighter. Now that all of you agreed, I promise I will teach her. She will still become your family... Your teammate. \nShe can do it. \n[In the old mythologies, there exists a miraculous plant that helps those who cannot face their memories to be brave and courageous. From here on out, her codename will be Rosmontis. ]",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'Will she ever return to a normal life? '\n...What makes a life 'normal' anyway? Is it the the tatters woven from leaves that the settlers of the wilderness wear, or is it the fine Leithanian garments woven with Arts? The sour bean soup that sells for three cents a bowl in the Columbian slums, or the dozens of lavish dishes served at banquets of a county of Victoria? \nEach and every person born in this world is shaped by the environment they grew up in. You would have to be biased, arrogant, and completely ignorant to believe that there is a certain kind of life you could call 'normal.' \nYou should trust this girl and nothing more than the girl herself, Give her time. Wait for her to puff her chest out, her head held high. The decisions she makes and the future she wants to achieve. That's her normal life. That's what you call a normal life. It's that simple. \nYou're her world. However you treat her, that's how she'll treat this world. \n\n——Whitesmith",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1477,
      "atk": 584,
      "def": 200,
      "magicResistance": 15,
      "blockCnt": 1,
      "baseAttackTime": 2.1,
      "respawnTime": 70,
      "cost": 25
    }
  },
  "skins": [
    {
      "skinId": "char_391_rosmon#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_391_rosmon",
      "portraitId": "char_391_rosmon_1",
      "illustId": "illust_char_391_rosmon_1",
      "modelName": "Rosmontis",
      "drawerList": [
        "唯@W"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_391_rosmon#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_391_rosmon_2",
      "portraitId": "char_391_rosmon_2",
      "illustId": "illust_char_391_rosmon_2",
      "modelName": "Rosmontis",
      "drawerList": [
        "唯@W"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_391_rosmon@epoque#17",
      "skinName": "Become Anew",
      "skinGroupName": "EPOQUE/XVII",
      "skinGroupId": "2022#epoque#4",
      "avatarId": "char_391_rosmon_epoque#17",
      "portraitId": "char_391_rosmon_epoque#17",
      "illustId": "illust_char_391_rosmon_epoque#17",
      "modelName": "Rosmontis",
      "drawerList": [
        "唯@W"
      ],
      "description": "EPOQUE Sub-Brand [Passe] Series Selects/Become Anew. Rosmontis's attire while still a test subject, adorned only by detectors and inhibitors.",
      "rarity": 32
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "3-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 874,
            "atk": 341,
            "def": 123,
            "magicResistance": 10,
            "cost": 23,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.1,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1166,
            "atk": 461,
            "def": 160,
            "magicResistance": 10,
            "cost": 23,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.1,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "3-9",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1166,
            "atk": 461,
            "def": 160,
            "magicResistance": 10,
            "cost": 25,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.1,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1477,
            "atk": 584,
            "def": 200,
            "magicResistance": 10,
            "cost": 25,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.1,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3241",
          "count": 5,
          "type": "MATERIAL"
        },
        {
          "id": "30022",
          "count": 9,
          "type": "MATERIAL"
        },
        {
          "id": "30062",
          "count": 3,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "3-9",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1477,
            "atk": 584,
            "def": 200,
            "magicResistance": 15,
            "cost": 25,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.1,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 1944,
            "atk": 688,
            "def": 245,
            "magicResistance": 15,
            "cost": 25,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.1,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3243",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30135",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30054",
          "count": 5,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_rosmon_1",
      "skillName": "Expanded Cognition",
      "desc": "The next attack deals an additional hit equal to <@ba.vup>{extra_atk_scale:0%}</> ATK as Arts damage",
      "iconId": "skchr_rosmon_1",
      "spCost": 2,
      "initSp": 0,
      "duration": 0,
      "blackboard": [
        {
          "key": "extra_atk_scale",
          "value": 1.8
        },
        {
          "key": "append_atk_scale",
          "value": 0.5
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30073",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_rosmon_2",
      "skillName": "Nociceptor Inhibition",
      "desc": "Attack Interval <@ba.vdown>increases</>, ATK <@ba.vup>+{atk:0%}</>, splash area <@ba.vup>expands</>, and each attack causes <@ba.vup>2</> additional shockwaves; Enemies hit by this unit's attacks and shockwaves have a <@ba.vup>{attack@prob:0%}</> chance to be <$ba.stun>Stunned</> for <@ba.vup>{attack@stun}</> seconds",
      "iconId": "skchr_rosmon_2",
      "spCost": 30,
      "initSp": 20,
      "duration": 40,
      "blackboard": [
        {
          "key": "base_attack_time",
          "value": 0.5
        },
        {
          "key": "atk",
          "value": 0.55
        },
        {
          "key": "add_times",
          "value": 2
        },
        {
          "key": "attack@prob",
          "value": 0.2
        },
        {
          "key": "attack@stun",
          "value": 1.5
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30093",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 9,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_rosmon_3",
      "skillName": "'As You Wish'",
      "desc": "Attack Interval <@ba.vup>decreases</>, ATK <@ba.vup>+{atk:0%}</>, and attacks up to <@ba.vup>{attack@max_target}</> <@ba.rem>blocked</> enemies at a time; Immediately deploys two pieces of Tactical Equipment on ground tiles within Attack Range (After deployment, surrounding enemies are <$ba.stun>Stunned</> for <@ba.vup>{stun}</> seconds, and the blocked enemies' DEF <@ba.vup>-160</>)",
      "iconId": "skchr_rosmon_3",
      "spCost": 60,
      "initSp": 35,
      "duration": 30,
      "blackboard": [
        {
          "key": "base_attack_time",
          "value": -0.5
        },
        {
          "key": "atk",
          "value": 0.75
        },
        {
          "key": "attack@max_target",
          "value": 2
        },
        {
          "key": "def",
          "value": 1
        },
        {
          "key": "attack@append_atk_scale",
          "value": 0.5
        },
        {
          "key": "stun",
          "value": 3
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30013",
              "count": 11,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_rosmon",
      "moduleName": "Rosmontis's Badge",
      "desc": "Operator Rosmontis has demonstrated a remarkable aptitude for attacking enemies from long range across a simultaneous multiplicity of terrains.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Sniper Operator during field operations to exercise Flinger responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_rosmon",
      "moduleName": "'Notes'",
      "desc": "'Outcast, I'm a little concerned. After returning from the Chernobog core city, Rosmontis has been carrying out her missions with extreme aggression. The human traffickers in Minos are indeed despicable, but they fall under Minoan jurisdiction. The original plan only called for us to rescue the Infected children, not eliminate the suspects.'\n'Isn't it normal to adjust mission objectives in our line of work? Pith, you oughta trust Rosmontis's judgment.'\n'Have you heard? Surviving witnesses refer to her as the 'Scourge of Minos.' Fortunately, the girl herself doesn't remember any of it. Touch says she had forgotten all details of the mission by the time she returned to the ship. I'm not sure her brain will manage to derive any worthwhile experience from the whole thing.'\n'Memories aren't always useful experiences, sometimes they can be heavy burdens. Since her opinions aren't colored by her own prejudices, and she isn't hemmed in by community consensus, Rosmontis might be even more impartial than we are. She's like a mirror that can't be stained, reflecting the morality of the situations around her.'\n'That's why Kal'tsit wants us to guide her together. Even if her actions reflect our values, Rhodes Island won't be with her her whole life. Once we're gone, who can judge the mirror itself, whether she's good or evil?'\n'She's awake now, Pith. We can ask her ourselves.'\nHello, Outcast.\n'Hello, Rosmontis.'\nAre you leaving, Outcast?\n'Yes, I'm off to Victoria for a little something. But Pith is right, I'll be gone, Kal'tsit will be gone, and someday, we'll all be gone.'\n'Will Amiya be gone too?'\n'Could be. Nobody knows the future. Judge Rosmontis, Your Little Honor, can you look after yourself for us?'\nYes, I promise. I promise everyone that I'll write everything down. I remember the stories you and Pith told me. I won't forget.\nI can do it, you and Pith don't need to worry.\nIf I ever turn bad... no, no matter what I become in the future.\nI'll document it all, I'll look over it carefully.\nThe last one I will judge will be me, myself."
    },
    {
      "moduleId": "uniequip_003_rosmon",
      "moduleName": "Rosmontis's Specialized Badge",
      "desc": "In light of permissions granted, the Field Operations Department has hence passed the following resolution with respect to Rosmontis:\nWhere the entailing mission would fall under Integrated Strategies scope, this operator shall be pursuant to tactics of a reinforced nature in meeting the enemy.\nIn witness whereof,\nThis badge is hereby conferred upon the above named.\n'I will be the judge.'"
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "Umm, Doctor... I'm not very good at filing and writing reports. Do you think you can assign me to another position? Eh? I don't need to do anything. All I need to do is hang out here? Doctor... You're a weirdo.",
      "voiceAsset": "char_391_rosmon/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Everyone at Rhodes Island is my friend. The elite operators and my squad mates are my family. Ms. Kal'tsit doesn't want me to treat them as family. I didn't get it at first, but I do now. They're like flowers in a vase. If you don't pay attention to them, they'll wither. But they're all I have.",
      "voiceAsset": "char_391_rosmon/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "What am I reading? Oh, it's an entry from two days ago. Closure spilled her coffee that morning and stained a couple scrolls in the library. And she got cursed, I think. For every five words she says, she ends up spitting on someone's face. Scary, isn't it?",
      "voiceAsset": "char_391_rosmon/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Painful things, sad things, and scary things all go away when you least expect them to. But it's not okay to forget them. I need to remember them, because those emotions are still there inside me. I don't want to end up crying without knowing why. Memories are a burden, and I have to carry my own burden.",
      "voiceAsset": "char_391_rosmon/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "I can't use a shield, I can't use a bow, I can't make guns glow, and I can't turn those iron rods into weapons very well. More importantly, the other elite operators are much warmer than me. This warmth is what helps them fight for everyone else and for what's right. I will do my best.",
      "voiceAsset": "char_391_rosmon/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "Ms. Kal'tsit has lost lots of family, right? I see it in her eyes. How does she keep it to herself and manage to live with it? Just thinking about how everyone will disappear eventually one after another is enough to make my heart ache. Like it's going to explode. Is it because she's a grown-up? Then I want to grow up soon.",
      "voiceAsset": "char_391_rosmon/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Doctor, could you tell me what this word means? I asked Blaze about it, and she just kept giggling, and Amiya just kept hitting her. Oh, it means kissing? I know what that is, then. Doctor, bend down a little, okay? Can I kiss you on the cheek? Thanks for always taking care of us. Meow.",
      "voiceAsset": "char_391_rosmon/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "I won't forget about those people. They created me and those monsters. They wanted to use us to do bad things. Before the world finally stops hurting us all... I'll punish these people. I will make it really, really hurt, so they never, ever forget.",
      "voiceAsset": "char_391_rosmon/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "Oh... You're the Doctor, right? I went over the records on the terminal just yesterday. Yep, I remember now, Doctor. You can give me orders. Let's go on a mission? Make sure to use my powers well.",
      "voiceAsset": "char_391_rosmon/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Hmm... the Doctor is taking a nap. Looks restless, too. Must be tired. If I give the Doctor a hug, it should feel a little better, right? Just relax and sleep well. I know how it feels... It hurts even in your dreams, right? I can tell.",
      "voiceAsset": "char_391_rosmon/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Hello, Doctor. I am Elite Operator Rosmontis. Ms. Kal'tsit has given her permission. You can give me and my team orders now. Use my power where it matters, Doctor. I also tend to forget about things pretty easily. Be sure to remind me if it looks like I might forget something.",
      "voiceAsset": "char_391_rosmon/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "Yeah... I got that down now. I can use this in battle.",
      "voiceAsset": "char_391_rosmon/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "I asked Ms. Kal'tsit why I'm an elite operator. Lots of people talk behind my back. They say I'm not right for the job. Ms. Kal'tsit said that if I become an elite operator, I'll remember more, and I'll become a better person. Yep, I'm doing my best.",
      "voiceAsset": "char_391_rosmon/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "This world isn't going to get better so easily, but humans tend to get worse because of their surroundings. Doctor, we can't turn into bad people. If you do, I am sure you'll be really, really bad. I won't let you turn out like that.",
      "voiceAsset": "char_391_rosmon/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Time for a mission? Yeah, I know. I will protect all of Rhodes Island's operators. I promise.",
      "voiceAsset": "char_391_rosmon/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "I am the leader? Don't worry. They may not be from my team, but I'll make sure their support doesn't go to waste.",
      "voiceAsset": "char_391_rosmon/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Don't worry. I know how to control my Arts.",
      "voiceAsset": "char_391_rosmon/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "I don't want to see my family get hurt. I will destroy everything that could hurt my family.",
      "voiceAsset": "char_391_rosmon/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "I won't remember you.",
      "voiceAsset": "char_391_rosmon/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Give me your order. I will see it through.",
      "voiceAsset": "char_391_rosmon/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "It's starting.",
      "voiceAsset": "char_391_rosmon/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Stand back. If you don't want to see what's about to happen, don't look.",
      "voiceAsset": "char_391_rosmon/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "If it hurts, just cry out. It'll feel better.",
      "voiceAsset": "char_391_rosmon/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "If you surrender now, I won't hurt you.",
      "voiceAsset": "char_391_rosmon/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "You won't die... I'll make sure you don't die.",
      "voiceAsset": "char_391_rosmon/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "There are things that have to be done by someone. There are things that only I can do.",
      "voiceAsset": "char_391_rosmon/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "If there comes a day when I can't use these Arts again... Hmm. What will that day be like? I can't imagine.",
      "voiceAsset": "char_391_rosmon/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "That was very nice, Doctor. There, there. Thanks.",
      "voiceAsset": "char_391_rosmon/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "I will take care of the rest. It won't take long.",
      "voiceAsset": "char_391_rosmon/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "No... I won't retreat. I can't disappoint the others. I still have my sword... Even without my sword, I can still fight! I won't leave!",
      "voiceAsset": "char_391_rosmon/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "P-Please don't lock me in a small room. They're scary... I... I don't really like those kinda rooms.",
      "voiceAsset": "char_391_rosmon/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "D-Don't touch me! ...You'll get hurt.",
      "voiceAsset": "char_391_rosmon/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Um... I-I'll try to bear with it... and not break your hand...",
      "voiceAsset": "char_391_rosmon/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_391_rosmon/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "I don't remember how I used to spend New Year's very well. I think I had brothers, and we would set off fireworks in the yard, but I also wonder... Were they real? The people on Rhodes Island… are the only ones I have left. Please don't leave me. Not ever.",
      "voiceAsset": "char_391_rosmon/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Oh, you're the Doctor, right?",
      "voiceAsset": "char_391_rosmon/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Doctor, I remember your birthday now. It's always been on my terminal. This is a really, really good day, right? I don't know why we celebrate the days we were born... But just hearing the word, make me feel life and warmth. Doctor, do you want to blow out the candles? Candles are warm, too.",
      "voiceAsset": "char_391_rosmon/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "Should I wear blue shoes or white shoes to the party tonight? Doctor, I don't remember what I've done this past year, but all the people I hurt were bad, right? If I haven't done anything wrong, I want to wear this new pair of white shoes.",
      "voiceAsset": "char_391_rosmon/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "manu_prod_spd_bd_n1[000]",
      "buffName": "Extrasensory",
      "desc": "When this Operator is assigned to a Factory, for every <@cc.kw>1</> operator in the Dormitory, <$cc.bd_a1><@cc.rem>Perception Information</> </><@cc.vup>+1</>. Additionally, every <@cc.vup>1</> points of <$cc.bd_a1><@cc.rem>Perception Information</></> is converted into <@cc.vup>1</> points of <$cc.bd_A><@cc.rem>Chain of Thought</></>",
      "skillIcon": "bskill_man_spd_bd_n1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "manu_prod_spd_bd[000]",
      "buffName": "Psychokinesis",
      "desc": "When this Operator is assigned to Factory, for every <@cc.vup>2</> points of <$cc.bd_A><@cc.rem>Chain of Thought</></>, productivity <@cc.vup>+1%</>",
      "skillIcon": "bskill_man_spd_bd1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "manu_prod_spd_bd[010]",
      "buffName": "Manifestation of Consciousness",
      "desc": "When this Operator is assigned to Factory, for every <@cc.vup>1</> points of <$cc.bd_A><@cc.rem>Chain of Thought</></>, productivity <@cc.vup>+1%</>",
      "skillIcon": "bskill_man_spd_bd2",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}