{
  "id": "char_4105_almond",
  "meta_info": {
    "name": "Almond",
    "appellation": " ",
    "voiceActor": {
      "en": "Eden Riegel",
      "jp": "Yu Serizawa",
      "kr": "Kim Yea-lim",
      "cn": "Er Jiao"
    },
    "rarity": 5,
    "profession": "Specialist",
    "subProfessionId": "Hookmaster",
    "position": "MELEE",
    "team": "Blacksteel",
    "tagList": [
      "Shift"
    ],
    "nationId": "Columbia",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Almond\n[Gender] Female\n[Combat Experience] 1 Year\n[Place of Birth] Columbia\n[Date of Birth] Feb 27\n[Race] Perro\n[Height] 140cm\n[Infection Status]\nOriginium crystals distributed across surface of body, confirmed Infected by medical examination.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Normal\n[Mobility] Normal\n[Physical Resilience] Standard\n[Tactical Acumen] Standard\n[Combat Skill] Standard\n[Originium Arts Assimilation] Normal",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Laura Arias, an engineering expert from Blacksteel Worldwide. She possesses remarkable technical acumen for her age and has rich, practical experience in fields such as mechanical engineering and automation. She's provided critical technical support to numerous Blacksteel operations.\nDuring the latest round of exchange projects between the two companies, Laura personally applied to be deployed to Rhodes Island as a dispatch operator. Now, she works with Engineering on its R&D projects as a special technology consultant, and she's no slouch either.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests show the indistinct outlines of internal organs, obscured by abnormal shadows. Originium granules detected in the circulatory system. The subject is confirmed to be infected with Oripathy.\n\n[Cell-Originium Assimilation] 4%\nSmall traces of crystallization are visible on Operator Almond's body surface.\n\n[Blood Originium-Crystal Density] 0.19u/L\nOperator Almond's BOCD is trending upwards. Fortunately, her condition has not worsened.\nConsidering how often she goes into the engine layer of nomadic plates, ventures deep inside energy towers, and even hangs out in front of active power plants, she should consider herself lucky that she's as healthy as she is.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "When it comes to engineering experts, Almond is a rare breed: the kind that talks way too much.\nMany Engineering operators still remember how, the moment she set foot in Engineering, Almond started expressing her opinions on every project and prototype she spotted, as well as joining in on the engineers' discussions with no reservations whatsoever. Rather than putting her head down to work, she'd much rather talk it out in a group and facilitate teamwork. By lucky coincidence, this is exactly how Rhodes Island tends to work. Aside from helping her fit in right away, her bottomless blabbermouth quickly dispelled the image of a young, accomplished engineer everyone had of her, and without attracting any animosity.\nAlmond talks fast, but her words are clear and distinct, and she is confident in the way she expresses herself. When discussing things such as budget and safety, her conversations balloon to double the normal length (and when talking about useless crap, quadruple the length). When expressing her opinions, she starts with her conclusion before going into each individual issue, such that everyone can clearly understand what she has to say. She always gets straight to the point. Surprisingly, however, her look of concentration while talking has also become a topic of interest among certain operators.\n\n'Did you see that?! After just five minutes of talking, she figured out how the Type I02 Originium internal combustion engine works, and even arranged for the follow-up work right after. Amazing how quickly she solved the explosion risk.'\n'Oh... Laura's cheeks look so red when she's talking. I wanna pinch them so much—'\n—The private conversation of two Engineering Department operators",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "It's worth noting that money—or more accurately, funding—holds a very important position in Almond's way of life.\nIf she sees life as a large engineering project, then currency must be its energy source, the key to the entire system's operation. In which case, her keen nose for and stubborn pursuit of funding must have some kind of hard-to-explain connection to her outstanding insight as an engineer. 'Funding doesn't solve every engineering problem, but you can't get anything done without funding.' Almond has proven through her actions that she takes this mantra to heart. Her total number of budget applications each quarter is consistently number one within the department, and she always provides the most diverse reasons in them:\n—'The tensile strength is way below standards. We gotta change the entire outer shell to Fuscous Fiber!'\n—'This is an emergency! We need to add a new sewage system to the control room!'\n—'The technicians are passing out! We need a new filtration system ASAP!'\nAlthough the amount of funding she seeks is truly terrifying, and she often falls behind on progress milestones, Almond's need for funding is by no means baseless or unfounded. She gives each and every line item in her budget careful consideration, and has clear entries in her accounts to back everything up. As for her seemingly absurd reasons, the vast majority of them are a testament to her hard work at pushing boundaries.\nAs it turns out, all of her research results are proof of her talent and how forward-thinking she is.\n\n[Voice Log]\n'My mom's a doctor, my grandma's an engineer, and my dad's a househusband. When we first moved to Columbia, it was hard to find work. My family was very poor, and my dad had to figure out how to stretch a single loaf of rye bread to feed the whole family for a day.\n'My grandma made my tools, and the money I spent on my equipment came from my mom working night shifts. The only parts I could use were scraps from the workshops...\n'I'm sure you know, but people who grew up like me never waste a cent. Please... just a little more funding. Just a teensy bit.'\n'How many times have you given us that same sob story? But the problem here isn't the budget... Why don't you take another look at the reason you put on the form?\n'The pink paintjob looks so lame...'\n'No duh it does! That's a special suspension arm! We need to paint it neon green to suit the needs of nighttime work!'",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Of all her coworkers from Blacksteel, Jessica is the one that Laura worries about the most. From a bystander's point of view, perhaps 'Jessica's family is loaded' is reason enough for Laura to befriend her, but interestingly enough, it was Jessica who laid the groundwork for their friendship.\nLaura was infected with Oripathy after graduating from college, and was forced to give up on a job offer from a tech company and join Blacksteel Worldwide instead, known for its tolerance of the Infected. Yet before this, Laura had no experience getting along with mercenaries. As to be expected, on her first mission, the mercenaries already had strong doubts about the green engineer's unusual ideas. And when Laura found herself in that difficult position, it was Jessica who stepped forward to support her plan as well as persuade the other mercenaries to trust her.\nWhen questioned about this afterward, Jessica noted that she saw a bit of her old self in Laura, from back when no one believed in her. It was through the trust of Liskarm and Franka that she finally mustered her confidence. But regardless, she thought that Laura also deserved a chance to be believed in, and Laura responded to her trust with results. This is how their friendship began.\n\n[Blacksteel Worldwide - Operational Records]\nInquiry Scope: Laura Arias, Jessica Brynley\nControl Clearance: Liskarm\n......\n'Jessica, why didn't you follow the plan and use the equipment I set up?! Do you know how bad things can get if you don't follow regulations?!\n'You see that big wheel spinning really fast? Your hand almost got caught in it! You see all this sweat? That's how anxious you made me!\n'You're always like this. Last time, and the time before that, and the time before... Don't give me that teary-eyed look. I'm not falling for it! Don't think I'm gonna go easy on you!'\n'You... You said that would buy the workers more time. B-But, have you considered how dangerous of a situation that would put you in?\n'......\n'*sob*... What do I even do with you, Jessica? I've talked to you about this so many times already...\n'Leave me alone. I'm not crying. Go away!\n'Waah... Go away. I'm not eating any dessert you're buying me...\n'*sob*... You say we're going to that restaurant you need to reserve a year in advance?\n'...What're you laughing at? I'm gonna eat till I drop! Hmph.. Don't you look at me with those teary eyes then!'",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'There's a flame burning in Almond's eyes.'\nAn Engineering operator described the scene she saw that night. She remembers Almond working overtime in the laboratory, and that she was bringing her a cup of hot cystymilk, but when she opened the door, she found Almond frowning as she stared intently at the computational model running on the screen, the simulated flame reflected right in her eyes. The operator was shocked, as she had never seen such an expression on her face, but when Almond turned around and started chatting with her, that expression was nowhere to be seen.\nThen, as she spent more and more time onboard Rhodes Island, more and more people started to realize that her petite body packed a huge amount of energy, as though at a moment's notice she could leap high into the sky to snatch something. Almond's lively personality may give the impression that 'she's very laid-back.' But in reality, the amount of effort she puts in has reached a level her coworkers could only dream of. She is able to lock herself in the laboratory all day, repeatedly work out the projects' most minute details with her team members, or run all over the place to secure the funding she needs. Motor systems and safety are two of her top concerns, and to obtain perfect performance numbers, she is willing to pull multiple all-nighters testing in the lab. Once, she was even found passed out in front of a work table.\nYet, when others ask her why she's willing to go to such lengths, she always answers evasively with excuses like 'my career' and 'dreams,' but no amount of questioning can get her to elaborate on those dreams. Some were worried that, as a Blacksteel employee, perhaps her participation in Rhodes Island R&D projects implied some kind of ulterior motive, though these rumors were quickly dispelled after her projects kept yielding results, while her attitude toward work remained unchanged.\nEven after her cystymilk had gone cold, she continued to stare at the screen. Compared to what she had lost, she thought she had yet to achieve enough, to jump high enough.\n\n[Voice Log]\nSometimes, I still dream of that morning we left Bolívar. The sky was pretty dark, and the shocked fowlbeasts were flying in circles above us. Mom loaded the last crate onto the car, I sat down on the crate, and then the engine started to roar under my butt.\nThe car started to move, and it got faster and faster. There was a loud boom. My dad covered my ears. I could make out where the fireball had landed. That was where our house used to be. My mom's medical certificate, my grandma's workshop, and all the dolls I couldn't bring with me were all still there.\nI looked at it again, and all I could see was a firelight soaring up into the sky. There was nothing left.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Under normal circumstances, Almond is very easy to get along with. There is, however, one special exception.\nSimply put, you shouldn't overdo it when you tease her. Say, when you give her apple wedges, don't sneak in a slice of onion. Or when she's focused on her work, don't suddenly hug her and hold her up, lifting her feet off the ground.\nWhenever similar situations occur, all the anger that's welled up in the bottom of her heart is immediately unleashed.\nTrust me, you don't want to know what it's like.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1618,
      "atk": 556,
      "def": 348,
      "magicResistance": 0,
      "blockCnt": 2,
      "baseAttackTime": 1.8,
      "respawnTime": 70,
      "cost": 13
    }
  },
  "skins": [
    {
      "skinId": "char_4105_almond#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_4105_almond",
      "portraitId": "char_4105_almond_1",
      "illustId": "illust_char_4105_almond_1",
      "modelName": "Almond",
      "drawerList": [
        "直立行走"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_4105_almond#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_4105_almond_2",
      "portraitId": "char_4105_almond_2",
      "illustId": "illust_char_4105_almond_2",
      "modelName": "Almond",
      "drawerList": [
        "直立行走"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "2-2",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 921,
            "atk": 299,
            "def": 179,
            "magicResistance": 0,
            "cost": 11,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1245,
            "atk": 428,
            "def": 264,
            "magicResistance": 0,
            "cost": 11,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 70,
      "rangeId": "3-2",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1245,
            "atk": 428,
            "def": 264,
            "magicResistance": 0,
            "cost": 13,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 1618,
            "atk": 556,
            "def": 348,
            "magicResistance": 0,
            "cost": 13,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3281",
          "count": 4,
          "type": "MATERIAL",
          "name": "Specialist Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_SPC1"
        },
        {
          "id": "30032",
          "count": 5,
          "type": "MATERIAL",
          "name": "Polyester",
          "rarity": 2,
          "iconId": "MTL_SL_RUSH2"
        },
        {
          "id": "30042",
          "count": 3,
          "type": "MATERIAL",
          "name": "Oriron",
          "rarity": 2,
          "iconId": "MTL_SL_IRON2"
        }
      ]
    },
    {
      "maxLevel": 80,
      "rangeId": "3-2",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1618,
            "atk": 556,
            "def": 348,
            "magicResistance": 0,
            "cost": 13,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 2130,
            "atk": 695,
            "def": 410,
            "magicResistance": 0,
            "cost": 13,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3283",
          "count": 3,
          "type": "MATERIAL",
          "name": "Specialist Dualchip",
          "rarity": 5,
          "iconId": "MTL_ASC_SPC3"
        },
        {
          "id": "30044",
          "count": 6,
          "type": "MATERIAL",
          "name": "Oriron Block",
          "rarity": 4,
          "iconId": "MTL_SL_IRON4"
        },
        {
          "id": "30083",
          "count": 13,
          "type": "MATERIAL",
          "name": "Manganese Ore",
          "rarity": 3,
          "iconId": "MTL_SL_MANGANESE1"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_almond_1",
      "skillName": "Magnetic Grab",
      "desc": "The next attack drags the target towards this unit <@ba.vup>moderately</>, dealing <@ba.vup>{atk_scale:0%}</> ATK as <@ba.vup>Physical damage</>\n<@ba.rem>Can store {cnt} charge(s)</>",
      "iconId": "skchr_almond_1",
      "spCost": 4,
      "initSp": 4,
      "duration": 0,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 1.7
        },
        {
          "key": "force",
          "value": 1
        },
        {
          "key": "cnt",
          "value": 3
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30023",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_almond_2",
      "skillName": "Power Traction",
      "desc": "Immediately launches a traction hook that <$ba.root><@ba.vup>Binds</></> its target, then deals <@ba.vup>{atk_scale:0%}</> ATK as <@ba.vup>Physical damage</> to the target and drags it towards this unit <@ba.vup>significantly</> every 1.5 seconds until this skill ends",
      "iconId": "skchr_almond_2",
      "spCost": 25,
      "initSp": 15,
      "duration": 4,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 1.8
        },
        {
          "key": "force",
          "value": 2
        },
        {
          "key": "hit_interval",
          "value": 1.5
        },
        {
          "key": "hit_duration",
          "value": 4
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30083",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31064",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_almond",
      "moduleName": "Almond's Badge",
      "desc": "Operator Almond has demonstrated a remarkable aptitude for assault following physical coercion of enemy proximity.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Specialist Operator during field operations to exercise Hookmaster responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_almond",
      "moduleName": "'Capstone Project'",
      "desc": "'Liskarm, what's this cake doing here?'\n'From HR, for the newcomer.'\n'Oh, you mean that engineering specialist they got? I think she was fresh out of college? We haven't had new meat in forever—don't you wanna mess with her a little? Ahah, there we are, I'll just hide the cake in this drawer for now.'\n'Knock it off, Franka, she's already here—Come in.'\n'Sorry, let me just put my stuff down. Is this the BPRS division?'\n'...Laura Arias?'\n'Yep.'\n'Laura, we'll be conducting an interview for BPRS now. Do you understand?'\n'Franka—'\n'Interview? Don't think anyone told me... Well, whatever, no problem. Go ahead, ma'am.'\n'Okay, listen close, first question—what the hell's this giant thing you brought with you?'\n'Huh, what? That sure is some question... It's the 'Traction Model Long-Distance Transporter Prototype', and it <i>was</i> my capstone project too, but... after packing up for Blacksteel, I made a few improvements to adapt it to the security field. But continuing the R&D takes funds, and applying for funds requires more experimental data, so I'm applying <i>here</i>... It'll be easier to explain if you just give it a try. Either of you ladies interested?'\n'Liskarm, how about you—'\n'I imagine you're dying to try it, aren't you, Franka?'\n'Here, hold this grip, and be careful.'\n'Oftentimes, security work means the enemy's some distance away. After modifications, this piece of gear's now able to drag anything or anyone right up next to you. Just pull the trigger.'\n'Whewww~. That's a lot more stable than any regular hookshot, but this sort of thing is pretty common.'\n'Right, that's the improved <i>basic</i> functionality, and what I'm currently researching lies a little elsewhere. You know, there's times you're in complex terrain and it's hard to get anywhere with your average hookshot, but these mechanical claws can grab onto most anything... Go on, try that out too. Press here and it'll switch modes.'\n'That's pretty handy! Hey, Liskarm, I can grab the you-know-what...'\n'Just use it like you used the other mode. But be careful, it's not fully calibrated yet, so—'\nCrash!\nAnd with that sudden sound, Franka vanishes from where she stood, appearing in an instant on the other side of the room. The cabinet topples over with a colossal thud, and cake and icing splatter all over the floor. Naturally, Franka's face gets the most.\n'Don't fire it at anything unfixed, since it'll drag you there pretty rapidly...'\nLiskarm forces her facial muscles to stay put, and turns to an apologetic-looking Laura.\n'I suppose we don't have a welcoming cake anymore. That concludes the interview. Welcome to BPRS, Laura. Your new life begins here.'"
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "Eh, how come work at the Engineering Department here is even more exhausting than Blacksteel? Good thing I've got some easy paperwork for a change of pace. Lemme start with this one. Umm... Hehe, sorry I bothered you, Doctor. I've got work to do, so I'm heading back to Engineering.",
      "voiceAsset": "char_4105_almond/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Doctor, you should've told me you dropped something behind this shelf. Look at you, wriggling around on the floor all day. Alright, get up. I've got specialized tools I use to carry bulky, heavy engineering equipment. We'll move it aside and grab your stuff. Do you have earplugs, though? It's probably gonna hurt your ears when I tow around this heavy-ass metal shelf...",
      "voiceAsset": "char_4105_almond/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Be brave, Laura. If you want your work to go smoothly and advance your career, you gotta take the plunge. Think about your future... Think about your dreams... Ah! What are you doing behind me?! I, I'm fine, it's just... I gotta get an injection tomorrow. I'm... I'm trying to get myself ready.",
      "voiceAsset": "char_4105_almond/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "If you ask me, the most annoying part of engineering projects and experiments is the funding! Even when you get your hands on it, you still have lots to worry about. Everything I do costs money, and every monthly account statement is red as hell, and my budget's always like toilet paper! Speaking of, how much funding can you give me next month? I gotta start planning early.",
      "voiceAsset": "char_4105_almond/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "My whole family lived in a single basement room when we first moved from Bolívar to Columbia. The space under my mother's bed was my first 'engineering lab.' I made lots of weird trinkets there. But I also got smacked just as much, heheh.",
      "voiceAsset": "char_4105_almond/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "The power plant is like the heart of a nomadic plate. During my years in the field with my team, I've basically been its primary physician. Either I'm giving it all I got to recover its pulse, or... I'm pronouncing it dead when there's nothing more I can do.",
      "voiceAsset": "char_4105_almond/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Hey, hey, Doctor! Down here! Look at me! I've got good news. Our engineering project just had a major breakthrough. Don't stand there like a bump on a log. Come, let's sit down, I'll show you... Oh my gosh, I'm sorry, I forgot to wash my hands. I got a handprint on your coat....",
      "voiceAsset": "char_4105_almond/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Nah, don't worry. My kneecap's not hurt. I just have a small crystal there, so I hide it with a band-aid. I know there's no need to hide it here, but I'm used to it. You know, Doctor, sometimes I wonder, If I'd met you guys before Blacksteel... Never mind. We don't have time for what-ifs.",
      "voiceAsset": "char_4105_almond/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "Doctor, you give everything you've got, even when there's nothing in it for you, just like Jessica. I'm not nearly as selfless as you guys, but I know when to be grateful. I won't let you down or squander the money and trust you two invested in me. I promise.",
      "voiceAsset": "char_4105_almond/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Falling asleep right on your desk... and your hair blocking your eyes like that. Hmm, guess I'll leave you this bone-shaped hairpin.",
      "voiceAsset": "char_4105_almond/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Pleasure to meet ya! I'm the engineer Blacksteel sent here on exchange. Just call me Almond. Are you the Doctor Jessica's always talking about? Let me get a good look at you. Hmm... You seem fine and... Normal, I guess?",
      "voiceAsset": "char_4105_almond/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "Now this is interesting. I never thought you could use engineering machinery like that.",
      "voiceAsset": "char_4105_almond/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "Oh, you shouldn't have. It's all a part of our contract. I'm just doing my job so… Hold on! What did you just say...? Invest · ment?",
      "voiceAsset": "char_4105_almond/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "Aw, come on. you can drop the act. I've worked on so many projects with Rhodes Island's Engineering Department. You're not here just to nitpick, are you?",
      "voiceAsset": "char_4105_almond/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "You need my tech on the battlefield too? No problem!",
      "voiceAsset": "char_4105_almond/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "I used to lead an engineering team, but now a combat team…? Alright, let's do this. Everyone, listen for the whistle!",
      "voiceAsset": "char_4105_almond/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Woo! I just got a new idea. Better write it down as soon as the fight's over.",
      "voiceAsset": "char_4105_almond/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Careful now, 'cause you won't escape once my little friends catch you!",
      "voiceAsset": "char_4105_almond/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Need me for something?",
      "voiceAsset": "char_4105_almond/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "You need anything, I'm your girl!",
      "voiceAsset": "char_4105_almond/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "It's all just like the blueprints. Peerrfect!",
      "voiceAsset": "char_4105_almond/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Even without a blueprint, I'm adaptable enough to work it out.",
      "voiceAsset": "char_4105_almond/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "All parameters set. Fire!",
      "voiceAsset": "char_4105_almond/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Sheesh, why are you so heavy?",
      "voiceAsset": "char_4105_almond/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Get over here!",
      "voiceAsset": "char_4105_almond/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Oh shoot, my grappling hook's stuck! Sorry for tripping you!",
      "voiceAsset": "char_4105_almond/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Doctor! Once we're back, be sure to check my blueprints! I can't just let you go when you've got such a great mind!",
      "voiceAsset": "char_4105_almond/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Good work, Doctor! Want a cookie? Too tough to chew...? Hmm… I think it's fine…",
      "voiceAsset": "char_4105_almond/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "I would've liked a more perfect finish, but these results aren't so bad.",
      "voiceAsset": "char_4105_almond/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Laying down smoke! Doctor, we'd better fall back while the enemy can't see us!",
      "voiceAsset": "char_4105_almond/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "The wiring in this room's terrible. Who did this? I'm gonna sort everything out here line by line.",
      "voiceAsset": "char_4105_almond/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Wai-wai-wait! Don't push! You'll mess up all the cables in my backpack!",
      "voiceAsset": "char_4105_almond/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "No · touching · my head!",
      "voiceAsset": "char_4105_almond/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_4105_almond/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Doctor, why you suddenly have three heads...? Now I gotta make four more sets of... uh... ear plugs, for the player that's gonna be your birthday gift...Wha? I had too much to drink? Don't be silly! Franka tried to get me to drink a whole big-ass mug, but I only had a-a teeny tiny little bit!",
      "voiceAsset": "char_4105_almond/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "I'm all set, Doctor. Ready to start working whenever!",
      "voiceAsset": "char_4105_almond/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Happy birthday, Doctor! I got you a set of puzzles for your birthday. You'll find out what my present is if you manage to solve it. Sounds like fun, right? Hmm... How come you look like you've figured it out already?",
      "voiceAsset": "char_4105_almond/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "Every day I've spent on Rhodes Island has been very fun, but since I started having fun, it's been hard to get absobed in my work like I did at Blacksteel. Er, how should I put it? Blacksteel feels more like a place for work, while Rhodes Island is more like... hehe, you know, home.",
      "voiceAsset": "char_4105_almond/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "manu_formula_spd&cost[000]",
      "buffName": "Little Whims",
      "desc": "When this Operator is assigned to a Factory, <@cc.kw>Precious Metal</> productivity <@cc.vup>+25%</>, and Morale consumed per hour <@cc.vdown>+0.25</>",
      "skillIcon": "bskill_man_gold3",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "manu_formula_spd&cost_bd[000]",
      "buffName": "Big Responsibilities",
      "desc": "When this Operator is assigned to a Factory, for each <$cc.g.bs><@cc.kw>Blacksteel Worldwide</></> Operator in the Base (excluding Assistants and Activity Room users, caps at <@cc.kw>3</>), <@cc.kw>Precious Metal</> productivity <@cc.vup>+2%</> and Morale consumed per hour <@cc.vup>-0.15</>",
      "skillIcon": "bskill_man_gold&blacksteel",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}