{
  "id": "char_4122_grabds",
  "meta_info": {
    "name": "Grain Buds",
    "appellation": " ",
    "voiceActor": {
      "en": "Triya Leong",
      "jp": "Natsuko Abe",
      "kr": "Lee Ju-eun",
      "cn": "Ruan "
    },
    "rarity": 5,
    "profession": "Supporter",
    "subProfessionId": "Decel Binder",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "Slow",
      "Crowd-Control"
    ],
    "nationId": "Yan",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Grain Buds\n[Gender] Female\n[Combat Experience] None\n[Place of Birth] Yan\n[Date of Birth] May 21\n[Race] Liberi\n[Height] 153cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Normal\n[Mobility] Standard\n[Physical Resilience] Normal\n[Tactical Acumen] Normal\n[Combat Skill] Normal\n[Originium Arts Assimilation] Excellent",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Grain Buds is an ordinary girl from Dahuang, an important agricultural settlement in the north of Yan. She has considerable experience handling stockbeasts, and followed Shu to Rhodes Island where she now stays as a temporary visitor.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is confirmed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Grain Buds shows no signs of Originium infection.\n\n[Blood Originium-Crystal Density] 0.12u/L\nGrain Buds rarely comes into contact with Originium.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Outstanding Farmer of Dahuang, Honorary Stockbeast Breeding Expert, Honorary Rice Planting Master, Excellency in Stockbeast Feed Research...\nUpon repeated verification, the above honors were all found to be genuine.\nGrain Buds always puts all her effort into doing the things she is capable of.\nHaving grown up in Dahuang, she's been infected by the residents' gung-ho attitude toward farming since a young age, and believes that to put food on the table, you have to earn your keep. Before she was even as tall as a hoe, she was already imitating the farmers and planting seeds. Unable to bear the sight, the elderly farmers instead sent her to feed the stockbeasts, only to find that they behaved especially well around her, almost as if they were on the same wavelength. As such, she was able to manage the massive ranches there in a very organized and tidy manner.\nGrain Buds has kept herself busy even after coming aboard Rhodes Island as a visitor. She's developed new recipes with the logistics operators at the cafeteria, helped care for the plants at the Convalescent Garden, and naturally never forgets to give every one of the new friends she's made here an easy-to-remember and pleasant-sounding nickname. Many medical operators have noted their work stress greatly decreasing thanks to her being around to look after juvenile patients and comfort them when receiving injections or medicine.\n'Guess it's easier for kids around the same age to hit it off...'\n'Or maybe she thinks she's still taking care of stockbeasts...?'",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Rhodes Island is already home to a number of so-called animal experts, and it is not at all uncommon for beasts to be trained to complete certain tasks. That said, none have ever dared to claim to able to speak to animals. Until Grain Buds, that is.\nShe insisted on demonstrating her talents: First, she found a lost storm cloudbeast on the top deck by 'communicating' with another cloudbeast. Next, she used a flute to command a few metal crabs to pick up the food waste scattered about the kitchen (Beanstalk insists that her crabs had always known how to do this). Finally, she even attempted to bring a couple of slumberfeet to help insomnia patients get to sleep, only to fall asleep herself in the hallway instead. From this, we cannot completely rule out the possibility that she does actually have some sort of strange ability.\nAccording to herself, there was this one time when she was five years old that she got lost and went outside the city. The farmers couldn't find her anywhere, and just as everyone was at wit's end, an old stockbeast waded across the river with her sitting on its back. Ever since, she has been very close to stockbeasts, and over time she found she was able to understand the 'words' of all kinds of animals. The stockbeasts would tell her which orchard had the sweetest fruits, the traveling fowlbeasts would tell her that the flowers were in full bloom in the south, etc. When Grain Buds speaks vividly about the colorful land filled with wonder in her childlike tone, she is always able to pique the curiosity of her listeners.\n'How did the stockbeast know the way back?'\n'How wide was the river?'\n'What's a city full of farms like?'\nThe listeners gather around her and bombard her with questions. She seems to have an endless number of amazing stories to tell as well. For example, there was the 'gang war' between stockbeasts, the stockbeast and fowlbeast who befriended each other and ran away together, the fin who swam all across Yan on an adventure... Does it matter if they're true? Just imagining the countryside depicted in her stories is enough to stir one's emotions.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Aside from her ability to talk to animals, Grain Buds is most proud of her flute skills.\nShe would proudly tell others how she performed for Dahuang's operas year after year. With her small bamboo flute, she is able to play a variety of distinct melodies, from grand accompaniments pairing with the operas' epic scenes, to melodious tunes to send resting stockbeasts peacefully to sleep. Everyone who has heard her flute has been astonished to see such a seemingly frail girl exert so much energy in one go. She is always happy to use her flute to bring comfort to those around her, and she also loves to, in her own words, 'write' new melodies according to her mood. Her tunes are all uplifting and pleasing to the ear, and He Sheng occasionally writes lyrics to them. The farmers toiling in the fields would always sing along whenever they heard the music. And just like that, the two of them created a number of childlike folk songs that spread throughout Dahuang.\nIn her hazy memories, she once heard her mother playing a reed whistle, but her 'Tianshi duties' took her away from Dahuang before she could teach her daughter how to make one. Later, she learned how to make the whistles herself as well as how to play the bamboo flute. The girl learned to play more and more music, yet her parents never returned. To this day, her melodious flute can still be heard by Dahuang's riverbank, awaiting the return of faraway travelers.\n\n[Classified Log]\n'...Therefore, a Chamber of Heaven's Designs shall be established roughly a hundred <i>li</i> to the north of Dahuang in preparation for the demonic threat.'\n'...Its forces shall consist of those gifted in Originium Arts as selected by each Tianshi Bureau. Those who enter the Chamber of Heaven's Designs, each possessing great skills and a firm resolve, shall train at length and be ready for battle at all times. After a year, only half shall remain. After another year, less than one-tenth shall remain. This shall continue year after year.'\n'The scourge of the demon first and foremost robs one of his mind, and by the time one finds his mind even slightly clouded, it is already too late. Countless have been buried in the north to ensure the survival of their fellows. Relatively few instead live out their years with their minds clouded, rendered incapable of coherent speech for the rest of their lives. Skeletally thin, not even their old acquaintances can recognize them...'\n—Excerpts pertaining to Dahuang, from a history of Yan requiring a very high clearance level",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "To those who live on these lands, the word 'homeland' is a transient concept.\nNo one knows when their home will be destroyed by Catastrophe. Nomadic cities travel everywhere, and villages continue to migrate ceaselessly. What exactly is a 'homeland'? Is it the skyscrapers going up day after day in the nomadic cities, or is it the rubble left behind in the Catastrophes' wake?\nYet there are still those who, regardless of the price, have continued to guard a swath of land important to them for thousands of years. Such a long-lasting defense of the same area is extraordinarily rare.\nSuch is the place where Grain Buds was born and raised. Having seen all the fields and the men and women working them from a young age, she knows every blade of grass and every tree like the back of her hand; she remembers every crop in every field; she remembers which grasses each kind of stockbeast likes to eat; she remembers how she once fell from a tree and hurt her leg, and He Sheng carried her home on his back across half of Dahuang under the setting sun... The land incorporates the history and memories of the people here, and it becomes part of them. That's how the people and the land are connected.\nWhich is why she too is holding the fort here, watching the crops grow green and then yellow, before they are harvested and new seeds are sown anew. She watches the fields grow larger and larger, as the stockbeasts around her grow bit by bit. She sits atop a stockbeast's back, playing her flute to guide the passing caravans as well as sending travelers from afar on their way.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'Grain... Buds.'\nThe stockbeast-herding girl sits atop a pile of straw and slowly reads out her name. 'The Xiangzhang said my parents gave me this name. Grain Buds are what you call the seeds when they're starting to turn full but haven't completely ripened yet. It means I'll be healthy and grow up teeming with hope!'\nThe woodcutter, still with somewhat lifeless-looking eyes, sits unsteadily on the pile of straw as well. His back is stiff and straight, his legs appear uncomfortable, and he holds tightly onto his Tianshi ruler. Evidently, the girl had dragged him here.\n'Give me your hand. I'll write my name. You just read along!'\nThe man's coarse, thick fingers were pried open by the young girl's small hand to reveal his palm. She stuck out a finger and started writing. The woodcutter thought it was ticklish. He did as the girl said and opened his mouth to laboriously let out some sounds.\n'Grain...'\n'Grain— Buds.'\n'Gra... Grain... Grain— Buds.'\n'Yep, that's right! Put them together like that. Grain— Buds. My name!'\n'Grain... Grain Buds.'\nThe woodcutter lowered his head and gently moved his lips.\n'Grain Buds.'\nThe girl leapt in joy, her whole head covered with straw. 'Mute Uncle! You can say my name!'",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1008,
      "atk": 435,
      "def": 84,
      "magicResistance": 20,
      "blockCnt": 1,
      "baseAttackTime": 1.9,
      "respawnTime": 70,
      "cost": 15
    }
  },
  "skins": [
    {
      "skinId": "char_4122_grabds#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_4122_grabds",
      "portraitId": "char_4122_grabds_1",
      "illustId": "illust_char_4122_grabds_1",
      "modelName": "Grain Buds",
      "drawerList": [
        "YUJI"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_4122_grabds#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_4122_grabds_2",
      "portraitId": "char_4122_grabds_2",
      "illustId": "illust_char_4122_grabds_2",
      "modelName": "Grain Buds",
      "drawerList": [
        "YUJI"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_4122_grabds@yun#3",
      "skinName": "Fragrant Pace",
      "skinGroupName": "0011/Yun/III",
      "skinGroupId": "2024#yun#2",
      "avatarId": "char_4122_grabds_yun#3",
      "portraitId": "char_4122_grabds_yun#3",
      "illustId": "illust_char_4122_grabds_yun#3",
      "modelName": "Grain Buds",
      "drawerList": [
        "YUJI"
      ],
      "description": "<color name=#ffffff>0011 Yun Series/Fragrant Pace. A jacket and skirt woven by Dahuang's weavers for the festivities, gifted to Grain Buds to wear as she wanders the fields. Around her, the wonders of nature. By her side, fine friends to be sure.</color>",
      "rarity": 76
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "y-2",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 589,
            "atk": 221,
            "def": 45,
            "magicResistance": 10,
            "cost": 13,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 796,
            "atk": 326,
            "def": 65,
            "magicResistance": 10,
            "cost": 13,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 70,
      "rangeId": "y-2",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 796,
            "atk": 326,
            "def": 65,
            "magicResistance": 15,
            "cost": 15,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 1008,
            "atk": 435,
            "def": 84,
            "magicResistance": 15,
            "cost": 15,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3271",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30052",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30032",
          "count": 3,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 80,
      "rangeId": "y-2",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1008,
            "atk": 435,
            "def": 84,
            "magicResistance": 20,
            "cost": 15,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1260,
            "atk": 525,
            "def": 100,
            "magicResistance": 20,
            "cost": 15,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3273",
          "count": 3,
          "type": "MATERIAL"
        },
        {
          "id": "31034",
          "count": 7,
          "type": "MATERIAL"
        },
        {
          "id": "31053",
          "count": 11,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_grabds_1",
      "skillName": "Flute Flutter",
      "desc": "The next attack deals <@ba.vup>{atk_scale:0%}</> ATK as Arts damage, and attacks an additional enemy\n<@ba.rem>Can store {ct} charge(s)</>",
      "iconId": "skchr_grabds_1",
      "spCost": 5,
      "initSp": 0,
      "duration": -1,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 2.1
        },
        {
          "key": "ct",
          "value": 3
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30023",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31084",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_grabds_2",
      "skillName": "Hometown Lullaby",
      "desc": "Stops attacking and puts <@ba.vup>{max_target}</> enemies within Attack Range to <$ba.sleep>Sleep</> for <@ba.vup>{sleep}</>s. Afterwards, ASPD <@ba.vup>+{attack_speed}</>, and attacks <@ba.vup>{max_target}</> enemies",
      "iconId": "skchr_grabds_2",
      "spCost": 25,
      "initSp": 15,
      "duration": 15,
      "blackboard": [
        {
          "key": "max_target",
          "value": 3
        },
        {
          "key": "sleep",
          "value": 5
        },
        {
          "key": "attack_speed",
          "value": 130
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 2,
              "type": "MATERIAL"
            },
            {
              "id": "30073",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_grabds",
      "moduleName": "Grain Buds' Badge",
      "desc": "Operator Grain Buds has demonstrated a remarkable aptitude for impeding the enemy.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Supporter Operator during field operations to exercise Decel Binder responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_grabds",
      "moduleName": "On the Field",
      "desc": "May 10th\nIt feels like I'm going in circles. These so-called 'social activities' keep dragging me back to Dahuang. Not only does the weather not suit me, I can barely understand their accent, and I heard that their pickled vegetables are super super salty! I don't know how I'm going to make it an entire year.\nAs I expected, nothing's gone right since I arrived. I thought I could at least talk to people, but I keep tripping over my own tongue. Not only can nobody understand a word I say, but the stockbeasts keep running away from me!\n\nMay 21st\nI've run into a strange young girl, standing tiptoe atop the backs of the stockbeasts. She jumped around on top of them, and at first glance you'd think she was a fowlbeast that had fallen into the herd. There I was, one leg sunk deep in the mud while my other foot is barely covered, trudging through the muck, when she started laughing at me.\n'Sillyhead!', she said.\nMe...?\n'Take off your shoes!'\nEh?\n'I'll teach you how to walk on top of the stockbeasts so you don't have to go through the mud.'\nI got thrown off the stockbeasts' backs eight times that day, and I'm sure I ate more mud than rice by dinner time. She thumped me across my back, her plumage flapping about as she laughed. Though my luck may be bad, looking at her smiling face makes me feel that there's nothing that can hold me down for long.\n\nJuly 8th\nThat girl was crouching down by the stockbeast pen this time, swaying her head as she played her flute to the herd.\n'Hey, Claypot! Come, quick!'\nWho...?\n'You're new here, right Claypot? I forgot to tell you last time, but my name's Grain Buds!'\nOh, was she talking to me?\n'Do you want to learn how to talk to stockbeasts? I'd say I'm better at it than anyone in all of Yan!'\nShe held my face in one hand, while holding a stockbeast's in the other, and told us to look into each other's eyes. That day might be the first time I realized a stockbeast's bright, intelligent eyes possess the same basic range of emotions as any man. Since then, the stockbeasts really did stop running away from the sound of my voice. I never expected someone like me—who's always getting chased and nipped by tuskbeasts—to suddenly have a group of animal friends.\n\nOctober 4th\nI was out searching for Grain Buds when I ran into her along with another youth who appeared to be a schoolboy. They were playing some odd game where they threw small pieces of bone.\n'Claypot! Come play with us!'\nOh, alright...\n'He's 'Big Buffalo', have you two not met before?'\nI'm afraid not...\n'These were left over from Shu's stew! I don't really know all the rules myself, so you'll have to explain, Big Buffalo!'\nI had no idea that you could turn stockbeast leg bones into toys. A shame I was so clumsy, though. I couldn't catch the bones for quite a long while, and kept accidentally flinging them at their heads instead. Big Buffalo was a nice guy. Didn't talk much, just like me. However, every time he went off to work, he wanted to bring me along. Sometimes Grain Buds would lie down on a stockbeast's back, or hang from a tree. Sometimes she would help us out with work, and other times she would drag us off to play. Out here in the boundless fields, it almost felt like we were a family.\n\nMay 20th\nAs I was leaving Dahuang by car, a group of stockbeasts wandering the fields walked past. Looking at their chubby figures fade into the distance behind us, I suddenly began to feel uneasy, just like I did a year ago when I left home by myself to come to Dahuang. Setting aside not being able to see Dahuang's fields and stockbeasts any longer, would I be able to find friends as good as Grain Buds and Big Buffalo at school? I don't know how I'm going to make it through the next two school years."
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "I looked after the stockbeasts in Dahuang, so I'm looking after you here, of course. You'll have to listen to me, work hard, and rest on time. Let's see... It's rest time now. Let's head out and have some fun!",
      "voiceAsset": "char_4122_grabds/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Of course I know what the stockbeasts are saying. The beastlings in Dahuang always talk to me about things like what kind of snacks they want or who they like, and I sneak them a little help. This apple? A stockbeast asked for it, obviously. I'm just tasting it for them, making sure it's sweet enough.",
      "voiceAsset": "char_4122_grabds/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Zuo Le is Candlestick, the Record Keeper is Inkbrush, that blinged out guy is Megaphone, and you're Wisehead. I also know a Tall Shades and Smiley Sharpshooter! Oh, and Amiya is the best! We made a promise to come up with a better nickname for you together.",
      "voiceAsset": "char_4122_grabds/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Shu made me this fowlbeast whistle, and whenever I wanna tell the stockbeasts to go home, I give it a blow. Sometimes, when Dahuang feels empty, I sit down on the street corner to play it. People come and go, and my whistle's my goodbye and hello.",
      "voiceAsset": "char_4122_grabds/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "Dahuang's operas are sung in different dialects. That commemorates the farmers who came to our rescue a few centuries ago. They were from all across Yan, farming here for generations. They're why Dahuang fields are so fertile and prosperous now. I'm really proud that I can play the accompaniment on my flute here every year!",
      "voiceAsset": "char_4122_grabds/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "When I first stood on the terraces, I could only see the aqueducts, but after the farmlands were raised, I could see the edge of the city, and now that Shu brought me here, I can see the horizon from the top deck. Megaphone tells me that Baba and Mama will come back someday, but when, exactly?",
      "voiceAsset": "char_4122_grabds/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Could you draw a line over my head...? I'm not standing on my tiptoes! I'm not stretching my neck out, either! Are you done? Let's see. See? I told you I got taller! Maybe I'll be taller than Xiaohe next year! Let's see how tall you are. Minus your hood and shoes, you... come up to my shoulders!",
      "voiceAsset": "char_4122_grabds/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "When I'm in a bad mood, I sometimes go to the embankment to play my flute. There's a woodcutter there who yelled at me every time, but he always quieted down as soon as I played this song. He even hummed along. That was the first time I saw him smile! Like I said, I'm really good at the flute.",
      "voiceAsset": "char_4122_grabds/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "The farmers say that the stockbeasts live by following water and grass. Fowlbeasts fly freely in the sky, but they always eventually land in the fields. I know what that means now.  Everyone has a field to call their own. Rhodes Island is your field, and you are the fowlbeast that will come back to land, isn't that right?",
      "voiceAsset": "char_4122_grabds/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Hm... You fell asleep...? You really fell asleep...? Hehe, have this coat then. Have a good dream. I'm off to have some fun!",
      "voiceAsset": "char_4122_grabds/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Shu brought me here to hang! I think I wrote my name on a document she was supposed to sign...? She said it was fine, though. Now that I've signed it, I get to come here to hang out all the time!",
      "voiceAsset": "char_4122_grabds/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "...Wah! I'd never fall asleep in class, Laoshi...! Huh? It's you.",
      "voiceAsset": "char_4122_grabds/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "I developed a way to train stockbeasts to identify foods based on their smell. The Tianshi Bureaus gave me a medal for it. It doesn't have a serial number, but it says how amazing I am! And now I have this one you gave me. I'm putting them next to each other.",
      "voiceAsset": "char_4122_grabds/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "I got taller again, right? By the time I'm as tall as you, the people of Dahuang will definitely have cultivated the seeds they want. When that happens, I'll invite you to come sit with us in the fields. The rice flowers are gonna look even better then!",
      "voiceAsset": "char_4122_grabds/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Is it time to do pest control again? I'm the best at catching these nasty little things!",
      "voiceAsset": "char_4122_grabds/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Trust me. I know I can do it extra good.",
      "voiceAsset": "char_4122_grabds/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Listen up, get your boots on, and tread lightly!",
      "voiceAsset": "char_4122_grabds/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Everybody ready?",
      "voiceAsset": "char_4122_grabds/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Qui-Qui-Quick! The pests are getting away.",
      "voiceAsset": "char_4122_grabds/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "I saw them hiding in the bushes there!",
      "voiceAsset": "char_4122_grabds/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Nice. They didn't see us.",
      "voiceAsset": "char_4122_grabds/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "None of you are getting away this time!",
      "voiceAsset": "char_4122_grabds/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Hah, I got you!",
      "voiceAsset": "char_4122_grabds/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Come any closer, and I'll whap your heads with my flute!",
      "voiceAsset": "char_4122_grabds/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Not so fast now, huh!",
      "voiceAsset": "char_4122_grabds/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "And don't ever come back to our fields!",
      "voiceAsset": "char_4122_grabds/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Come on, let's go! We need to hurry and tell Shu. She's going to be so happy with me.",
      "voiceAsset": "char_4122_grabds/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Next year, the year after, and the year after that... One day, the whole of Dahuang will live without fear of Catastrophes or pests, and we'll have stack our harvests as high as Heaven for Shennong.",
      "voiceAsset": "char_4122_grabds/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "It's okay. We've been through Catastrophes much worse than this. This one's just a little setback. We'll work harder next season!",
      "voiceAsset": "char_4122_grabds/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "We're in trouble... I'll go get the Tianshi to help us!",
      "voiceAsset": "char_4122_grabds/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "I want to sneak out when the landship docks. Can you keep it from Shu?",
      "voiceAsset": "char_4122_grabds/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "These buns aren't for you to grab!",
      "voiceAsset": "char_4122_grabds/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Have you learned to play the song I taught you?",
      "voiceAsset": "char_4122_grabds/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_4122_grabds/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Here. A multigrain fragrance sachet! It's made by blending some grains and medicinal herbs. Keep it on you, and you're guaranteed peace and good health for the rest of the year. And you should definitely have a bowl of multigrain rice with multigrain beer. The farmers always tell me how good the multigrain beer tastes, but when I took a sip—It was so spicy and bitter!",
      "voiceAsset": "char_4122_grabds/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "I have the basket ready. Should we head to the fields to catch mudfins together?",
      "voiceAsset": "char_4122_grabds/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "I made you a bowl of noodles. Give it a try. I remember when I was still a kid, Shu always made me a bowl of longevity noodles for my birthday. An entire bowl made up of a single noodle. She always added a fried egg over easy too. I think this one might be overcooked, though. It might... have turned into a bowl of gruel.",
      "voiceAsset": "char_4122_grabds/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "I saw Rhodes Island splitting the sandstorm and sailing here. It felt just like the first time I saw Dahuang protecting the fields and overcoming the Catastrophe with its newly-built buildings. As long as everyone works together, no matter if it's a Catastrophe or anything else, there's always a way, right?",
      "voiceAsset": "char_4122_grabds/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "dorm_rec_single[1010]",
      "buffName": "Thoughtfulness",
      "desc": "When this Operator is assigned to a Dormitory, restores <@cc.vup>+0.55</> Morale per hour to another Operator assigned to that Dormitory whose Morale is not full (Only the strongest effect of this type takes place)",
      "skillIcon": "bskill_dorm_single1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "dorm_rec_all[025]",
      "buffName": "Rural Flute",
      "desc": "When this Operator is assigned to a Dormitory, restores <@cc.vup>+0.15</> Morale per hour to all Operators assigned to that Dormitory (Only the strongest effect of this type takes place)",
      "skillIcon": "bskill_dorm_all2",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}