{
  "id": "char_367_swllow",
  "meta_info": {
    "name": "GreyThroat",
    "appellation": " ",
    "voiceActor": {
      "en": "Risa Mei",
      "jp": "Misato Fukuen",
      "kr": "Min Ah",
      "cn": "Yuan Weng"
    },
    "rarity": 5,
    "profession": "Sniper",
    "subProfessionId": "Marksman",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "DPS"
    ],
    "nationId": "Rhodes Island",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] GreyThroat\n[Gender] Female\n[Combat Experience] 3 years\n[Place of Birth] Undisclosed\n[Date of Birth] Nov 14\n[Race] Liberi\n[Height] 162cm\n[Infection Status] \nConfirmed uninfected by medical examination.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Standard\n[Mobility] Excellent\n[Physical Resilience] Normal\n[Tactical Acumen] Standard\n[Combat Skill] Excellent\n[Originium Arts Assimilation] Normal",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Operator GreyThroat, despite only receiving her codename recently, has actually been part of Rhodes Island for much longer than the time she's served as an Operator. Her parents were formerly Oripathy researchers who traveled around. Her mother entrusted GreyThroat to Rhodes Island before disappearing. Now, she has passed the Operator assessment and is a member of Rhodes Island's operation team.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there are no other signs of infection. At this time, this operator can be confirmed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator GreyThroat shows no signs of Oripathy infection.\n\n[Blood Originium-Crystal Density] 0.11u/L\nOperator GreyThroat has limited exposure to Originium, and undertakes complete protective measures when potentially coming in contact with Originium in her line of work.\n\nWhen compiling this report, unusual folds were found on the Operator's previous medical examination report. Presumably, the Operator clenched the report upon receiving it, which in and of itself is not a big deal. In the future, however, you should pay attention to the mental health of the Operator. --Medical Group Remarks",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "GreyThroat's parents were both excellent Oripathy researchers and had some academic cooperation with some of Rhodes Island's medic operators. However, after a certain point, her father disappeared completely, and not long afterwards, her mother brought the young GreyThroat to Rhodes Island. She too disappeared after leaving her daughter behind. Her mental condition seemed to be extremely distressed as she left Rhodes Island. Though a messenger was later sent to try to get in contact with her, our efforts were akin to chasing a ghost.\nGreyThroat, at the time she first arrived at Rhodes Island, had a series of worrisome issues, most notably her resentment towards Originium and Oripathy. She didn't even try to hide her hate towards the Infected. At first, the Operator entrusted with taking care of her did not take her mental state to be a serious issue, given that she was still young and might be overwhelmed by her experiences. However, I must admit that the seeds of GreyThroat's subsequent problematic development, as well as the many conflicts she would later cause, were planted during this time long ago. \n\n(Note: The radical words used in the original file involving discrimination and hate have been redacted, and the Doctor may only refer to this file.)",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "When Rhodes Island discovered the cause of death of GreyThroat's father, several months had already passed. During this time, GreyThroat remained isolated, trying to avoid contact with the various personnel within Rhodes Island. Someone once witnessed GreyThroat scraping at her own arm with a piece of industrial sandpaper, and was not discovered by staff until her arm had been turned into a bloody mess. The reason was because GreyThroat accidentally touched some Originium-based devices.\nWhile GreyThroat has not taken any radical behavior towards Infected persons, her actions have been a source of discontentment among many younger operators. The ostracized GreyThroat of course takes no issue with this fact, and continues to lead a relatively solitary life in Rhodes Island.\nThe only exception is Amiya, one of the few people she is willing to communicate with. Perhaps due to being separated from her family at a young age, her desire to speak with a peer for support sometimes even eclipses her prejudices. However, even when she is in the same room with Amiya, she carefully maintains her distance, exhibiting mild PTSD at the very beginning. At Amiya's suggestion, and in return for adoption into Rhodes Island, GreyThroat began training for the Operator assessment and learned to use bows and crossbows. Some were skeptical, claiming that it was just an excuse for GreyThroat to leave Rhodes Island, or even try to defect, but Amiya quickly put a halt to this, as well as other unfounded rumors.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "After officially passing the Operator assessment exam, GreyThroat acquired her codename. Even those who are vocally opposed to her conduct cannot deny her combat performance. On the battlefield, GreyThroat is far keener than Operators who have served for a similar length of time, her excellent dynamic vision compensating for her lack of marksmanship experience.\nHowever, can a Rhodes Island Operator shoulder her duties while being so hostile and disgusted towards the Infected? In order to address the concerns of others, Amiya personally took the initiative to put GreyThroat on her operation team, and successfully carried out several missions.\nSome people may be hard to change, but many hoped that Amiya would be able to gradually influence this somewhat abrasive girl. But, reality would once again surprise everyone. After a long and harrowing rescue mission, GreyThroat changed dramatically overnight. She began to learn to talk to the Infected, though she still would often touch upon topics that are typically off-limits for the Infected. Her tone was cold, and sometimes even full of barbs, but her frankness began to soften the hearts of many.\nVery few people know about what exactly transpired on that mission, with Amiya and GreyThroat both seldom mentioning it. What is certain, is that GreyThroat is no longer blinded by a myopic hatred. However, is her heart actually free from the shackles of hate? It is not that simple. People who seem to easily let go of a deep-rooted hatred are not trustworthy. After each physical examination following her return for a mission, GreyThroat repeatedly confirms her blood originium-crystal density, accompanied by a near-suffocating fear and subsequent relief, perhaps a reflection of the guilt and ensuing sorrow. GreyThroat still often wakes up with nightmares, and rarely has an opportunity to sleep, whether on a mission or in the Rhodes Island dormitories.\nGreyThroat is still her old self, not like Amiya, not like anyone else. But she will still fight for Rhodes Island, and nobody doubts this anymore.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'Scared? Of course. How could I not be scared?'\n'When my father let go of my hand and was swallowed up by the crowd, I never saw him again. At that time, I didn't dare look directly at my mother, and only felt the heat draining from her hand. I didn't understand what happened, why the patients we rescued turned into rioters overnight. Not until I saw my Infected friend, a greasy wrench in hand, vandalizing the street... like a lunatic. Even today, I sometimes still see her expression. What does that mean? I'm not sure.'\n'From then on, I couldn't stay calm when talking to Infected people. Since I probably don't need to hide anything from you, Doctor, I'll be frank. In the worst cases, I felt like vomiting. Amiya is the exception though. I really appreciate her. Oh, but don't tell her I said that.'\n'But, I've also seen the Infected across this world. The hungry woman using her own blood to nourish a ghastly, malnourished child, exiled to the scorched soil of the barrens, or admitted to some 'clinic' in name only to die. With no treatment and no food, they eat the soil at the base of the walls, surrounded by the inorganic, petrified bodies of those whose ridiculous lives have long expired. And what is on the other side of that wall? A peaceful, prosperous nomadic city devoid of hunger.'\n'I have seen the exiled Infected rescue travelers, and I have also witnessed traveling doctors who help these Infected crushed by terror. After becoming an Operator, I have also become involved, trying to help those who have not joined a nomadic city-state avoid Catastrophes. One incident still is fresh on my mind. One time, in the face of a flood, Infected villagers held back the water with their own flesh, buying just enough time for the evacuation. And so those Infected gave their lives, their bodies now floating on top of the water, but nobody cares. Do you know how the villagers view these heroes? With disgust. Whether they hate these people or the Originium crystals on their skin, I cannot say.'\n'And why is this happening? Amiya told me before, because everyone is a living person. Everyone wants to live, and has the right to survive.'\n'Did you know? When Amiya said these words, she did not look like a young girl at all. But I am not the same as her, and there is inevitably a difference between the Infected and non-Infected. I just want to find the balance between the Infected and the people we were born to be, for those around me, for who I am inside. Nothing more, Doctor.'\n\n --GreyThroat's conversation record with the Doctor after a certain medical examination. The recorder believes that this conversation will help the Infected understand GreyThroat, and with GreyThroat's tacit consent, this recording was added to her personal files.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Maybe GreyThroat hasn't realized it yet, but in fact, everyone's impression towards her has changed recently. Though she still tries to avoid contact with the Infected most of the time, one Infected operator recalled an episode in which he had fallen into a trap on a mission due to his own error and was serious injured only to be immediately rescued by GreyThroat, who had been covering them from the jungle. Afterwards, the operator who was most known for her disgust towards the Infected was administering emergency treatments for him, her face contorted and arms trembling as she saved his life. He will never forget GreyThroat's expression as she fought to contain her all-too-visible trembling. At that time, he did not feel discriminated against, and suddenly came to understand GreyThroat.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1224,
      "atk": 420,
      "def": 128,
      "magicResistance": 0,
      "blockCnt": 1,
      "baseAttackTime": 1,
      "respawnTime": 70,
      "cost": 13
    }
  },
  "skins": [
    {
      "skinId": "char_367_swllow#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_367_swllow",
      "portraitId": "char_367_swllow_1",
      "illustId": "illust_char_367_swllow_1",
      "modelName": "GreyThroat",
      "drawerList": [
        "m9nokuro"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_367_swllow#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_367_swllow_2",
      "portraitId": "char_367_swllow_2",
      "illustId": "illust_char_367_swllow_2",
      "modelName": "GreyThroat",
      "drawerList": [
        "m9nokuro"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_367_swllow@boc#1",
      "skinName": "Homecoming",
      "skinGroupName": "Bloodline of Combat/I",
      "skinGroupId": "2020#boc",
      "avatarId": "char_367_swllow_boc#1",
      "portraitId": "char_367_swllow_boc#1",
      "illustId": "illust_char_367_swllow_boc#1",
      "modelName": "GreyThroat",
      "drawerList": [
        "m9nokuro"
      ],
      "description": "<color name=#ffffff>Bloodline of Combat Collection/Homecoming. The outfit worn by Operator GreyThroat while participating in a rescue operation for the Infected within the Catastrophe zone of Sugar City. Disregarding protection or camouflage, upon this outfit is etched the will to protect the next person, and save another life.</color>",
      "rarity": 135
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "3-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 667,
            "atk": 173,
            "def": 53,
            "magicResistance": 0,
            "cost": 11,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 954,
            "atk": 289,
            "def": 89,
            "magicResistance": 0,
            "cost": 11,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 70,
      "rangeId": "3-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 954,
            "atk": 289,
            "def": 89,
            "magicResistance": 0,
            "cost": 13,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 1224,
            "atk": 420,
            "def": 128,
            "magicResistance": 0,
            "cost": 13,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3241",
          "count": 4,
          "type": "MATERIAL",
          "name": "Sniper Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_SNP1"
        },
        {
          "id": "30012",
          "count": 7,
          "type": "MATERIAL",
          "name": "Orirock Cube",
          "rarity": 2,
          "iconId": "MTL_SL_G2"
        },
        {
          "id": "30042",
          "count": 3,
          "type": "MATERIAL",
          "name": "Oriron",
          "rarity": 2,
          "iconId": "MTL_SL_IRON2"
        }
      ]
    },
    {
      "maxLevel": 80,
      "rangeId": "3-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1224,
            "atk": 420,
            "def": 128,
            "magicResistance": 0,
            "cost": 13,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1493,
            "atk": 513,
            "def": 152,
            "magicResistance": 0,
            "cost": 13,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3243",
          "count": 3,
          "type": "MATERIAL",
          "name": "Sniper Dualchip",
          "rarity": 5,
          "iconId": "MTL_ASC_SNP3"
        },
        {
          "id": "30044",
          "count": 7,
          "type": "MATERIAL",
          "name": "Oriron Block",
          "rarity": 4,
          "iconId": "MTL_SL_IRON4"
        },
        {
          "id": "30063",
          "count": 9,
          "type": "MATERIAL",
          "name": "Integrated Device",
          "rarity": 3,
          "iconId": "MTL_SL_BOSS3"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_swllow_1",
      "skillName": "Flying Feathers",
      "desc": "The next attack shoots <@ba.vup>2</> times, each shot dealing <@ba.vup>{atk_scale:0%}</> ATK as physical damage\n<@ba.rem>Can store up to {cnt} charges</>",
      "iconId": "skchr_swllow_1",
      "spCost": 4,
      "initSp": 0,
      "duration": 0,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 1.4
        },
        {
          "key": "cnt",
          "value": 3
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 2,
              "type": "MATERIAL"
            },
            {
              "id": "30043",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_swllow_2",
      "skillName": "Counterflow",
      "desc": "ATK <@ba.vup>+{atk:0%}</>, attacks <@ba.vup>3</> times consecutively",
      "iconId": "skchr_swllow_2",
      "spCost": 30,
      "initSp": 15,
      "duration": 20,
      "blackboard": [
        {
          "key": "atk",
          "value": 0.4
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30053",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_swllow",
      "moduleName": "GreyThroat's Badge",
      "desc": "Operator GreyThroat has demonstrated a remarkable aptitude for maintaining distance whilst conducting suppressive fire against the enemy.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Sniper Operator during field operations to exercise Marksman responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_swllow",
      "moduleName": "Reflection of a Mother's Love",
      "desc": "She comes to in the corridor where she played as a child. She remembers; her father's working very late today. She's waiting in the corridor for him. The sunset clouds are chased in by autumn winds, and in this country town where no high-rise nor skyscraper stands, time's gifts are ever there to be seized at the first moments. Quietly, she pushes her father's door open and sees his stern expression—something has happened, her child's instincts say.\nShe comes to in the crook of her mother's arm. She remembers; she is nine now. She should be celebrating her birthday with her friends, sharing the cake. There should be candles aflame, yet the town burns. She sees her mother's face; in the instant she notices her daughter's gaze, the enmity and apprehension is hidden away behind the moon. The night is deep and dark, and her mother tells her it'll all be alright.\nShe comes to in a tent in the barrens. She remembers; this is their third month on the run. The incident in town seemed to serve as an excuse for all the other relatives to shun the mother and daughter. Her faith in and dependence on others left her in the sound of a single crash. She hasn't seen her father for so long now. She dearly wishes to cry and cry, and so she hugs her mother, but droplets hit the floor before she's even begun to weep.\nShe comes to beneath an unfamiliar carport. She remembers; her tenth birthday is very soon. Surrounding her are adults as frigid as ice, one by one forcing out a smile. She is a smart child, and knows these people mean well, but she's only a child all the same. The adults tell her that her mother is entrusting her to Rhodes Island. Her mother has left, like a cloud.\nShe comes to in brand-new bedding. She remembers; her arm is filled with bruising. She used a stolen sheet of sandpaper to rub at her once-smooth skin, hounding the flesh as though it'd atone. It hurts, and she dares not continue, but the moment she thinks of the black crystals, her throat is in the death grip of an all-choking emotion. She wants to vomit. She can't. She hasn't eaten in so very, very long.\nShe comes to the boom of floodwater. She remembers; Amiya and the Infected are still below. Those nameless heroes are resisting a mere Catastrophe. She lifts her head, and as the elements batter all, it suddenly strikes her that suffering is not a matter of great or small, and nor is hope. She throws herself down. Amiya must be alright, at the very least. She hears those behind her howling in fear. She hears them. Infected are drowning here, they say; when the flood recedes, will their water sources be polluted?\nShe comes to beneath a sunset as red as fire. She remembers; she saved a great many at Sugar City, a great many more than she could know. Her mother comes to mind. All at once, she feels sad, yet smiles. She understands her father, but still hasn't been able to find her mother. Can she find her? Will she ever? As the thought strikes her, she has a mild headache, but feels unusually unburdened.\nShe turns her head, and gives the great Feline as badly wounded as her a tremendous chewing-out. 'Blaze! Can't you wake me up any other way?!'"
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "Fine. At least I can get a break from the dusty air outside, if I stay here with you.",
      "voiceAsset": "char_367_swllow/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "I don't shy away from sensitive discussions about the Infected? That's true. They're obviously different from us. But they also have the right to seize hope, just like us. So they don't need me to do anything special for them. That's equality, isn't it?",
      "voiceAsset": "char_367_swllow/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Blaze is too reckless sometimes. I know she's strong, but… What? You know how to handle her?  Forget it, I'll ask Amiya what I should do to get along with her after we get back.",
      "voiceAsset": "char_367_swllow/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "I was just speaking objectively. If you don't want to be discriminated against, then you shouldn't expect special treatment... What, she went back to her room crying? Look, I feel a little bad about it, but is someone that fragile really operator material?",
      "voiceAsset": "char_367_swllow/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "Rhodes Island is changing, Doctor. Maybe you don't feel it, since you're the reason it's changing, and not everyone is so annoyingly outspoken as I am. Anyway, I do appreciate the direction Rhodes Island is moving.",
      "voiceAsset": "char_367_swllow/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "I used to prefer long-distance missions, like I was running away from Rhodes Island. I'll admit that was a little ungrateful, considering Rhodes Island adopted me. But now? Hehe, if you still have operators who like splattering blood all over the place, maybe I'll apply to serve in some faraway place again.",
      "voiceAsset": "char_367_swllow/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Doctor, would you sometimes feel afraid? Catastrophes, Originium, Oripathy, and the Infected? Hm, I'm still plagued by nightmares even now. But these days, I have Amiya, and idiots like that Blaze. I guess I'm not as afraid as I used to be.",
      "voiceAsset": "char_367_swllow/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Why are you called 'Doctor?' No, I'm not trying to get you to remember anything, it's just that title makes me very... wistful. Looking at all the Infected around you... Brings to mind a little bit of the past.",
      "voiceAsset": "char_367_swllow/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "I've known the whole time. When my mother brought me to Rhodes Island, she'd already lost her mind. I didn't feel the pain her inner conflicts caused her, but I can relate to it, because I relied on that obsession to get me to where I am today. Only now, I've found a new direction... I want to find her, and I want to save her.",
      "voiceAsset": "char_367_swllow/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "You shoulder the future of Rhodes Island. And with the burden of that responsibility, you can't be so lackadaisical.",
      "voiceAsset": "char_367_swllow/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "So you're the Doctor? Amiya told me about you. I'm GreyThroat. Please don't disappoint me.",
      "voiceAsset": "char_367_swllow/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "For efficiency's sake, speed up the playback. I'll still be able to see it all clearly.",
      "voiceAsset": "char_367_swllow/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "Even now, I'm still on bad terms with a handful of operators. My promotion might spark controversy, just a reminder.",
      "voiceAsset": "char_367_swllow/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "Whether Infected or not, we all choose to walk upon this land of our own free will. And so we must all work hard to survive, right?",
      "voiceAsset": "char_367_swllow/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "I prefer working alone.",
      "voiceAsset": "char_367_swllow/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Whether or not they'll listen to my orders is another matter.",
      "voiceAsset": "char_367_swllow/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "A panoramic view of the battlefield.",
      "voiceAsset": "char_367_swllow/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "I just have to rout them, right?",
      "voiceAsset": "char_367_swllow/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "I'm here.",
      "voiceAsset": "char_367_swllow/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Too slow.",
      "voiceAsset": "char_367_swllow/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "I'll get going then.",
      "voiceAsset": "char_367_swllow/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Can the others keep up?",
      "voiceAsset": "char_367_swllow/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Such slow movements.",
      "voiceAsset": "char_367_swllow/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "I see them. Too bad they don't see me.",
      "voiceAsset": "char_367_swllow/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "I'm skilled enough to resolve this.",
      "voiceAsset": "char_367_swllow/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Don't worry, their sights are totally empty.",
      "voiceAsset": "char_367_swllow/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "We won't see many victories like this, since our power is limited.",
      "voiceAsset": "char_367_swllow/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "I have no talent to speak of. So as a crossbowman, I can't let an enemy within three meters. Not even a corpse.",
      "voiceAsset": "char_367_swllow/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "The medics should stay behind to tend the wounded. I will chase after them, considering I'm used to working alone anyway.",
      "voiceAsset": "char_367_swllow/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Watch your flanks. I'll cover our retreat.",
      "voiceAsset": "char_367_swllow/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "I've been here for years, but I rarely wander around inside…",
      "voiceAsset": "char_367_swllow/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Huh?!",
      "voiceAsset": "char_367_swllow/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Aren't you afraid of upsetting the Infected operators if they see you with me all the time?",
      "voiceAsset": "char_367_swllow/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_367_swllow/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Happy New Year, Dr.{@nickname}. Where's Amiya? She's setting up the party tonight with the others? Then I'll just wait here. Blaze is looking for me? Did she already see the gift I left on her desk? I—I'm worried she's going to say something cheesy again. I'm leaving.",
      "voiceAsset": "char_367_swllow/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Hello.",
      "voiceAsset": "char_367_swllow/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Dr.{@nickname}, this is my birthday present for you. Unfortunately, it's a little rough, since I used a little gap in time when the kitchen was free to make it. Though, a few operators did help me, and I think I rescued one of them before...",
      "voiceAsset": "char_367_swllow/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "You still have a lot to do, don't you? Blaze understands me because we fight together, but it's not as if any two people, or groups, who disagree will have a similar chance. I'm very lucky... which is why I need to be more responsible—until the day when we can all sleep soundly.",
      "voiceAsset": "char_367_swllow/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "control_mp_cost[005]",
      "buffName": "Necessary Responsibility",
      "desc": "When this Operator is assigned to the Control Center, increases Morale of all Operators in the Control Center by <@cc.vup>+0.05</> per hour.",
      "skillIcon": "bskill_ctrl_cost",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "dorm_rec_oneself[000]",
      "buffName": "Solitude",
      "desc": "When this Operator is assigned to a Dormitory, self Morale recovered <@cc.vup>+0.7</> per hour",
      "skillIcon": "bskill_dorm_one2",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}