{
  "id": "char_493_firwhl",
  "meta_info": {
    "name": "Firewhistle",
    "appellation": " ",
    "voiceActor": {
      "en": "Jennifer Losi",
      "jp": "Eriko Matsui",
      "kr": "Kim So-hee",
      "cn": "Luttefair"
    },
    "rarity": 5,
    "profession": "Defender",
    "subProfessionId": "Fortress",
    "position": "MELEE",
    "team": "",
    "tagList": [
      "DPS",
      "Defense"
    ],
    "nationId": "Rim Billiton",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Firewhistle\n[Gender] Female\n[Combat Experience] 5 Years\n[Place of Birth] Rim Billiton\n[Date of Birth] May 6\n[Race] Liberi\n[Height] 166cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Excellent\n[Mobility] Standard\n[Physical Resilience] Standard\n[Tactical Acumen] Excellent\n[Combat Skill] Standard\n[Originium Arts Assimilation] Normal",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Firewhistle, the owner of a small Rim Billiton PMC. As the representative of her company, she entered into a cooperative agreement with Rhodes Island and signed on as an operator to provide her services to Rhodes Island.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Firewhistle shows no signs of Originium infection.\n\n[Blood Originium-Crystal Density] 0.13u/L\nAs security personnel active in the Rim Billiton wilderness, it is impossible for Firewhistle to completely avoid Originium and its products. Even though she and her workers have satisfactory Oripathy protection, adequate rest is necessary.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "An energetic Liberi, Firewhistle operates a PMC in Rim Billiton.\nPerhaps owing to the fact that she can often be found aboard Rhodes Island and how much she likes to solicit business for her company, other operators often mistake her for a liaison for her PMC, a representative stationed onboard Rhodes Island, or someone who is in charge of her company only in name.\nShe doesn't seem to mind this misunderstanding herself very much, and even when someone asks this 'liaison' about her PMC, instead of discussing what she does at her company, she simply gives them an earnest quote and enthusiastically welcomes their patronage whenever they find themselves in Rim Billiton.\nLater on, that operator actually had to go to Rim Billiton, and he really chose to hire Firewhistle's company. After he returned to Rhodes Island, he told us about an incident where they ran into bandits in the Rim Billiton wilderness.\n'That merry atmosphere we had was gone in an instant when we noticed the dust kicked up by their cars in the distance.\n'Immediately, the squad dispersed, and Firewhistle ducked behind cover with me in tow.\n'She kept talking to the teammates in hushed tones through the walkie-talkie up till a certain point. Then, aside from the cars that were closing in, everything was quiet.\n'A few seconds after that, she raised her hand out of the cover and gestured something. Right after that, there was a series of loud cannon fire. Almost blew my ear drums out.\n'When I poked my head out of cover, I saw nothing but burning flames and a bunch of wrecked cars. Her team's members started popping out of every nook and cranny of the wilderness and huddled up around Firewhistle.\n'Probably not giving her enough credit, but that was when I realized for the first time that she's actually the backbone of that group.'\nIn response, Firewhistle told us: 'My bad. I should've put more thought into soundproofing. Next time, I'll give our customers their own personal earmuffs!'",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "As a small PMC that was able to gain a foothold in Rim Billiton, there's no question Firewhistle and her team are a capable bunch. Nonetheless, she entered into a cooperative agreement with Rhodes Island because her business is struggling and on the verge of bankruptcy.\nThe fact is that her partnership with Rhodes Island is her last ditch attempt at keeping her business afloat. If Rhodes Island had been any less receptive to a partnership, or a smaller, less stable client, Firewhistle's PMC would likely have been unable to avoid bankruptcy. Firewhistle was very forthcoming with this point when she consulted us on the partnership.\nThe reason that her business is struggling actually can't get any simpler: over 60% of her employees are Infected. In reality, the partnership was not her main objective. Her first and foremost priority was to seek medical services for her employees and to make sure they would continue to receive health care after her company's bankruptcy.\nConsidering that she is not an Infected herself, the operator in charge of business liaisons courteously asked her for the reason behind her unique employment policy, to which she provided a satisfactory answer. Later, after the agreement was signed, she provided an ambiguous response when the Doctor asked her a similar question. Then, when the Doctor asked her the same question again after the two companies had built a close rapport, she provided yet another answer.\n'No one out there's hiring Infected, and only I am willing to treat them like any other. Doesn't that mean I get first pick on all the Infected keen to be mercs in Rim Billiton, no matter their skill?'\n'You just gotta take the right precautions and keep tabs on everyone's health, and there is nothing left to worry about. Isn't that how things work here, too?'\n'I can't well sit by and watch my brothers and sisters in arms die because of some stupid bias.'\nAll three answers could not be more different, but they are all equally genuine and true.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Firewhistle once worked at a large Rim Billiton PMC and led a security team. That was when she developed that tactful yet not unlikable disposition. As the captain, she had to both contend with higher-ups who only want to jack up their missions' profits as well as clean up any messes her subordinates make. Sometimes, she even had to take the blame for them. It was a consensus within the company that combat squad leaders cannot be changed without a good reason. Plus, she did stand out from the crowd with her remarkable abilities. As such, she was reasonably satisfied during that time.\nThere was a time when, right before a dangerous mission began, her superior asked her to use someone as pawn—a teammate skilled in escape and disguise. Firewhistle refused because the teammate had come down with pulmonary tuberculosis during the last operation, which had since worsened. Yet her superior could not be more adamant on this matter.\nRealizing how unusual the situation was, she chose to spend all the time and energy she had left before the mission on planning instead of arguing with her superior. In the end, the team's exceptional performance, combined with a little luck, helped bring the mission to a successful conclusion without any casualties or injuries. The team was overjoyed, yet Firewhistle felt a hint of uneasiness about the whole thing.\nThen, when they made it back to the headquarters for recuperation, Firewhistle found herself aggressively reprimanded by her superiors, while her teammate with pulmonary tuberculosis was forcibly reassigned and was never heard from again. His position was filled by someone reassigned from another team.\nAfter several appeals, Firewhistle finally pieced together the truth from her impatient superior's answers: when the company was hiring, they advertised that workers who had to retire because of work-related injuries or disabilities would receive a significant lifetime benefits package, and that is what it says on the contract as well. Compared to these costs, the lump sum death benefits are not worth mentioning.\nDisgusted by this, Firewhistle swore to herself that she would never allow this to happen again. Not long after that, her superior once again came to her before a mission and laid it out bluntly: as long as she took out the man who was reassigned to her team not too long ago—someone who was infected during a mission and had onset Oripathy—she would be promoted to company management.\nThis time, Firewhistle didn't spend any time working on her strategies. Instead, she formed her own company and took her entire team with her. As for the Infected with onset Oripathy, he too became one of Firewhistle's PMC's first members.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Firewhistle could have hid the fact that there are Infected within her company, but she didn't. From the day she went independent, she made it a point to operate her company against the mainstream ideas in Rim Billiton, and recruited workers without consideration to their infection status. It's true that she managed to hire a great number of capable workers, but this also directly led to a dearth of prospective customers in Rim Billiton. Anyone could have seen it coming, but Firewhistle still did it without hesitation.\nWe were left wondering where her rebellious attitude came from until one day when she got drunk at a Rhodes Island cocktail party and went into her childhood: her father's outdoors iron mine, the workers who toiled away there for hours on end, the ceaseless procession of trucks, and her childhood playmates, the workers' children.\nHer parents weren't your stereotypical black-hearted mine owners. Out of a basic sense of morality, they equipped the mine with safety equipment, did not shy away from raises, asked middle management to not be stingy with approving the workers' time off, and even invited the workers to dine with them on holidays.\nThat said, they and the mine workers were from different walks of life.\nWhen the young Firewhistle played with the mine workers' children, her mother was afraid she would pick up the workers' profanities and embarrass the family during 'more refined situations.' When she wanted to ride on her father's car into the city with her best friend, her father would tell her that the interior of the luxury car would be very hard to clean once stained by metal shavings. Before she could even argue, her friend had already taken a few steps back, knowing their place. By the time she started high school, most of her friends had already started working in the mines as her family's employees... Reality was getting harsher and harsher by the day, and there was not even a villain she could blame. In an environment like that, Firewhistle's rebellious inclinations grew by the day. In the end, not only did she refuse to go home to work in the family business after she graduated from college, she even refused any financial assistance from her parents. The two unsuccessful murders added fuel to the fire that had been burning in her heart.\nStill, her kind nature managed to keep her from going down an even more extreme path. She merely started to openly fight against the things she saw as wrong—the prejudice against Oripathy, large corporations that put profits above conscience, or crossbow bolts being fired at her teammates—no matter how enormous and unshakeable they seemed.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'How come the Medical Department is looking so busy today?'\n'After that shipment of medicine made it to the Iron Carrot City, Firewhistle gave her whole crew paid time off, and the dozen or so of them all decided to come to Rhodes Island for a checkup.'\n'Is this meant to be time off, medical checkup, or a vacation? Or, uh... What do they call those... group medical tourism?'\n'How would I know? They're all on the top deck. If you want, why don't you go over there and join in on the fun.'\n'Fun?'\n'Her Infected underlings all have their Oripathy under control, and the most the non-Infected ones have are muscle pains, joint pains, and whatnot. Plus, Gavial's on duty today. Is everything falling into place for you yet?'\n'Haha, I'll pass. I'm not very used to rowdy situations like that.'\n'Alright, alright.'\n'Firewhistle's probably having plenty of fun herself, right?'\n'Her? She was Gavial's first opponent in the wrestling matches. Got her ass handed to her. Everyone on her team started saying they were gonna get revenge.'\n'It's Gavial we're talking about. I doubt they're gonna get anywhere with that.'\n'Yeah, I agree.'\n'What happened after Firewhistle got back up? She didn't work with her team to figure out how to wear Gavial out?'\n'She never got back up.'\n'Hey, stop trying to scare me.'\n'I'm not. After she fell down, all she did was lie there and laugh, not willing to get back up. Then one of her teammates squeezed a glass of cocktail that she'd just made into her hand. Then, before we knew it, she was asleep with that glass still in her hand.'\n'Well, she's been pretty tired lately.'\n'Yeah.'",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 2140,
      "atk": 732,
      "def": 414,
      "magicResistance": 0,
      "blockCnt": 3,
      "baseAttackTime": 2.8,
      "respawnTime": 70,
      "cost": 27
    }
  },
  "skins": [
    {
      "skinId": "char_493_firwhl#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_493_firwhl",
      "portraitId": "char_493_firwhl_1",
      "illustId": "illust_char_493_firwhl_1",
      "modelName": "Firewhistle",
      "drawerList": [
        "IRIS_呓"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_493_firwhl#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_493_firwhl_2",
      "portraitId": "char_493_firwhl_2",
      "illustId": "illust_char_493_firwhl_2",
      "modelName": "Firewhistle",
      "drawerList": [
        "IRIS_呓"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "4-5",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1203,
            "atk": 456,
            "def": 205,
            "magicResistance": 0,
            "cost": 23,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1605,
            "atk": 585,
            "def": 306,
            "magicResistance": 0,
            "cost": 23,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 70,
      "rangeId": "4-5",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1605,
            "atk": 585,
            "def": 306,
            "magicResistance": 0,
            "cost": 25,
            "blockCnt": 3,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 2140,
            "atk": 732,
            "def": 414,
            "magicResistance": 0,
            "cost": 25,
            "blockCnt": 3,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3231",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30022",
          "count": 5,
          "type": "MATERIAL"
        },
        {
          "id": "30012",
          "count": 3,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 80,
      "rangeId": "4-6",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 2140,
            "atk": 732,
            "def": 414,
            "magicResistance": 0,
            "cost": 27,
            "blockCnt": 3,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 2983,
            "atk": 882,
            "def": 568,
            "magicResistance": 0,
            "cost": 27,
            "blockCnt": 3,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.8,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3233",
          "count": 3,
          "type": "MATERIAL"
        },
        {
          "id": "30094",
          "count": 7,
          "type": "MATERIAL"
        },
        {
          "id": "31013",
          "count": 13,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_firwhl_1",
      "skillName": "Wildfire",
      "desc": "Next attack deals <@ba.vup>{atk_scale:0%}</> ATK as Physical damage and burns damaged enemies. Burning enemies take <@ba.vup>{burn.atk_scale:0%}</> of Firewhistle's ATK as Arts damage per second for <@ba.vup>{burn_duration}</>s.",
      "iconId": "skchr_firwhl_1",
      "spCost": 8,
      "initSp": 0,
      "duration": -1,
      "blackboard": [
        {
          "key": "burn_duration",
          "value": 4
        },
        {
          "key": "burn.atk_scale",
          "value": 0.5
        },
        {
          "key": "atk_scale",
          "value": 1.85
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30103",
              "count": 2,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_firwhl_2",
      "skillName": "Scorched Earth",
      "desc": "Each attack causes the 4 tiles adjacent to the target to burn for <@ba.vup>{projectile_life_time}</>s, causing ground enemies within to take <@ba.vup>{burn.atk_scale:0%}</> of Firewhistle's ATK as Arts damage per second.",
      "iconId": "skchr_firwhl_2",
      "spCost": 40,
      "initSp": 23,
      "duration": 17,
      "blackboard": [
        {
          "key": "projectile_life_time",
          "value": 6
        },
        {
          "key": "burn.atk_scale",
          "value": 0.85
        },
        {
          "key": "attack@projectile_delay_time",
          "value": 6
        },
        {
          "key": "attack@burn.atk_scale",
          "value": 0.85
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31023",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 2,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_firwhl",
      "moduleName": "Firewhistle's Badge",
      "desc": "Operator Firewhistle has demonstrated the capacity for simultaneously providing long-range fire support while holding the battlefront.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Defender Operator during field operations to exercise Fortress responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_firwhl",
      "moduleName": "'Footprints Growing'",
      "desc": "Dear Agni:\nThis is your first trip home in many years. We hear you've gone into business for yourself, and both your father and I are delighted to hear it. But you left in such a hurry, and so much was left unsaid. Since you decided to pack so light, I went ahead and sent you your old things. I wrote what I wanted to say on the item list here.\n[Half a box of matches]\nYou were three years old, trying to light a match the way the grown-ups do. You stuck the matchstick between your fingers. Your father rushed over, but you just giggled, waving your chubby little fists at him, and then the flame went out.\n[Worn-out lighter]\nSomeone gave this to you one summer before the start of school. It was broken, but you managed to actually fix it in time for the new term. Your father tried to take it several times, but seeing the excited look on your face as you spun it between your fingertips, he couldn't bring himself to do it.\n[High-end lighter]\nYou got it from Ashe before she went into the mines for the first time. You were about to go to high school in the city, and you didn't talk much with us anymore. We thought it was just a phase. But it wasn't until you came home for your eighteenth birthday that we learned Ashe had died in a mine accident and we realized we were wrong. You had a big fight with your father, and we knew things were more complicated than we'd thought.\nIt's been over a decade since then. At first, your father thought he should pass you the family business, so even if you didn't connect with us, you could still manage it in your own way, do as you would... you could even sell it! More than a business, we wanted to be able to have a heart-to-heart talk with our daughter.\nBut every time you two talked about it, you ended up fighting. And by the time you finished university, you'd lost all interest in talking to us.\n[Portable fire extinguisher]\nThis was supposed to be your eighteenth birthday present. We felt something like a sense of surrender when we settled on it. You liked playing with fire, and were pretty good at it. We accepted that, and hoped you'd always remember to quench the flames. Now it seems like we had nothing to worry about there.\nWhen you came home this time, we could see you'd grown a lot. No longer the young girl full of thoughts she couldn't express. But when we asked about your business and whether you needed help... you just smiled and said everything was fine.\nAgni, we know how stubborn you are, and how persistent, but... at least tell us about your troubles, let us offer some advice. Even if we'd just sigh and cry together, it's still better than the way things are. We don't even know what you've been through. Your father can only smoke on the deck, and I'm stuck here... writing this letter.\nThe reason I'm giving you this belated birthday gift is that I want to tell you that we respect your thoughts and wishes, and I hope you might... open up to us, every once in a while, won't you?\nPlease write back. It would make me and your father so very happy, honest and truly.\nLove, Your Mother"
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "With all this paper around, it's hard to resist the urge to start fires… Whoa, whoa, don't look at me like that, I'm just joshin', okay?",
      "voiceAsset": "char_493_firwhl/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Doctor, our employees are all Billy natives who know the lay of the land. If any Rhodes operators are traveling to Rim Billiton and need an escort, come find us! We will offer you a fair price.",
      "voiceAsset": "char_493_firwhl/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Why hire Infected when it's bad for business? Well, umm, because... Ah, come on, we all know how Oripathy's transmitted. All you need is proper protection and monitoring. Rhodes Island does the same, right? Ahaha…",
      "voiceAsset": "char_493_firwhl/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "The right type of ammo can turn the tide of a battle', it's a line every artilleryman knows. So their bags are filled with grapeshot, flashbangs and tracers. 'Course, they always have trouble deciding which to use when the time comes. As for me, I just bring incendiaries. Use 'em right, and they replace any type of ammo you could need.",
      "voiceAsset": "char_493_firwhl/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "I hated it whenever anyone brought up my dad while I was in university. Are we on bad terms? Naw, he's not a bad dad, and I'm grateful to him. But I hate it when people look at me like a mining mogul's spoiled kid. I'm more than just my dad's daughter!",
      "voiceAsset": "char_493_firwhl/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "Dad wouldn't let me near fire, Mum didn't let me play with the miners' kids, my old boss told me not to poke my nose into business that isn't my own, and everyone told me not to be too nice to the Infected. I never listened to any of that. You decide what's right and wrong for yourself, and never get swept up if you need time to make a choice.",
      "voiceAsset": "char_493_firwhl/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "That little firefighter always tenses up when she sees me, then points her hose right at me. Well, It's cute, sure, but that can't go on forever. The three of us should go for a drink sometime and clear up this misunderstanding. For the two of you, I'll make my special flaming cocktail.",
      "voiceAsset": "char_493_firwhl/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "I know I'm not great at business, but I also know how it feels to be helpless, relying on the kindness of others. It hurts, the company being in debt, but debtor's prison beats having to burn your own comrades to cinders.",
      "voiceAsset": "char_493_firwhl/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "I loved playing army when I was little, and I always dreamed of becoming a general. But Rim Billiton wasn't the place for that, so I had to settle for a private security firm... Now? Now I just want to keep my people warm and fed. My dream of becoming a general died the first time I saw someone get shot.",
      "voiceAsset": "char_493_firwhl/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Yawn... I'm bored. Might as well build a grenade tower over here... Whoa?! You're awake? Er, these are blanks! Nah yeah, just blanks!",
      "voiceAsset": "char_493_firwhl/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Thank you for choosing Firewhistle Security Services! My name is... huh? Codename? Umm, just call me Firewhistle. Yup, that's the key to raising brand awareness!",
      "voiceAsset": "char_493_firwhl/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "Nice strat. Would've been even better with some fire on that spot.",
      "voiceAsset": "char_493_firwhl/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "A promotion? Thank you! If you've got any more security jobs for me and my people, that'd be even better. Hehe.",
      "voiceAsset": "char_493_firwhl/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "Working with Rhodes Island's seen my company turn a profit at last. I'm not paying my employees out of my own pocket anymore! Thank you so much, Doctor! You have all my appreciation and all my gratitude!",
      "voiceAsset": "char_493_firwhl/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Firewhistle, at your service!",
      "voiceAsset": "char_493_firwhl/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Captain? No problem, I'm used to running the show.",
      "voiceAsset": "char_493_firwhl/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Let's go,everyone! I'll buy a round for us all when we're done.",
      "voiceAsset": "char_493_firwhl/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Stay low. Wait 'till you see my fire.",
      "voiceAsset": "char_493_firwhl/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Need some fire to turn up the heat?",
      "voiceAsset": "char_493_firwhl/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Your orders please.",
      "voiceAsset": "char_493_firwhl/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "In position and ready to light'em up.",
      "voiceAsset": "char_493_firwhl/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Artilleryman in position!",
      "voiceAsset": "char_493_firwhl/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Let's burn'em up!",
      "voiceAsset": "char_493_firwhl/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "This one's for you!",
      "voiceAsset": "char_493_firwhl/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Panicking just spreads the fire faster.",
      "voiceAsset": "char_493_firwhl/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Load, fire!",
      "voiceAsset": "char_493_firwhl/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Your plan actually worked! Sure wish I had a tactical genius like you on my payroll.",
      "voiceAsset": "char_493_firwhl/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "We should put out the fires before we call it a day. Wanna join me?",
      "voiceAsset": "char_493_firwhl/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Leaving a smoldering ember is a good way to end up with a wildfire. Let's watch out for those.",
      "voiceAsset": "char_493_firwhl/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "I'll cover our retreat. Don't worry, I've done this a bunch of times.",
      "voiceAsset": "char_493_firwhl/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Rhodes Island's base is outfitted so much better than my little office.",
      "voiceAsset": "char_493_firwhl/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Hey, Wanna see some fireworks?",
      "voiceAsset": "char_493_firwhl/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Here, I made this ornament out of a shell casing. Hehe, I'm really good at it, right?",
      "voiceAsset": "char_493_firwhl/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_493_firwhl/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Just a sec, I need to file my annual financials... alright! I hear you've got a lot of good Billy cooks at Rhodes Island. Why don't we go for a little tasting together?",
      "voiceAsset": "char_493_firwhl/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "G'day, Doctor! Need a warm fire?",
      "voiceAsset": "char_493_firwhl/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Here, Doctor, rainbow candles for your birthday! Hey, what's that look on your face? The flames are as colorful as the candles. How about that?",
      "voiceAsset": "char_493_firwhl/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "I thought about asking my family for help when my company was in debt. I even went home once, but when they asked how I was doing and whether I needed money, I just said everything was fine. I don't regret it one bit, but everytime I think of the concern in their eyes, I still feel sorry.",
      "voiceAsset": "char_493_firwhl/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "trade_cost[000]",
      "buffName": "Warm-Up",
      "desc": "When this Operator is assigned to a Trading Post, Morale loss of Operators in the Trading Post <@cc.vup>-0.1</> per hour",
      "skillIcon": "bskill_tra_cost1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "trade_ord_spd&share[000]",
      "buffName": "Advocate",
      "desc": "When this Operator is assigned to a Trading Post, other Operators working in the Trading Post have <@cc.vup>+15%</> order acquisition efficiency",
      "skillIcon": "bskill_tra_share1",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}