{
  "id": "char_487_bobb",
  "meta_info": {
    "name": "Bobbing",
    "appellation": " ",
    "voiceActor": {
      "en": "Griffyn Bellah",
      "jp": "Ken Takeuchi",
      "kr": "Kim Byung-hyun",
      "cn": "Zhang Qi"
    },
    "rarity": 5,
    "profession": "Supporter",
    "subProfessionId": "Ritualist",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "Elemental"
    ],
    "nationId": "Columbia",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Bobbing\n[Gender] Male\n[Combat Experience] None\n[Place of Birth] Columbia\n[Date of Birth] Mar 11\n[Race] Perro\n[Height] 178cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Standard\n[Mobility] Normal\n[Physical Resilience] Standard\n[Tactical Acumen] Standard\n[Combat Skill] Normal\n[Originium Arts Assimilation] Excellent",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Eliseo, an employee of Pure Heart Medical, came to Rhodes Island on his employer's behalf for training and outreach.\nCurrently codenamed 'Bobbing', he participates in field missions as a collaborating operator of Rhodes Island. His main duties include communication, negotiation, search and rescue, and emotional support.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Bobbing shows no signs of Originium infection.\n\n[Blood Originium-Crystal Density] 0.13u/L\nOperator Bobbing rarely comes into contact with Originium.\n\n'When he describes his protective measures, he talks like he's doing a voiceover for a children's educational TV program. Actually, that sounds like a great idea. We can play it nonstop next to the beds of the disobedient.'",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Pure Heart Medical requested to send its employee to Rhodes Island on an exchange program for study and outreach. Upon receiving this request, HR carefully conducted a preliminary investigation on the representative named Eliseo. It is true that, as a public welfare organization, Pure Heart Medical has always been committed to providing medical assistance and improving the lives of patients and the disabled. It has been extremely active in many public events occurring in recent years, and much like Rhodes Island pays great attention to the problems of the Infected. Eliseo himself went to Londinium on Pure Heart's behalf a few months ago, where he met with many our operators. However, the fact that the organization is part of the Maylander Foundation makes us wary. Rhodes Island is willing to cooperate with Maylander through formal channels, but we worry about being infiltrated by secret agents.\nAfter arriving at the landship, Eliseo appeared to be quite friendly. He immediately proposed the codename 'Bobbing,' hoping it would help him blend in. However, as he became acquainted with our operators, our suspicions only grew. After Eliseo was caught entering the medical department late at night, an HR Operator decided it was time to have an open conversation with him.\n\n[Excerpt from the Recording of their Conversation]\n'...So, you're saying that one of our patients became infected while trying to use Originium explosives to harm others. Thinking they deserved to die, they had been refusing treatment, but then you helped them regain the confidence to rebuild their life, persuaded them to turn themselves in, and even gave them advice on how to plan their life after release... but you're refusing to tell us who this patient is?'\n'Sorry, I can't tell you all the details. Patient confidentiality and all. They clearly felt guilty about what they were hiding because of how well your doctors were treating them. Opening up to me—an unrelated third party—was reasonable in its own way.'\n'Maybe so, but you came here to learn and exchange ideas, right? To see what Rhodes Island has to offer in Infected treatments, so you can put it in your next proposal or something?'\n'Before joining Pure Heart Medical, I was a social worker for a local community. I paid attention to the issues facing the residents and did my best to help the people overlooked by society.\n'I really cherished those days.'\n...\n\nLet him be. He really is just a kind-hearted individual. He hasn't even met any core members of the Maylander Foundation in person yet.\n——Human Resources Dept.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "According to records from Pure Heart Medical, after concluding his visit, Bobbing did everything in his power to secure material support for Londinium. He intended to return to Londinium and once again negotiate with Parliament to secure their cooperation. However, he soon learned that another of Maylander's subsidiaries would dispatch a team to accompany him, tasked with investigating the new symptoms he reported, such as ataxia and rapid advancement in Originium Arts. This group had never collaborated with Pure Heart Medical before, and after reviewing their plans, Bobbing sensed that they might attempt to exploit his influence in Londinium to deceive desperate Infected into participating in unethical experiments. He resolutely opposed this, and unsurprisingly was notified that a colleague would be sent in his place.\nHe then applied to visit Rhodes Island under a different exchange program and promptly informed us of the new symptoms he had observed in some Infected. Clearly, he believes this to be extremely significant. After all, it has drawn the attention of the Maylander Foundation. Unfortunately, Rhodes Island has only recently encountered such symptoms in Londinium as well. While we will continue to monitor the situation, we currently cannot make any definitive assessments.\nAdditionally, during his first month at Rhodes Island, Bobbing repeatedly applied to join field missions to Londinium. Of course, given the complex situations in Londinium, Rhodes Island only sends experienced operators on missions like this. As such, his requests were repeatedly denied. We knew perfectly well what he had done there on Pure Heart's behalf. However, we could not ensure that his approach would align with Rhodes Island's stance. Fortunately, after several operators returned from Londinium with updated reports, his anxiety seemed to subside. Now, he appears more inclined to fulfill the promises he made to his friends in Londinium after completing his exchange program at Rhodes Island.\n\n[Classified Log]\nBobbing has not admitted it, but his data access logs suggest that he is particularly curious about Operator Siege, or Vina Victoria.\nOf course, he hasn't been able to gather much useful information, and I've already warned him about this.\nPerhaps he had some other personal motivation to apply to come here. Perhaps he wishes to express his gratitude to her in some way, or perhaps his feelings are more complicated. However, the Vina he ought to be seeking is not the Vina who currently resides at Rhodes Island.\nI also advised him that if there's a burden weighing on his heart, then, like Vina and many other operators aboard this ship, he should find a place where he can set it aside, even if only occasionally.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Many operators have said that Bobbing's dorm feels magically calming, and none dared ask how he achieved it, fearing they might disrupt a hard-fought peace. As a result, stories about Bobbing and his 'mystical room' have spread widely among the operators. When some began to speculate that he was a 'centenarian master hypnotist' who was subtly altering their impressions of him, some curious operators finally decided to investigate.\nAfter listening to his visitors' rather blunt questioning, Bobbing, quite amused, set down the tea he had brewed for them. 'I think it's just that this dorm is naturally quiet,' he said.\nBobbing guided the operators back into the hallway, where they gradually became aware of the noises their ears had grown accustomed to—airflow from the ventilation system, the hum of various pieces of equipment, and the deep rumble of the steel colossus as it traversed the rugged wilderness. Upon re-entering Bobbing's dorm, they began to notice the many measures he had taken to reduce noise: the thick, plush carpets covering the floors, the plushies and cushions filling the room, the coasters beneath every cup, and even the soft-close mechanisms the cabinet doors were fitted with.\nIn short, Bobbing's living space was filled with soft furnishings that minimized noise and created a tranquil environment. He himself also maintained the habit of speaking in a low voice there. According to him, he wasn't particularly sensitive to sound—he just disliked noise, is all.\n\n'Does he really dislike noise? I have a hard time believing that. The last time we attended a conference together, there was some business-owner giving a talk about his proposal to institute restricted, tiered access to suppressants. Bobbing spent half an hour arguing with the guy about it, and the people in the next meeting room heard every word loud and clear.\n'But I've talked to him about it. He said people tend to ignore noise that's always there, just as they overlook persistent problems. Since he can't single-handedly make the noise disappear, he has no choice but to raise his voice and make sure everyone pays attention to it.\n'Oh, but don't tell him I said any of that. In the heat of an argument, he'll come out with any number of sharp remarks, but he's usually embarrassed by what he said afterward.'\n—A Rhodes Island Operator stationed in Columbia",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "We have found records of Bobbing collaborating with 'Millscar' during his time in Londinium, but there's nothing noteworthy about them. When he left Londinium, he helped a small group of Sarkaz evade capture and escorted them to Columbia. Based on other intelligence, it seems this wasn't done on a whim—he cut his visit to Londinium short specifically to bring these individuals to safety. It also does not appear that he had any deeper motive in saving these individuals.\nHe has continued to follow the plight of these displaced Sarkaz, visiting them numerous times after they settled. From a rejected aid application submitted within Pure Heart Medical, it's clear he holds a rather pessimistic view of the community support available to these infected Sarkaz. What caught our attention, however, was Pure Heart's reasoning for rejecting his application. They claimed Bobbing had exaggerated the injustices faced by these refugees due to his own personal biases. The reviewer argued that while these Sarkaz, who were born and raised in Victoria, have indeed struggled since arriving in Columbia, their decline in living standards wasn't due to systemic differences between the two countries. Instead, it stemmed from the widespread devastation caused by the Londinium incident, which affected nearly every citizen.\nWe discussed this matter with Bobbing himself. He explained that his family had migrated from Bolívar to Columbia before he was born, so the civil unrest in his ancestral homeland had only an indirect impact on him. He recalled that many of the children in his old neighborhood came from similar backgrounds. However, his family was relatively fortunate—they hadn't contracted Oripathy or suffered disabilities during the upheaval, allowing them to secure relatively decent contracts with corporations.\n'I was one of the few kids who made it to secondary school. Back then, I was so proud of my so-called intelligence,' Bobbing said with a bitter smile. 'Later, entire buildings emptied, and the people I knew vanished from the rosters of companies and institutions. It was then that I realized it wasn't about being smarter—I'd just been luckier than them.'\n'So I disagree with the claim that I am biased. I can't even say my experiences were similar to those of my childhood friends, let alone to those of the Sarkaz refugees from Londinium. However, the people I met in Londinium did teach me one thing: admitting you don't understand them is the greatest form of respect.\n'Hmm… especially one particular hero. She taught me a lot.'",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "He believed this work was confidential, so he couldn't talk to anyone about it. However, among the group he had escorted out of Londinium, there were a few children who happened to wake up early that morning. Out of curiosity, they quietly followed him.\nThe group originally included a Victorian soldier in the late stages of Oripathy. Everyone was afraid of her. They feared she might die along the way and undergo disintegration.\nBobbing led the soldier out of the camp. The two of them walked far into the wilderness, eventually reaching an open clearing with an expansive view. We think the two of them rose early that morning to watch the sunrise together. However, after the soldier sat down in the clearing, she suddenly told Bobbing that she wanted to watch it alone, and asked him to leave. Bobbing hesitated for a moment but ultimately agreed.\nOn his way back, he quickly caught the children who had secretly followed him. They seemed to understand what had happened and obediently clung to his coat as he instructed, without looking back. They were surprised, though—the sunrise that morning was a brilliant gold, shining behind them as they walked. Yet, Bobbing himself never turned around either.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1017,
      "atk": 370,
      "def": 59,
      "magicResistance": 15,
      "blockCnt": 1,
      "baseAttackTime": 1.6,
      "respawnTime": 70,
      "cost": 15
    }
  },
  "trait": [],
  "skins": [
    {
      "skinId": "char_487_bobb#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_487_bobb",
      "portraitId": "char_487_bobb_1",
      "illustId": "illust_char_487_bobb_1",
      "modelName": "Bobbing",
      "drawerList": [
        "HUG"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_487_bobb#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_487_bobb_2",
      "portraitId": "char_487_bobb_2",
      "illustId": "illust_char_487_bobb_2",
      "modelName": "Bobbing",
      "drawerList": [
        "HUG"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "y-2",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 511,
            "atk": 201,
            "def": 30,
            "magicResistance": 5,
            "cost": 13,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 752,
            "atk": 288,
            "def": 44,
            "magicResistance": 5,
            "cost": 13,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 70,
      "rangeId": "y-2",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 752,
            "atk": 288,
            "def": 44,
            "magicResistance": 10,
            "cost": 15,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 1017,
            "atk": 370,
            "def": 59,
            "magicResistance": 10,
            "cost": 15,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3271",
          "count": 4,
          "type": "MATERIAL",
          "name": "Supporter Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_SUP1"
        },
        {
          "id": "30052",
          "count": 4,
          "type": "MATERIAL",
          "name": "Polyketon",
          "rarity": 2,
          "iconId": "MTL_SL_KETONE2"
        },
        {
          "id": "30062",
          "count": 2,
          "type": "MATERIAL",
          "name": "Device",
          "rarity": 2,
          "iconId": "MTL_SL_BOSS2"
        }
      ]
    },
    {
      "maxLevel": 80,
      "rangeId": "y-2",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1017,
            "atk": 370,
            "def": 59,
            "magicResistance": 15,
            "cost": 15,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1305,
            "atk": 446,
            "def": 68,
            "magicResistance": 15,
            "cost": 15,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3273",
          "count": 3,
          "type": "MATERIAL",
          "name": "Supporter Dualchip",
          "rarity": 5,
          "iconId": "MTL_ASC_SUP3"
        },
        {
          "id": "31054",
          "count": 7,
          "type": "MATERIAL",
          "name": "Cutting Fluid Solution",
          "rarity": 4,
          "iconId": "MTL_SL_PLCF"
        },
        {
          "id": "31043",
          "count": 13,
          "type": "MATERIAL",
          "name": "Semi-Synthetic Solvent",
          "rarity": 3,
          "iconId": "MTL_SL_SS"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_bobb_1",
      "skillName": "Nonpeaceful Negotiation",
      "desc": "The next attack deals <@ba.vup>{atk_scale:0%}</> ATK as Arts damage and <@ba.vup>{ep_damage_ratio:0%}</> ATK as <$ba.dt.burning2>Burn damage</>, prioritizing enemies not under a burst effect",
      "iconId": "skchr_bobb_1",
      "spCost": 10,
      "initSp": 0,
      "duration": -1,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 2
        },
        {
          "key": "ep_damage_ratio",
          "value": 1.2
        },
        {
          "key": "cnt",
          "value": 1
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31033",
              "count": 1,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31064",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_bobb_2",
      "skillName": "'You Shall Not Pass'",
      "desc": "Stops attacking and sets a burning field at the location of an enemy; ground enemies within this field take <@ba.vup>{attack@atk_scale:0%}</> ATK as Arts damage and <@ba.vup>{attack@ep_damage_ratio:0%}</> ATK as <$ba.dt.burning2>Burn damage</> every second",
      "iconId": "skchr_bobb_2",
      "spCost": 24,
      "initSp": 10,
      "duration": 11,
      "blackboard": [
        {
          "key": "attack@atk_scale",
          "value": 1.4
        },
        {
          "key": "attack@ep_damage_ratio",
          "value": 0.2
        },
        {
          "key": "attack@projectile_life_time",
          "value": 11
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30053",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31064",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "potentialRanks": [
    {
      "type": "BUFF",
      "description": "DP Cost -1",
      "buff": {
        "attributes": {
          "attributeModifiers": [
            {
              "attributeType": "COST",
              "formulaItem": "ADDITION",
              "value": -1,
              "loadFromBlackboard": false,
              "fetchBaseValueFromSourceEntity": false
            }
          ]
        }
      }
    },
    {
      "type": "BUFF",
      "description": "Redeployment Time -4 sec",
      "buff": {
        "attributes": {
          "attributeModifiers": [
            {
              "attributeType": "RESPAWN_TIME",
              "formulaItem": "ADDITION",
              "value": -4,
              "loadFromBlackboard": false,
              "fetchBaseValueFromSourceEntity": false
            }
          ]
        }
      }
    },
    {
      "type": "BUFF",
      "description": "ATK +21",
      "buff": {
        "attributes": {
          "attributeModifiers": [
            {
              "attributeType": "ATK",
              "formulaItem": "ADDITION",
              "value": 21,
              "loadFromBlackboard": false,
              "fetchBaseValueFromSourceEntity": false
            }
          ]
        }
      }
    },
    {
      "type": "CUSTOM",
      "description": "Improves First Talent",
      "buff": {}
    },
    {
      "type": "BUFF",
      "description": "DP Cost -1",
      "buff": {
        "attributes": {
          "attributeModifiers": [
            {
              "attributeType": "COST",
              "formulaItem": "ADDITION",
              "value": -1,
              "loadFromBlackboard": false,
              "fetchBaseValueFromSourceEntity": false
            }
          ]
        }
      }
    }
  ],
  "favorKeyFrames": [
    {
      "level": 0,
      "data": {
        "maxHp": 0,
        "atk": 0,
        "def": 0,
        "magicResistance": 0,
        "cost": 0,
        "blockCnt": 0,
        "moveSpeed": 0,
        "attackSpeed": 0,
        "baseAttackTime": 0,
        "respawnTime": 0,
        "hpRecoveryPerSec": 0,
        "spRecoveryPerSec": 0,
        "maxDeployCount": 0,
        "maxDeckStackCnt": 0,
        "tauntLevel": 0,
        "massLevel": 0,
        "baseForceLevel": 0,
        "stunImmune": false,
        "silenceImmune": false,
        "sleepImmune": false,
        "frozenImmune": false,
        "levitateImmune": false,
        "disarmedCombatImmune": false,
        "fearedImmune": false
      }
    },
    {
      "level": 50,
      "data": {
        "maxHp": 0,
        "atk": 40,
        "def": 40,
        "magicResistance": 0,
        "cost": 0,
        "blockCnt": 0,
        "moveSpeed": 0,
        "attackSpeed": 0,
        "baseAttackTime": 0,
        "respawnTime": 0,
        "hpRecoveryPerSec": 0,
        "spRecoveryPerSec": 0,
        "maxDeployCount": 0,
        "maxDeckStackCnt": 0,
        "tauntLevel": 0,
        "massLevel": 0,
        "baseForceLevel": 0,
        "stunImmune": false,
        "silenceImmune": false,
        "sleepImmune": false,
        "frozenImmune": false,
        "levitateImmune": false,
        "disarmedCombatImmune": false,
        "fearedImmune": false
      }
    }
  ],
  "talents": [
    {
      "candidates": [
        {
          "unlockCondition": {
            "phase": "PHASE_1",
            "level": 1
          },
          "requiredPotentialRank": 0,
          "prefabKey": "1",
          "name": "Focused Guidance",
          "description": "The first attack against an enemy deals 10% ATK as <$ba.dt.burning2>Burn damage</> every second for 5s",
          "blackboard": {
            "attack@ep_damage_ratio_talent": 0.1,
            "attack@dmg_duration": 5
          },
          "tokenKey": null,
          "isHideTalent": false
        },
        {
          "unlockCondition": {
            "phase": "PHASE_1",
            "level": 1
          },
          "requiredPotentialRank": 4,
          "prefabKey": "1",
          "name": "Focused Guidance",
          "description": "The first attack against an enemy deals 12% <@ba.talpu>(+2%)</> ATK as <$ba.dt.burning2>Burn damage</> every second for 5s",
          "blackboard": {
            "attack@ep_damage_ratio_talent": 0.12,
            "attack@dmg_duration": 5
          },
          "tokenKey": null,
          "isHideTalent": false
        },
        {
          "unlockCondition": {
            "phase": "PHASE_2",
            "level": 1
          },
          "requiredPotentialRank": 0,
          "prefabKey": "1",
          "name": "Focused Guidance",
          "description": "The first attack against an enemy deals 16% ATK as <$ba.dt.burning2>Burn damage</> every second for 5s",
          "blackboard": {
            "attack@ep_damage_ratio_talent": 0.16,
            "attack@dmg_duration": 5
          },
          "tokenKey": null,
          "isHideTalent": false
        },
        {
          "unlockCondition": {
            "phase": "PHASE_2",
            "level": 1
          },
          "requiredPotentialRank": 4,
          "prefabKey": "1",
          "name": "Focused Guidance",
          "description": "The first attack against an enemy deals 18% <@ba.talpu>(+2%)</> ATK as <$ba.dt.burning2>Burn damage</> every second for 5s",
          "blackboard": {
            "attack@ep_damage_ratio_talent": 0.18,
            "attack@dmg_duration": 5
          },
          "tokenKey": null,
          "isHideTalent": false
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_bobb",
      "moduleName": "Bobbing's Badge",
      "desc": "Operator Bobbing has demonstrated a remarkable aptitude for assisting allies in the inflicting of elemental casualties upon the enemy.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Supporter Operator during field operations to exercise Ritualist responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named.",
      "typeIcon": "original",
      "uniEquipIcon": "uniequip_001_bobb",
      "typeName1": "ORIGINAL",
      "typeName2": "",
      "showEvolvePhase": "PHASE_2",
      "unlockLevel": 0,
      "missionList": [],
      "unlockFavors": {},
      "itemCost": {},
      "module_upgrades": []
    },
    {
      "moduleId": "uniequip_002_bobb",
      "moduleName": "Second-hand Textbook for Social Work",
      "desc": "Eliseo sits outside the orientation room, waiting for the student before him to finish. Course materials for social work are strewn across his lap, all procured from the secondhand market, though he hasn't thumbed through them in a while.\nThis was never part of his life plans during middle school. He used to be praised for his talent by his Originium Arts teachers, and daydreamed of being recruited by both R&D and military firms. Of course, he also remembers not having spare money for a proper Arts Unit that met course safety standards, always using faculty equipment loaned to him by the teaching staff instead. This went on until one day a student tossed a broken staff at him in front of the rest of the class. Amidst all their jeering and laughter, he chose to silently pick it up, take it home, and spent a good week fixing it. In his mind, at the time, as long as he could lean on his exceptional talent, then the jeering from his classmates was something he could put up with.\nHe used that old staff for the next two school years. In the end, he took it apart, sold the Arts Unit—the only part that was worth anything—and then confronted the one who'd humiliated him and fought with him. He'd realized his supposed 'talent' wasn't even capable of letting him surpass those classmates with keener, smarter weapons, let alone the geniuses of his major and his professors who had the backing of experimental funding. Eliseo could almost imagine how they, just like his classmate who threw him the broken staff, would disdainfully toss him outmoded equipment, or flaunt some enviable academic achievements in front of him, all while boasting themselves as his savior.\nAnd that same afternoon, he flipped two pages back in a monthly magazine to see an Infected survivors' report from the Maylander Foundation. It occurred to him: maybe if he got into Infected social work, he wouldn't be looked down on any longer. After all, the Infected were in even worse of a position than him, and always in need. Now it was time for him to be the savior—\nThe professor inside calls his name. Eliseo gets up and heads in.\nHe thinks he knows what the professor's going to say. He's going to be warned: social work requires patience first and foremost; some cases will be exceptionally tough to handle, hopefully he's mentally well-prepared for this...\nBut after Eliseo sits down at the interview desk, the professor smiles and greets him with a question.\n'Why do you want to become a social worker?'\nHe finds himself at a sudden loss for words.\nThe professor silently gazes at him for a moment, then gently speaks. 'Social workers try to push for society to develop, because we believe everyone can change.\n'Everyone deserves a better life, where their background and their past don't hold them back.\n'Just like you and I.'",
      "typeIcon": "rit-x",
      "uniEquipIcon": "uniequip_002_bobb",
      "typeName1": "RIT",
      "typeName2": "X",
      "showEvolvePhase": "PHASE_2",
      "unlockLevel": 50,
      "missionList": [
        "uniequip_002_bobb_1",
        "uniequip_002_bobb_2"
      ],
      "unlockFavors": {
        "1": 0,
        "2": 2732,
        "3": 10070
      },
      "itemCost": {
        "1": [
          {
            "id": "mod_unlock_token",
            "count": 2,
            "type": "MATERIAL"
          },
          {
            "id": "31044",
            "count": 3,
            "type": "MATERIAL"
          },
          {
            "id": "4001",
            "count": 40000,
            "type": "GOLD"
          }
        ],
        "2": [
          {
            "id": "mod_unlock_token",
            "count": 2,
            "type": "MATERIAL"
          },
          {
            "id": "mod_update_token_1",
            "count": 20,
            "type": "MATERIAL"
          },
          {
            "id": "31054",
            "count": 4,
            "type": "MATERIAL"
          },
          {
            "id": "4001",
            "count": 50000,
            "type": "GOLD"
          }
        ],
        "3": [
          {
            "id": "mod_unlock_token",
            "count": 2,
            "type": "MATERIAL"
          },
          {
            "id": "mod_update_token_2",
            "count": 8,
            "type": "MATERIAL"
          },
          {
            "id": "31074",
            "count": 5,
            "type": "MATERIAL"
          },
          {
            "id": "4001",
            "count": 60000,
            "type": "GOLD"
          }
        ]
      },
      "module_upgrades": [
        {
          "equipLevel": 1,
          "attributeBlackboard": [
            {
              "key": "atk",
              "value": 25,
              "valueStr": null
            },
            {
              "key": "def",
              "value": 23,
              "valueStr": null
            }
          ],
          "tokenAttributeBlackboard": {},
          "parts": [
            {
              "target": "TRAIT",
              "isToken": false,
              "talents": [],
              "trait": [
                {
                  "additionalDescription": "Elemental Injury dealt to Elite and Leader enemies increases by <@ba.kw>18%</>",
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "blackboard": [
                    {
                      "key": "ep_damage_scale",
                      "value": 1.18,
                      "valueStr": null
                    }
                  ],
                  "overrideDescripton": null,
                  "prefabKey": null,
                  "rangeId": null
                }
              ]
            }
          ]
        },
        {
          "equipLevel": 2,
          "attributeBlackboard": [
            {
              "key": "atk",
              "value": 30,
              "valueStr": null
            },
            {
              "key": "def",
              "value": 27,
              "valueStr": null
            }
          ],
          "tokenAttributeBlackboard": {},
          "parts": [
            {
              "target": "TRAIT",
              "isToken": false,
              "talents": [],
              "trait": [
                {
                  "additionalDescription": "Elemental Injury dealt to Elite and Leader enemies increases by <@ba.kw>18%</>",
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "blackboard": [
                    {
                      "key": "ep_damage_scale",
                      "value": 1.18,
                      "valueStr": null
                    }
                  ],
                  "overrideDescripton": null,
                  "prefabKey": null,
                  "rangeId": null
                }
              ]
            },
            {
              "target": "TALENT_DATA_ONLY",
              "isToken": false,
              "talents": [
                {
                  "displayRangeId": false,
                  "upgradeDescription": "The first attack against an enemy deals 17% ATK as <$ba.dt.burning2>Burn damage</> every second for 5s",
                  "talentIndex": 0,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "prefabKey": "1",
                  "name": "Focused Guidance",
                  "description": null,
                  "rangeId": null,
                  "blackboard": [
                    {
                      "key": "attack@ep_damage_ratio_talent",
                      "value": 0.17,
                      "valueStr": null
                    },
                    {
                      "key": "attack@dmg_duration",
                      "value": 5,
                      "valueStr": null
                    }
                  ],
                  "tokenKey": null,
                  "isHideTalent": false
                },
                {
                  "displayRangeId": false,
                  "upgradeDescription": "The first attack against an enemy deals 19% <@ba.talpu>(+2%)</> ATK as <$ba.dt.burning2>Burn damage</> every second for 5s",
                  "talentIndex": 0,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 4,
                  "prefabKey": "1",
                  "name": "Focused Guidance",
                  "description": null,
                  "rangeId": null,
                  "blackboard": [
                    {
                      "key": "attack@ep_damage_ratio_talent",
                      "value": 0.19,
                      "valueStr": null
                    },
                    {
                      "key": "attack@dmg_duration",
                      "value": 5,
                      "valueStr": null
                    }
                  ],
                  "tokenKey": null,
                  "isHideTalent": false
                }
              ],
              "trait": []
            }
          ]
        },
        {
          "equipLevel": 3,
          "attributeBlackboard": [
            {
              "key": "atk",
              "value": 35,
              "valueStr": null
            },
            {
              "key": "def",
              "value": 30,
              "valueStr": null
            }
          ],
          "tokenAttributeBlackboard": {},
          "parts": [
            {
              "target": "TRAIT",
              "isToken": false,
              "talents": [],
              "trait": [
                {
                  "additionalDescription": "Elemental Injury dealt to Elite and Leader enemies increases by <@ba.kw>18%</>",
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "blackboard": [
                    {
                      "key": "ep_damage_scale",
                      "value": 1.18,
                      "valueStr": null
                    }
                  ],
                  "overrideDescripton": null,
                  "prefabKey": null,
                  "rangeId": null
                }
              ]
            },
            {
              "target": "TALENT_DATA_ONLY",
              "isToken": false,
              "talents": [
                {
                  "displayRangeId": false,
                  "upgradeDescription": "The first attack against an enemy deals 18% ATK as <$ba.dt.burning2>Burn damage</> every second for 5s",
                  "talentIndex": 0,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "prefabKey": "1",
                  "name": "Focused Guidance",
                  "description": null,
                  "rangeId": null,
                  "blackboard": [
                    {
                      "key": "attack@ep_damage_ratio_talent",
                      "value": 0.18,
                      "valueStr": null
                    },
                    {
                      "key": "attack@dmg_duration",
                      "value": 5,
                      "valueStr": null
                    }
                  ],
                  "tokenKey": null,
                  "isHideTalent": false
                },
                {
                  "displayRangeId": false,
                  "upgradeDescription": "The first attack against an enemy deals 20% <@ba.talpu>(+2%)</> ATK as <$ba.dt.burning2>Burn damage</> every second for 5s",
                  "talentIndex": 0,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 4,
                  "prefabKey": "1",
                  "name": "Focused Guidance",
                  "description": null,
                  "rangeId": null,
                  "blackboard": [
                    {
                      "key": "attack@ep_damage_ratio_talent",
                      "value": 0.2,
                      "valueStr": null
                    },
                    {
                      "key": "attack@dmg_duration",
                      "value": 5,
                      "valueStr": null
                    }
                  ],
                  "tokenKey": null,
                  "isHideTalent": false
                }
              ],
              "trait": []
            }
          ]
        }
      ]
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "No problem, I'll handle it. Filling forms and organizing data are complicated and dull procedures to be sure. But it's necessary work, if we want local governments to help out in assisting the Infected. I'm sure you've nurtured a patience for it, as I have.",
      "voiceAsset": "char_487_bobb/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "No, no, I didn't put these healthy living advisories up. Our organization aims to help people live better lives, but I don't believe that gives us the right to dictate what a better life is. Besides, I personally prefer energy bars to regular meals... Oh, heh, I'll consider your advice.",
      "voiceAsset": "char_487_bobb/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Operators have been coming to me for talks? True enough. Even HR Operators are asking me about it. The only thing I can tell you is that I'm not here to poach people for Pure Heart Medical. You know very well I must keep all work engagements confidential, whether they've killed a relative, or simply stolen a cookie.",
      "voiceAsset": "char_487_bobb/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Doctor, could you help me review this script for a business conference? There's a part about distributing Oripathy medicine on the frontier. I'm not used to such loud public speeches. Quiet talks are more my thing... But I'm so good at pushing for a dangerous mission? Th-That's a very different situation!",
      "voiceAsset": "char_487_bobb/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "The discussion went smoothly, so I'm in no position to feel down, but... I got yet another 'If the Infected were as well-mannered as you, we would have donated much more'. Tolerance or humility, people can only afford it when their backs aren't up against the wall.",
      "voiceAsset": "char_487_bobb/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "I once escorted some Infected out of that city, with a few Sarkaz in tow. It was a long journey. They had no staves, and their condition only worsened when casting Arts to protect themselves, while I use my own Arts to keep them safe, at no cost to myself... ah, the irony of it all.",
      "voiceAsset": "char_487_bobb/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Yes, the Infected are usually isolated from the masses, and physical contact can be an act of kindness. Though, hugs inherently make people happy. You don't have to be infected or have a particular reason to enjoy one. Would you like a hug, Doctor?",
      "voiceAsset": "char_487_bobb/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Do we have to talk about Londinium...? I once attended an aristocratic ball where everyone covered their crystals as they danced; I helped workers move their lumber as I heard them hoping to build a home before they took their last breaths. They were all smiling, so I want to smile when I tell their stories.",
      "voiceAsset": "char_487_bobb/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "Have a seat, Doctor. No, you aren't interrupting anything. The view isn't that special either. Just another sunrise in the barrens amidst dusky skies. I tell myself the sun rises the same every morning... just as it did that one time I didn't look back.",
      "voiceAsset": "char_487_bobb/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Ssh—Hello there, the Doctor's on break at the moment... No, no, the Doctor is being very responsible. No one can work 24/7—everyone has to recharge every once in a while, right?",
      "voiceAsset": "char_487_bobb/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Hello, I'm here at Rhodes Island for an exchange study, representing the Maylander Foundation's Pure Heart Medical. Your Operators saw me before in Victoria...? I'd like to avoid discussing my experiences there for the time being, if I could.",
      "voiceAsset": "char_487_bobb/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "Sorry, could I just take a short break? It's honestly a bit too loud for me...",
      "voiceAsset": "char_487_bobb/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "Thank you, Doctor. I'm glad Rhodes Island values me, but I'm afraid my suggestions won't be any better than what you're already doing.",
      "voiceAsset": "char_487_bobb/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "I spent one afternoon in middle school reading a Maylander report on how the Infected live, and decided I had to do something for them. As my mind wanders back to that young boy's arrogant self-righteousness, I'm filled with shame. But I did the right thing. I have no regrets.",
      "voiceAsset": "char_487_bobb/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "All this noise... I've gotten used to it.",
      "voiceAsset": "char_487_bobb/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Just follow me, everyone. Our plan is set and we have plenty of supplies, so we'll get through this.",
      "voiceAsset": "char_487_bobb/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "If you get too cold, come over near me.",
      "voiceAsset": "char_487_bobb/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "We should try talking with the other side, if it's not too late.",
      "voiceAsset": "char_487_bobb/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Are you nervous?",
      "voiceAsset": "char_487_bobb/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Of course, ready anytime.",
      "voiceAsset": "char_487_bobb/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Phew… My ears might need a second to get used to this environment.",
      "voiceAsset": "char_487_bobb/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "This confrontation is inevitable.",
      "voiceAsset": "char_487_bobb/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Fire is only a boundary.",
      "voiceAsset": "char_487_bobb/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Please don't force your way through.",
      "voiceAsset": "char_487_bobb/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "I won't surrender, so I suggest you take a detour.",
      "voiceAsset": "char_487_bobb/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "If only you had more choices in life…",
      "voiceAsset": "char_487_bobb/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "It's no wonder so many see you as hope itself... ah, sorry. Does that put a lot of pressure on you?",
      "voiceAsset": "char_487_bobb/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Phew— you're really incredible! How about taking a break to celebrate?",
      "voiceAsset": "char_487_bobb/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Doctor, just say the word and I'll go have a talk with them.",
      "voiceAsset": "char_487_bobb/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "...It's alright, we have a contingency plan and plenty of medical supplies. No need to worry.",
      "voiceAsset": "char_487_bobb/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "It's going to be hard, convincing other companies to follow this standard of treatment for Infected employees…",
      "voiceAsset": "char_487_bobb/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "If you want to scare me, you should try yelling 'boo!' or something next time.",
      "voiceAsset": "char_487_bobb/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Would you like to talk? I'll bring the beanbag chairs over... oh, you don't have to be so formal. I'm happy to hear whatever you have to say.",
      "voiceAsset": "char_487_bobb/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_487_bobb/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "...Did you call me? Ah, sorry. I had my earplugs in. They only asked me to untangle these streamers, so at least it wouldn't bother anyone if I didn't hear you. Oh, Please don't get me wrong, I do love New Year's. When people make their resolutions, it means they still have hope in their hearts.",
      "voiceAsset": "char_487_bobb/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Please let me know if you need anything. Oh yes, you can also ask me to join you on your coffee break.",
      "voiceAsset": "char_487_bobb/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "You're an important partner of Pure Heart Medical, so of course we got you a birthday gift. Please, open it. Haha, I'm sorry. I just wanted to see the shocked look on your face when you opened it. This body pillow is a personal gift from me, I hope you enjoy it as much as I do.",
      "voiceAsset": "char_487_bobb/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "It's crucial we consolidate our achievements so far, but it's inevitable that we'll recall our many regrets and sorrows as well... We should find another day for it, but could I talk to you about a few things I've had on my mind? Yes, I hope you can be the one to hear me out.",
      "voiceAsset": "char_487_bobb/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "dorm_rec_all&unfull[000]",
      "buffName": "Listener",
      "desc": "When this Operator is assigned to a Dormitory, restores <@cc.vup>+0.15</> Morale per hour to all Operators assigned to that Dormitory (Only the strongest effect of this type takes place)",
      "skillIcon": "bskill_dorm_all2",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "dorm_rec_all&unfull[001]",
      "buffName": "Conversationalist",
      "desc": "When this Operator is assigned to a Dormitory, restores <@cc.vup>+0.2</> Morale per hour to all Operators assigned to that Dormitory; for every <@cc.kw>1</> Operator whose Morale is not full in that Dormitory, restore an additional <@cc.vup>+0.01</> (Only the strongest effect of this type applies)",
      "skillIcon": "bskill_dorm_unfull",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "tokens": [],
  "patch_info": {}
}