{
  "id": "char_194_leto",
  "meta_info": {
    "name": "Leto",
    "appellation": " ",
    "voiceActor": {
      "en": "Christina Sherman",
      "jp": "Ayaka Asai",
      "kr": "Lee Dal-lae",
      "cn": "Yu Chen"
    },
    "rarity": 5,
    "profession": "Guard",
    "subProfessionId": "Lord",
    "position": "MELEE",
    "team": "",
    "tagList": [
      "DPS",
      "Support"
    ],
    "nationId": "Ursus",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Leto\n[Gender] Female\n[Combat Experience] 6 Months\n[Place of Birth] Ursus\n[Date of Birth] Mar 30\n[Race] Ursus\n[Height] 167cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Excellent\n[Mobility] Normal\n[Physical Resilience] Excellent\n[Tactical Acumen] Standard\n[Combat Skill] Standard\n[Originium Arts Assimilation] Normal",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Leto, real name Rosalind Tatyanovna Larina, attended middle school in Chernobog prior to the Chernobog Incident, where she was a leading figure among the students, alongside Operator Zima. Now focused on mid-to-long-range assignments as a field operator.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Leto shows no signs of Originium infection.\n\n[Blood Originium-Crystal Density] 0.13u/L\nThe USSG girls were very lucky not to get infected back in Chernobog. But if they're going to be running all over the place, they'll want to be adding some extra protective measures when away from the ship.\n——Medic Operator",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "From the accounts of the various members of the Ursus Student Self-government Group, we've managed to piece together a rough picture of the events that took place. It's evident that, as a result of their experiences, the students have exhibited varying degrees of post-traumatic stress disorder after their onboarding at Rhodes Island, with one exception: Operator Leto.\nLeto does not shy away from the disaster she experienced, and appears to view that difficult time rather lightly. Trapped in the school, students struggling against one another, trying to survive in the ruined city... she seems to see the things she's been through as something of a heroic story with the USSG girls as the protagonists. She does not bring up the difficult or painful parts. Perhaps she genuinely believes that the hardships she overcame do not merit much mention. The only thing worth remembering in the end is that she and her comrades made it through, overcoming their difficulties together.\nAll's well that ends well.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Rhodes Island has established a relatively comprehensive process for the placement of minors.\nFirst, we prioritize referring them to schools in various locations—depending mostly on Rhodes Island's current position—to facilitate the completion of the child's education. We would prefer the minors in question preserve their future prospects, after all. Although we offer various courses of study to our operators, and children who are unwilling to attend outside schools can likewise choose to receive this education, this type of instruction cannot grant a diploma recognized by any relevant authority. And to put it bluntly, employment at Rhodes Island is not the ideal choice for a minor.\nAlong with the other members of the USSG, Leto declined our proposal to attend another middle school in the Empire of Ursus. She chose instead to stay at Rhodes Island to work as an operator and receive instruction onboard. In addition to our courses, she was also 'forced' by Istina and Rosa to undergo targeted small-group instruction, along with the similarly situated Zima and Gummy. The earnest efforts of the two girls led to strict supervision. Regardless of whether or not it would ultimately be necessary, Istina and Rosa hoped that the USSG girls could at least earn undergraduate degrees, providing them with more options in the future. Leto certainly understood her companions' intentions, however much she might complain about them, and so she studied diligently, scratching her head along the way.\nUnlike Zima, Istina, and the others, Leto chose to stay for a more important reason—her mother. Tatyana Yevgenyevna Larina is currently undergoing Oripathy treatment at Rhodes Island. Under such circumstances, it is unsurprising that Leto chose to stay on as an operator, using her earnings to pay for her mother's treatment.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Operator Leto's background merits no further discussion. Her mother Tatyana has confirmed that Leto's father is from Kjerag. She was born and spent the first two years of her life in Kjerag, although she herself describes being raised by her mother alone on the snowy plains of Ursus. The Empire of Ursus has left a deep impression on her. While she may have returned to Kjerag out of curiosity regarding her bloodline, she continues to identify as Ursine.\nDuring her childhood, she carried admiration and even hope for her father. But as she grew, she learned to earn her own respect, rather than wait for a father who would never appear. Her mother's free spirit also greatly influenced her. The two faced life graciously and did not consider her absent father a significant burden. Even so, before departing for Kjerag, she revealed the curiosity and vague ideas she had about her father. Following her trip to the mountains, her image was shattered, and, having learned the true story of her parents, she put the matter to rest.\nShe really doesn't care, and that's a good thing.\n\n[Oripathy Patient Record]\nTatyana Yevgenyevna Larina, female, Ursine explorer, has garnered a degree of fame among certain groups for her artifact excavations and mapping of uncharted regions.\nTwenty years ago, she lost contact with the outside world during an expedition, and later returned to Ursus with her daughter, whom she raised alone. Infected during the Chernobog Incident, she sought out Rhodes Island and found her daughter, Rosalind, now Operator Leto, whom we had rescued. Since then, Ms. Larina (senior) has chosen to stay at Rhodes Island for treatment.\nHer condition is relatively stable at present. If she continues to receive treatment, control her symptoms, and avoid visits to particularly dangerous areas, her condition will not further deteriorate in the immediate term.\nP.S.\nNote that Tatyana's marital status reads 'divorced'!\nDivorced, got it?! It's totally fine to ask her out!\nP.P.S.\nBesides, I get along well with Leto, even though she's not much younger than me.\nI totally feel like I've got a shot.\n\n[Leto's Travel Log]\nGot a gift for Lada. Picked up some local snacks too.\nA book should be good enough for Anna, right? She probably hasn't read these two.\nAs for Natalya's... Uhh, Mamochka picked it out, so Her Worship won't call me tasteless again.\nJust give Sonya this cassette tape so I can trade for some of hers, oh yeah!\nAnd for the Doctor, this floral pattern shirt seems nice. Hmm. I like it, anyway.\nI've also got some local delicacies for Amiya and the rest, perfect!\nOh, wait, there's one more I almost forgot...\nUgh, damn.\nI can get something at the train station.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Time flies, and it's been a few years since the USSG girls came to Rhodes Island. They were underage at the time, still immature in many ways. Now, they have grown up, and each have their own plans for the future. Their time spent at Rhodes Island has been a period of preparation, building strength for their respective futures. Operator Leto is no exception.\nHer talent for foreign languages, as well as her enthusiasm for the study thereof, has made her a popular choice for long-term field missions. The adventurous and challenge-seeking nature she's inherited from her mother has made her more than willing to be assigned such missions requiring visits to multiple countries. With the platform provided by Rhodes Island, Leto's footprints have covered the length and breadth of the lands over the past few years. Completing these missions has covered her living expenses, her mother's medical bills, as well as satisfied her curiosity and wanderlust. It's a true win-win.\n\n[Employment Consultation Logs]\n'Anna is getting ready to go to university and Lada wants to open a shop.\n'Sonya and Natalya have been plotting something they aren't saying yet, but Anna seems to know what it is... Doesn't matter, they'll call a meeting when they think the time is right.\n'Hehe, they'll come begging for help from Rosalind Velikaya. Can't do it without me!\n'I don't have any particular ideas right now. I just wanna wander for a bit.\n'Nothing wrong with that, right? I'm studying the stuff Anna tells me to study, I'm not slacking.\n'Also... I have to look after Mamochka. She still needs treatment.\n'I'm the reason she got sick in the first place. Now that she's stable, I've gotta take care of her. Make sure she doesn't go running off on her own into danger again.\n'Back to Ursus?\n'Hard to say. Maybe someday. Who knows?\n'I bet... Anna, and maybe Sonya, a couple of them, they're probably planning to go back. All their talk of moving and plans... it just makes my head hurt!\n'I don't get it, it's all so complicated.\n'Ugh, why rush things? The future comes with plenty of time.'",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "After some time, Leto finally gathers the courage to review her exams.\nLiterature: slightly better than last time. She definitely had time to finish reading the books that Natalya gave her, but it seems she didn't fully grasp the feelings of the characters. She just couldn't get a handle on all the twists and turns that Natalya was talking about.\nWhen it comes to the harder fields of math, physics, chemistry, and biology, she doesn't even need to look to know she'd just barely scraped by.\nNo way around it, Leto's completely hopeless in those subjects. But, as Sonya would say, she's not dumb, she just doesn't want to apply herself toward stuff she's not interested in. Ugh, is that supposed to be a compliment?\nSocial sciences... satisfactory. That actually surprises her a bit. She didn't study at all, just answered based on her life experiences. Seems everything she's been through in her daily life did come in handy after all!\nPhew, she breathes a sigh of relief, a subconscious smile appearing on her lips.\nThe hardest part is over, and now she's onto the good bits.\nUrsine Language—full marks!\nUra!\nElective courses in Leithanian, Siracusan, and Kjerag tongues also came back with excellent grades.\nWhile her results in Mandarin Yanese are only decent, she just picked that one up not long ago, so she's happy enough.\nShe already knew her performance in the languages would be good, but seeing her efforts pay off still gladdens her heart.\nWith the exam paper in hand ready to show Mamochka, Leto can't help but start to plan in her head—\nWhere will she travel next?",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1801,
      "atk": 550,
      "def": 311,
      "magicResistance": 10,
      "blockCnt": 2,
      "baseAttackTime": 1.3,
      "respawnTime": 70,
      "cost": 19
    }
  },
  "skins": [
    {
      "skinId": "char_194_leto#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_194_leto",
      "portraitId": "char_194_leto_1",
      "illustId": "illust_char_194_leto_1",
      "modelName": "Лето",
      "drawerList": [
        "Skade"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_194_leto#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_194_leto_2",
      "portraitId": "char_194_leto_2",
      "illustId": "illust_char_194_leto_2",
      "modelName": "Лето",
      "drawerList": [
        "Skade"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "2-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 957,
            "atk": 283,
            "def": 178,
            "magicResistance": 5,
            "cost": 17,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1368,
            "atk": 423,
            "def": 245,
            "magicResistance": 5,
            "cost": 17,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 70,
      "rangeId": "3-12",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1368,
            "atk": 423,
            "def": 245,
            "magicResistance": 10,
            "cost": 19,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 1801,
            "atk": 550,
            "def": 311,
            "magicResistance": 10,
            "cost": 19,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3221",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30032",
          "count": 5,
          "type": "MATERIAL"
        },
        {
          "id": "30012",
          "count": 4,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 80,
      "rangeId": "3-12",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1801,
            "atk": 550,
            "def": 311,
            "magicResistance": 10,
            "cost": 19,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 2280,
            "atk": 680,
            "def": 375,
            "magicResistance": 10,
            "cost": 19,
            "blockCnt": 2,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3223",
          "count": 3,
          "type": "MATERIAL"
        },
        {
          "id": "30044",
          "count": 7,
          "type": "MATERIAL"
        },
        {
          "id": "31023",
          "count": 10,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skcom_quickattack[3]",
      "skillName": "Swift Strike γ",
      "desc": "ATK <@ba.vup>+{atk:0%}</>; ASPD <@ba.vup>+{attack_speed}</>",
      "iconId": "skcom_quickattack",
      "spCost": 35,
      "initSp": 15,
      "duration": 35,
      "blackboard": [
        {
          "key": "atk",
          "value": 0.45
        },
        {
          "key": "attack_speed",
          "value": 45
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31023",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_leto_2",
      "skillName": "Answer the Call",
      "desc": "All [Ursus Student Self-Governing Group] Operators with skills ready activate their skills at the same time. Own ATK <@ba.vup>+{atk:0%}</>, attack an extra target, and ranged attacks no longer reduce ATK",
      "iconId": "skchr_leto_2",
      "spCost": 28,
      "initSp": 16,
      "duration": 25,
      "blackboard": [
        {
          "key": "atk",
          "value": 1.15
        },
        {
          "key": "attack@max_target",
          "value": 2
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30053",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_leto",
      "moduleName": "Leto's Badge",
      "desc": "Operator Leto has demonstrated a remarkable aptitude for wide-range enemy suppression.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Guard Operator during field operations to exercise Lord responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_leto",
      "moduleName": "The Old Clothes",
      "desc": "At first, not everyone got along particularly well.\nThat pretty much goes without saying.\nLada would silently hide behind Sonya. Anna wasn't any better; though she was clearly trying to keep her emotions in check, I could tell that she was panicking. Sonya felt like she had a duty to protect the others, so she kept her hand tightly gripped around her axe. I always thought her hand was going to slip one of these days.\nUnder that atmosphere, everyone was constantly on edge. And to make matters worse, nobody knew if what we were doing was right or wrong.\nLada wanted to be of help—she felt like she was always sheltered by Sonya, and was afraid of being left behind—so she'd go out and try to find us something to eat, though she came back with empty hands most of the times. Anna wanted the group to be more 'stable,' so she'd try to strike up conversations, but they seldom went the way she wanted. Sonya was generally in high spirits, but every so often she'd come back with an extra wound or two.\nEveryone did their best to get something done, as if they'd go mad if they didn't. Though sometimes, you could get rid of the 'as if' part.\nAs for me, I was never that scared in the first place, but it's not like I'd have been happy dying there. I didn't want to lose Sonya and the others either—we'd been friends already. So, I also did whatever I could: bringing back supplies, helping Sonya 'take out the trash,' and even teaching some harsh lessons to anyone who tried to lay their hands on Anna.\nAt first I thought things would get better, but it was actually the opposite. Lada and Anna started avoiding eye contact with me, and even Sonya would strangely glare at me. That's when I understood: I'd been robbing them of their agency.\nBut I was better at those things, so why shouldn't I do it?\nOf course, I was never the petty type, and it's not like Lada or Sonya really blamed me for that. I knew they were both real nice, we just didn't know how to get along back then. It wasn't until the day Sonya came back from a scuffle with a serious tear in her uniform and Anna used a sewing kit I'd scavenged to fix it up that I realized what I needed to do.\nI snuck into the warehouse, found some coats, and brought them to Anna to ask her if she could fix them up into something more cold-resistant. We'd need them later when the weather turned cold, and sure enough, she cheered up at that.\nAfter that, I risked my hide to steal some Reunion kitchenware for Lada so it'd be easier for her to cook, though obviously it was better to keep that part low-key. Her eyes lit up the instant she saw what I brought back.\nI even found some self-defense equipment for everyone, and modified them with Sonya. While we were working together, I thumped my chest and said to her: If there's anything you want, just say the word and I'll get it for you. Sonya stared at me for a while, but this time, she nodded.\nLooking back now, it was probably around then that our team actually started taking shape."
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "Make you a deal, Doctor. I'll help you with work, and you teach me whatever it is you're good at. What do you think? Shake on it?",
      "voiceAsset": "char_194_leto/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Doctor, you know this language, don't you? How do you pronounce this word…? Ooh, that's right! I remember now. I knew I could count on you, Doctor. Just wait till I get back from my trip, I'll have a souvenir for you!",
      "voiceAsset": "char_194_leto/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Heh! Hah—! Get up, all of you! Weren't you going to fight the USSG? Now look at you all, lying on the ground already! Bunch of babies. You don't see my girls much on the landship these days, but there was a time when we followed the Doctor around, conquering the world... Yow! Anna...? Why'd you hit me?",
      "voiceAsset": "char_194_leto/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Honey drunk? Who's honey drunk? Beehunter? I told her to slow down already, but she won't listen. And now she'sh all drunk and shays I'm the one getting... Wait... Doctor... Shtand shtill, shtop... shaking... yer making me dizzshy...",
      "voiceAsset": "char_194_leto/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "What are Sonya and the girls going to do? You're asking the wrong one, Doctor. We're friends, yeah. But aside from Lada, the rest of them don't really talk to me about that kinda stuff. Especially Sonya—she'll go to Anna when she needs something, maybe Natalya, but she'd never come to me.",
      "voiceAsset": "char_194_leto/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "Lada had a secret talk with me recently. Said she wants to open a little shop in Ursus, and we could all chip in and get our share. As for the shop, it'll be our headquarter. All the girls can have regular meetups there. And I can go over to hang out whenever I miss her, too. It's gonna be great!",
      "voiceAsset": "char_194_leto/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Has you-know-who been to Rhodes Island? Oh, so he spent a whole day sitting in the reception before you shooed him out...? Thanks for that. It's fine, I've got nothing to say to him anyway. Hmph, he wasn't there when I needed him, and now he feels bad enough to try to make up for it? Keep Dreaming!",
      "voiceAsset": "char_194_leto/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "What do I think? Ummm... first of all, you should stop treating us like kids. Come on, Doctor, you don't need to worry about us so much. If you have time, why don't you teach me a few more formulas for Anna's Math lessons? We've counted you as a friend all this time, so if there's really something bugging us, you'll definitely know.",
      "voiceAsset": "char_194_leto/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "I know we'll have to go our separate ways someday. But so what? We trust each other with our lives. The USSG won't fall apart, and we'll never forget the days we spent together. The same goes for you, Doctor. Call me anytime you need my help, and I'll be there, no matter what.",
      "voiceAsset": "char_194_leto/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Doctor, let me play you a refreshing tune on my guitar!",
      "voiceAsset": "char_194_leto/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Hey, Doctor. You already know me, do we really still have to do this? Formalities matter, huh? Fine. Leto of the Ursus Student Self-government Group. Reporting in!",
      "voiceAsset": "char_194_leto/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "Meh, I've seen this one.",
      "voiceAsset": "char_194_leto/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "Sooooo…. How long did it take for Sonya to get promoted?",
      "voiceAsset": "char_194_leto/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "What's this? Promotion gift for 'General Leto'? Ah... That's a name I've not heard in a long time. Time really flies, it's like years have gone by and I've done nothing.",
      "voiceAsset": "char_194_leto/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Field mission? Count me in!",
      "voiceAsset": "char_194_leto/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "For real? Are you trying to improve my teamwork again?",
      "voiceAsset": "char_194_leto/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "I'll lead the way!",
      "voiceAsset": "char_194_leto/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Requesting a solo op!",
      "voiceAsset": "char_194_leto/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "All warmed up!",
      "voiceAsset": "char_194_leto/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "I can go anytime.",
      "voiceAsset": "char_194_leto/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "I'm in tip-top shape today.",
      "voiceAsset": "char_194_leto/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "You're all dead! ",
      "voiceAsset": "char_194_leto/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "You thought that would knock me out?",
      "voiceAsset": "char_194_leto/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "You can't hide from me!",
      "voiceAsset": "char_194_leto/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Here's a few bolts to eat!",
      "voiceAsset": "char_194_leto/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "I'll take on all of you!",
      "voiceAsset": "char_194_leto/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Phew—I always thought I was pretty adventurous myself, but now? I think you really enjoy living life on the edge, Doctor.",
      "voiceAsset": "char_194_leto/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "We have to toast to occasions like these. Who wants in?",
      "voiceAsset": "char_194_leto/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "This isn't over! I can still fight!",
      "voiceAsset": "char_194_leto/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "No way I'm gonna swallow this... Can we go one more round?",
      "voiceAsset": "char_194_leto/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "I've been here a while, but I still gotta say... Rhodes Island is crazy big.",
      "voiceAsset": "char_194_leto/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "What? An ambush?",
      "voiceAsset": "char_194_leto/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Doctor, are you heading to Medical too? Let's go together!",
      "voiceAsset": "char_194_leto/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_194_leto/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "Doctor, the USSG's having a feast tonight too, so of course you're coming? Oh, also. Mama's gotten much better lately, so she's been thinking of hosting one of our own in a couple of days. But it'll be too quiet with just the two of us, so she asked me if you might be interested?",
      "voiceAsset": "char_194_leto/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Doctor, want a drink?",
      "voiceAsset": "char_194_leto/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Happy birthday! Here's a honey cake for you, I even asked Lada to teach me how to make it. I snuck a piece for myself, and it's real tasty, so you should hurry and try some! Honey drunk? Oh, yeah, no wonder I've been filling a little dizzy for a while now... Ah, look out! The cake!",
      "voiceAsset": "char_194_leto/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "Here, a souvenir from my last trip. It's pretty good, so you gotta try some. Is it me, or did Rhodes get a lot more crowded since I was away? I don't care if you keep onboarding more people, but you'd better make sure the USSG's clubhouse stays as-is, got it?",
      "voiceAsset": "char_194_leto/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "train_spd&profession[020]",
      "buffName": "Guard Expert α",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, <@cc.kw>Guard</> Operators' Specialization training speed <@cc.vup>+30%</>",
      "skillIcon": "bskill_train_guard1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "manu_formula_spd_P[000]",
      "buffName": "Through Thick and Thin",
      "desc": "When this Operator is assigned to a Factory and <@cc.kw>Gummy</> is in a Trading Post, <@cc.kw>Battle Record</> formula productivity <@cc.vup>+35%</>",
      "skillIcon": "bskill_formula_spd_sunbr",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}