{
  "id": "char_426_billro",
  "meta_info": {
    "name": "Carnelian",
    "appellation": " ",
    "voiceActor": {
      "en": "",
      "jp": "Eri Kitamura",
      "kr": "Park Seen-hee",
      "cn": "Cai Na"
    },
    "rarity": 6,
    "profession": "Caster",
    "subProfessionId": "Phalanx Caster",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "AoE",
      "Defense"
    ],
    "nationId": "Leithanien",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Carnelian\n[Gender] Female\n[Combat Experience] 6 Years\n[Place of Birth] Sargon\n[Date of Birth] Jan 17\n[Race] Caprinae\n[Height] 173cm\n[Infection Status] \nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Normal\n[Mobility] Normal\n[Physical Resilience] Excellent\n[Tactical Acumen] Standard\n[Combat Skill] Standard\n[Originium Arts Assimilation] Excellent",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Carnelian hails from an ancient tribe in the depths of Sargon, outside the control of the lords ameer. She is currently traveling abroad, and has taken long-term residence in Leithanien after coming under the employ of a Count Hohenlohe there. She has formed a partnership with Rhodes Island and, as one of its operators, carries out missions inside Leithanien's borders.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Carnelian shows no signs of Originium infection.\n\n[Blood Originium-Crystal Density] 0.12u/L\nBack home, Operator Carnelian rarely came into contact with Originium. She has also shown herself to be particularly healthy and strong. As a Sargon in Leithanien, she has a good understanding of her own health. As long as she takes proper precautions and doesn't get in any accidents, it shouldn't be hard for her to stay healthy and in good shape.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Carnelian's origins are no secret.\nShe comes from an old tribe that resides deep in Sargon's golden sands. Per the tribe's traditions, everyone must leave home to study abroad when they come of age. This Caprinae has been to many places, and aside from browsing and studying, her favorite pastime is buying some small, special souvenirs for herself... Had there not been any accidents, Leithanien would have been Carnelian's last stop. Fortunately or not, there was an accident.\nWhile she was taking a stroll in a certain Leithanian city, Carnelian bumped into the ruler of the territory. What's more, the Hyacinth Count, then still young, was unable to hide the fact that he was infected. As a result, she was detained, and what could have been a simple conclusion to her study trip got far more complicated.\nDespite the tense first meeting, as she started to spend time with him, the frail Leithanian count and Carnelian warmed up to each other. According to Carnelian, this might be because she was already used to dealing with kids, having helped raise her little sister, so the young count was like a bothersome little brother to her. In other words, a headache that would only turn into an even bigger headache if left unattended. However, there is no doubt now that she approves of the young count, who is in a tough situation, trying his hardest to hide his infection. Not only that, but she took it upon herself to protect him and aid him however she could.\nAs it turns out, Carnelian first made contact with Rhodes Island because she needed to discreetly obtain treatment for the count. In exchange for the medication that Rhodes Island is providing the count, she is assisting Rhodes Island as an operator with any affairs it is unable to conduct in Leithanien.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "The first impression that Carnelian usually leaves is that she is tall and confident, meticulous and full of vigor, capable of assigning tasks methodically, and always having a well-thought-out plan for everything around her. Nonetheless, for an attendant to a Leithanian count, she can be lacking in elegance and delicacy. On the other hand, as a Sargonian, her words and demeanor can also seem somewhat restrained. These contradicting aspects both factor into Carnelian's own unique disposition. Those who don't know her well enough would likely be confused by the Caprinae's easygoing personality and mistake her for a friendly woman.\nOver time, as her partnership with Rhodes Island continued, Carnelian's own personality became apparent to all those who interact with her. She may seem charming and open, getting along with the other operators well, and always wearing a smile on her face, but it would be a mistake to forget Carnelian hails from Sargon. All those who fought alongside her described her with words like 'fierce,' 'violent,' and 'cruel.' The elegant, exquisite techniques she demonstrates in battle are all facades imposed upon her by Leithanien to hide her primal thirst to attack.\nCarnelian doesn't try to hide her true self much. No matter the circumstance, she does things according to her principles. Be it the kindness she shows her friends or her cruelty toward those she sees as her enemies, she will never hold back. Leithanien can never truly keep such a Sargonian in check.\nThat said, Carnelian, the self-proclaimed 'qualified big sister,' does try to calm down a little when her actual little sister and the little brother that she 'picked off the streets' are around to maintain a gentle image—Whether she succeeds at doing so is up for debate, though.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "As one of the conditions of our quid pro quo, Carnelian is registered as an external operator at Rhodes Island. However, whenever anyone tries to look up Carnelian's operational records with insufficient permissions, all they will receive is a falsified message that claims she is 'currently on a secret mission.' This is the very first request that Carnelian made when she was listed as a Rhodes Island operator.\nCarnelian explained that she has a little sister with whom she is fairly close. Thanks to the disruption in her study plans, it has been two years since she took up residence in Leithanien. Soon, her sister will come of age, and it will be her turn to follow the tribe's tradition and leave on a journey. Because of the restrictions that come with her job in Leithanien and the fact that she doesn't want to get her sister mixed up in this affair, she has avoided reaching out to her sister. As a result of her overprotectiveness, while she has no qualms about putting herself in danger, she fears putting those whom she holds dear in even the slimmest chance of danger.\nNow that she is also a Rhodes Island operator, Carnelian has made it clear she wishes to use this status to make contact with her sister. If her sister comes to Rhodes Island, she will find out that Carnelian is carrying out a secret operation, and once Carnelian catches wind of this, she will find the right time to 'finish her mission and come back to Rhodes Island,' so to speak, to reunite with her family.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "The pride and egotism that Leithanian nobles show for their bloodline is likely unimaginable to anyone from outside the country. Indeed, it may be hard for an outsider like Carnelian to truly understand this place. While, to most Leithanians, outsiders may indeed be able to temporarily seize glory and step into the spotlight, but those without roots here will find this fabricated fame disappear in no time. Carnelian scoffed at this idea. According to her, even the most pureblooded of nobles frequently find themselves having to tread each of their steps carefully.\nShe recounted the following story to us:\nAfter the House of Hohenlohe was defeated in a conspiracy perpetrated by their political enemies, there was only a young boy left to succeed to the family's title. Unfortunately, the boy was also infected during the upheaval.\nGiven the situation, it would be extraordinarily dangerous to contact outside medical organizations or pharmaceutical companies. In the end, it was Carnelian, the girl who chose to stay behind to mind other people's business, who persuaded the count to get treatment. Carnelian is undoubtedly a careful and perceptive woman who is nonetheless honest to her feelings, and she has never tried to change this.\nThe House of Hohenlohe's political enemies or their pride are the least of her worries, as the only thing that's on her mind is the child's condition.\nFortunately, after their careful deliberation, the Hohenlohes decided against contacting massive conglomerates or organizations, instead, they picked out Rhodes Island from their long lists of companies to reach out to.\n\n[Classified Log]\nThe assistance we are providing to one side of the struggle in Leithanien has caused a rift between our members. As such, I would like to elaborate on my own personal view of the issue.\nIt has been some time since the Twin Empresses took over from Leithanien's Witch King. The country has recovered from that terror, and the nobles have regained control. We have already seen far too many ugly power struggles occur under the Empresses' eyes. It's not unreasonable that some of you are worried about our hasty decision to take sides, that it may destabilize our standing and lead us down a path detrimental to our original purpose. This speculation is reasonable, and it is of course important to be cautious and to take all necessary considerations carefully.\nRegardless, I must maintain my standpoint:\nProviding treatment to Oripathy patients has been and will remain Rhodes Island's foremost objective, and we will never abandon the patients who seek our help regardless of their status or standing.\n—Spokeswoman Amiya",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "As both sides' trust for each other continues to deepen, during her time with Rhodes Island, Carnelian has revealed to us crucial nuggets of information more than once.\nEvidently, the Sargonian has her own ideas about what's going on around her. This not-so-discreet intimation may be a kind of test or a kind of advance notice. It could even be a sign that she needs our help. If we trust that everything she says is true and sincere, then those thoughts evidently have long lingered in her mind. Perhaps she has already pondered these ideas over and over for a long time, and given the right opportunity, she will likely put her plans into action.\nPerhaps it won't be long before she openly requests further help from us.\nWhen that time comes, what should Rhodes Island do? It would be a difficult question to answer.\n\nAside from this, there is one thing that we should pay extra attention to:\nWhile it is a good thing to be trusted and loved, we mustn't let our guard down. Carnelian seems intent on bringing home everything that catches her eye.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1726,
      "atk": 727,
      "def": 198,
      "magicResistance": 15,
      "blockCnt": 1,
      "baseAttackTime": 2,
      "respawnTime": 70,
      "cost": 24
    }
  },
  "skins": [
    {
      "skinId": "char_426_billro#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_426_billro",
      "portraitId": "char_426_billro_1",
      "illustId": "illust_char_426_billro_1",
      "modelName": "Carnelian",
      "drawerList": [
        "カワグチ"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_426_billro#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_426_billro_2",
      "portraitId": "char_426_billro_2",
      "illustId": "illust_char_426_billro_2",
      "modelName": "Carnelian",
      "drawerList": [
        "カワグチ"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_426_billro@summer#8",
      "skinName": "Shimmering Dew SD08",
      "skinGroupName": "Coral Coast/VIII",
      "skinGroupId": "2022#summer",
      "avatarId": "char_426_billro_summer#8",
      "portraitId": "char_426_billro_summer#8",
      "illustId": "illust_char_426_billro_summer#8",
      "modelName": "Carnelian",
      "drawerList": [
        "カワグチ"
      ],
      "description": "<color name=#ffffff>MARTHE [Coral Coast] Shimmering Dew Series SD08. Tight-fitting, lightweight, breathable, and designed for the summer.</color>",
      "rarity": 86
    },
    {
      "skinId": "char_426_billro@snow#3",
      "skinName": "Hohenlohe Chillysand",
      "skinGroupName": "Icefield Messenger/III",
      "skinGroupId": "2021#xmas",
      "avatarId": "char_426_billro_snow#3",
      "portraitId": "char_426_billro_snow#3",
      "illustId": "illust_char_426_billro_snow#3",
      "modelName": "Carnelian",
      "drawerList": [
        "カワグチ"
      ],
      "description": "Carnelian's winter outfit in Leithanien / Hohenlohe Chillysand. A traditional Leithanian women's trenchcoat with a pair of animal skin shawls and fleece gloves. Fear not the cold.",
      "rarity": 116
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "x-4",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1104,
            "atk": 435,
            "def": 146,
            "magicResistance": 15,
            "cost": 22,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1380,
            "atk": 581,
            "def": 170,
            "magicResistance": 15,
            "cost": 22,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "x-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1380,
            "atk": 581,
            "def": 170,
            "magicResistance": 15,
            "cost": 24,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1726,
            "atk": 727,
            "def": 198,
            "magicResistance": 15,
            "cost": 24,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3251",
          "count": 5,
          "type": "MATERIAL",
          "name": "Caster Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_CST1"
        },
        {
          "id": "30062",
          "count": 5,
          "type": "MATERIAL",
          "name": "Device",
          "rarity": 2,
          "iconId": "MTL_SL_BOSS2"
        },
        {
          "id": "30032",
          "count": 5,
          "type": "MATERIAL",
          "name": "Polyester",
          "rarity": 2,
          "iconId": "MTL_SL_RUSH2"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "x-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1726,
            "atk": 727,
            "def": 198,
            "magicResistance": 15,
            "cost": 24,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 2106,
            "atk": 846,
            "def": 228,
            "magicResistance": 15,
            "cost": 24,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3253",
          "count": 4,
          "type": "MATERIAL",
          "name": "Caster Dualchip",
          "rarity": 5,
          "iconId": "MTL_ASC_CST3"
        },
        {
          "id": "30135",
          "count": 4,
          "type": "MATERIAL",
          "name": "D32 Steel",
          "rarity": 5,
          "iconId": "MTL_SL_DS"
        },
        {
          "id": "30104",
          "count": 7,
          "type": "MATERIAL",
          "name": "RMA70-24",
          "rarity": 4,
          "iconId": "MTL_SL_RMA7024"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_billro_1",
      "skillName": "Sandstorm Guardian",
      "desc": "ATK <@ba.vup>+{atk:0%}</>, DEF <@ba.vup>+{def:0%}</>;\n<$ba.charged>Charged</> effect: Trait effect remains active during skill",
      "iconId": "skchr_billro_1",
      "spCost": 18,
      "initSp": 5,
      "duration": 20,
      "blackboard": [
        {
          "key": "atk",
          "value": 0.6
        },
        {
          "key": "def",
          "value": 1
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30063",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 9,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_billro_2",
      "skillName": "Sand Fetters",
      "desc": "Attack Interval <@ba.vup>reduces significantly</> and every attack inflicts <$ba.sluggish>Slow</> for {attack@sluggish} seconds;\n<$ba.charged>Charged</> effect: ATK <@ba.vup>+{atk:0%}</> and instead of <$ba.sluggish>Slowing</>, <$ba.root>Binds</> targets for <@ba.vup>{attack@root}</> seconds",
      "iconId": "skchr_billro_2",
      "spCost": 25,
      "initSp": 10,
      "duration": 25,
      "blackboard": [
        {
          "key": "base_attack_time",
          "value": -1.1
        },
        {
          "key": "attack@sluggish",
          "value": 0.3
        },
        {
          "key": "atk",
          "value": 0.2
        },
        {
          "key": "attack@root",
          "value": 0.6
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31013",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 10,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_billro_3",
      "skillName": "Mark of Gluttony",
      "desc": "Attack Range <@ba.vup>expands</> and ATK gradually increases up to <@ba.vup>+{atk:0%}</>\n<$ba.charged>Charged</> effect: Every attack increases the damage taken by the target from Carnelian by <@ba.vup>{attack@damage_scale:0%}</> (stacks up to <@ba.vup>5</> times), lasting until the end of the skill",
      "iconId": "skchr_billro_3",
      "spCost": 28,
      "initSp": 5,
      "duration": 21,
      "blackboard": [
        {
          "key": "atk",
          "value": 2.8
        },
        {
          "key": "attack@damage_scale",
          "value": 0.2
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30083",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_billro",
      "moduleName": "Carnelian's Badge",
      "desc": "Operator Carnelian has demonstrated a remarkable aptitude for inflicting well-timed Arts casualties on a large scale.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Caster Operator during field operations to exercise Phalanx Caster responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_billro",
      "moduleName": "Hyacinth and Dagger",
      "desc": "Having hastily finished his dinner, Hohenlohe has just about stepped into his villa's quarters for the night when Carnelian appears behind him without warning.\n'What are you doing here so late?'\n'You had worries, and I've just seen to them. I'm here to report in, of course.'\n'Oh, I see.'\nA gust of night air blows through the room, mile-long curtains fluttering restlessly. Having left his Spire for the moment so as to smooth out tomorrow's parade, the Count feels the air faintly nip at him.\n'Hold on, what made you—no, let me restate. Can you even <i>be</i> that quick?'\n'Of course.'\n'Really? Well, I'll make one more check, just on the off-chance. Given tomorrow's parade, you—'\n'Off-chance? Don't you have faith in me?'\n\nMuch like one would enrage at a habitually interrupting bodyguard, the Count stomps his feet forcefully.\n'How could I have faith? Are you to say an instrument can be so quickly learned? What, did you take up the triangle?'\n'You surmise well.'\n'Do I now? You plan to show up to my parade tomorrow tinkling on the triangle?!'\n'Exactly. And by the way, all triangle lovers take grave offense at your words.'\n'You—! You might recall I had every other bodyguard playing <i>music</i> at last year's visits, while you alone stood there doing nothing, making us all look like fools!'\n'And <i>you</i> insisted I act like a member of the bodyguards last month, when an envoy came from the next city over. If you'll remember, when he affixed a tapping device under the table, I drew my weapon across his throat by reflex <i>before</i> remembering I was holding a trumpet, not a sword.'\n'Carnelian!!'\n'I'll be blunt—looking after you takes enough of my energy. I'm certainly not disposed to learn an instrument for you.'\n'I don't care! I demand you learn! I demand it!'\nThe Count glares at his unrepentant attendant with all the temper of a small child, ultimately not so furious as to pounce at anything—he simply slams the door as he leaves.\n\nBut the moment the door latches shut, Carnelian places a firm grip on the dagger at her waist.\n'Alright, you behind the curtain. Come out.\n'An assassin sent by the diet, I presume? And you really think that once the Count is dead and his cousin succeeds the title in all his ambition, he'll grant the Stadtrat autonomy?\n'No. Forget that. Here's a different question. Would you prefera sophisticated death, or one more to-the-point?\n'...Well, if you won't say anything, can I take that as the dealer's choice?'\nThe assassin barely has time to twitch before the curtain becomes a pair of lips, the bookshelves jaws, and the candles incisors. One massive chomp on their windowside prey is followed by chewing, then a swallow, and finally a mess all over the floor.\n\n'It's over now. Won't you come in?'\nThe Count pokes his head through the door to confirm that all danger has passed, then musters all his courage before entering.\n'Very swift to react, and on-point with the improvisation as well. Quite well done.'\n'I don't need you complimenting me.'\nThe two of them stare at the villa bedroom, a scene of chaos and scraps and fresh blood, neither breaking the silence.\nIt isn't the first unsuccessful assassination attempt, but all previous ones have taken place at Count Hohenlohe's Spire, which is hardly dilapidated enough to let would-be murderers as far as the sleeping quarters.\nAfter a spell, the Count breaks the tension.\n'Carnelian.'\n'What? I can't exactly use my Arts to clean rooms.'\n'And I wasn't expecting you to.'\n'Good call.'\n'I wanted to ask, are you really not going to learn an instrument?'\n'Oh? So you <i>are</i> scared of losing face after all?'\n'As if! No, it's no more than a bit of curiosity. You—'\nThe Count's face flushes red. He stammers silently. Eventually, having not said a word further, he turns to flee the bedroom.\nCarnelian shakes her head. The hyacinths by the head of the bed catch her eye. In front of them lies an implement nominally for self-defense, but hardly useful in practice, save for offering the Count a little mental assurance—a dagger.\nThough yet to nestle in anyone's flesh, blood has dyed its blade a deep carmine."
    },
    {
      "moduleId": "uniequip_003_billro",
      "moduleName": "Always Have Your Back",
      "desc": "Sargonian has a noun to describe a very particular emotion, 'the pleasant surprise of finding the familiar in somewhere strange.' In this, you can see the significance of the local accent to Sargonians. However, one time, Beeswax made a sudden appearance in a Leithanian restaurant where she seated herself right across the table from her sister, and as Carnelian's hand slowly fell from her in-ear comms terminal, her expression flickered with rare alarm.\n'S... Surprise? Heheh...'\nIn a snap, Carnelian shut off her receiver.\nIt wasn't as if Beeswax forgot her sister's advice to keep away from Leithanien. Abashed, she explained that she was just passing through. A paper-thin lie; Carnelian could already imagine which Rhodes Island operator had needlessly put her up to the task.\nShe wasn't especially dismayed, of course. She positively coddled Ankhesena, indulging every anecdote from her journey, their table the picture of love and peace. Meanwhile, in her ear, a very different picture was being painted.\n'Boss! Do you copy! The target's about to enter the Arts Circle focus!'\n'She was laying low, right?! Did shit go down at the restaurant?!'\n'Sis, what's that buzzing coming from your ear?'\n'Oh, it's just music. The Leithanians aren't half bad at it. You'd like it.'\n'Boss! Are you there?!'\nCarnelian sighed and got up. 'It's a little noisy, though. Give me a moment to go and adjust it.'\nThe 'music' her sister mentioned caused Beeswax some turmoil. It'd been years since they last met, during which this strange country had clearly changed her sister—for someone accustomed to the most beautiful melodies, would she really like whatever <i>that</i> was? Beeswax clutched her bundle tight, too shy to open it.\nCarnelian returned, astonishingly quickly. She took off her terminal, finally able to show a relieved smile.\n'What about your music, Sis?'\n'It's over. I have more important things still waiting for me to sample—'\nA word from home, to signify an emotion. Fit to describe the soothing, settling look in Carnelian's eyes, as if by some Originium Arts... It blew Beeswax's worries away. At last, she pulled the item of the hour out of her bag—a plain Sargonian sistrum, distinctly out of place in Leithanien.\n'Oh! And I thought you'd lost that forever ago! That's the only instrument I can even play.'\nJingle, jangle. The warm, rustic sound of home.\n'That takes me back. It's what I always soothed you with when you were little. Do you still remember that?'\n'Your work must be really important, what you're doing in Leithanien.'\n'What? No, I've only been...'\n'Remember to stop sometimes, and listen to it, okay? Just sometimes... when you're too busy to reply, and you don't have time to visit home, just listen to it...'\nCarnelian relented, her gaze turning soft. <i>Alright, I'll remember to write back, and I'll make my way home again as soon as I can,</i> she wanted to say. But she didn't make that promise—it's one she had no idea when she'd be able to keep, if ever. Instead, she picked up the sistrum and gave it a light shake.\nHow very, very curious. Here, in a Leithanian restaurant, she could almost hear the rustling of the leaves on Sargon's trees... She and Ankhesena always liked to call it the forest playing to them. They used to love it."
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "You pulled an all-nighter, and you're still not done? Sheesh, what should I do with you...? How much do you have left? I'll help. You should get some rest. Work on your time management next time.",
      "voiceAsset": "char_426_billro/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "I can confirm we've received this shipment of medicine without issues. The quantities are right. As for the payment, could you please let Kal'tsit know I'll take care of that pain-in-the-neck mission for her.",
      "voiceAsset": "char_426_billro/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Count Hohenlohe, some call him the Hyacinth Count. The way I see it, he's quite a handful with that personality of his. I'm serving as attendant to this Leithanian noble family because of some trouble. What trouble, you ask? Hm... Let's keep this a secret for the time being.",
      "voiceAsset": "char_426_billro/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "That little squirt... Her codename here is uh... Beeswax? Looks like she tripped in the hallway this morning. Can she really cut it? She sure knows how to keep her sister worrying.",
      "voiceAsset": "char_426_billro/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "Rhodes Island provides what the count and I need. In return, I take care of Rhodes Island's troubles in Leithanien. This is what you call a win-win situation, isn't it? Come, shake my hand. This is the beginning of a beautiful friendship, Doctor.",
      "voiceAsset": "char_426_billro/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "The Leithanians' research on Arts has far exceeded my expectations, and their architecture, music, and education... All are worthy of study. One day, I will bring all this back home. Yeah, and I might bring something else along, though.",
      "voiceAsset": "char_426_billro/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "The longer we acclimate to an environment and the different people there, the harder it will get for us to free ourselves, and eventually we'll be made to fit its mold... Don't you agree, Doctor? Well, that's not going to get me tied down here. Not unless I allow it.",
      "voiceAsset": "char_426_billro/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "I'm sure the nobles think of me as an odd thorn in their side. No matter. I don't mind. Though I'd rather keep all this trouble a secret from Beeswax. It's too dangerous... Well, now that I mention it, I can't quite stop worrying about you, either.",
      "voiceAsset": "char_426_billro/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "If it's at all possible, I'd rather stay out of the nobles' bickering. Do you know how much I have to worry about each and every day with all the chaperone work and missions I have? Maybe I should talk the count into letting me hop over here full time. I'm counting on you to help me when the time comes, Doctor.",
      "voiceAsset": "char_426_billro/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "My little sister sometimes talks in her sleep. This one time, I even caught her talking bad about me. Heheh, Doctor, do you know what you said in your sleep the other day?",
      "voiceAsset": "char_426_billro/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Hello, you must be the Doctor? I'm Carnelian, attendant to Count Hohenlohe... Oh, I'm just a normal operator here at Rhodes Island. Watch what you say around my sister, okay?",
      "voiceAsset": "char_426_billro/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "I see. This is worth studying.",
      "voiceAsset": "char_426_billro/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "There is no need, but I appreciate your sentiment. Thank you.",
      "voiceAsset": "char_426_billro/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "You see, there's a huge number of people and things that I can't stop worrying about, and that number is growing by the day. It's been a while since I was able to do as I please, but since you're up for it... Well, let's put on a show.",
      "voiceAsset": "char_426_billro/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "This is not part of our agreement, but fine. I'm happy to help.",
      "voiceAsset": "char_426_billro/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Don't worry. I'll bring everyone back.",
      "voiceAsset": "char_426_billro/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Follow the plan, everyone!",
      "voiceAsset": "char_426_billro/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Elegance and etiquette are the way of nobility. Not mine.",
      "voiceAsset": "char_426_billro/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "As you wish.",
      "voiceAsset": "char_426_billro/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Between a refined combat style or something more direct, which do you prefer?",
      "voiceAsset": "char_426_billro/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "It's been a long time since my blood boiled like this.",
      "voiceAsset": "char_426_billro/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Greetings... Let's forgo the bothersome formalities and get this thing started.",
      "voiceAsset": "char_426_billro/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Gnaw them to shreds and drink their blood!",
      "voiceAsset": "char_426_billro/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Run them down and beat them to a mash!",
      "voiceAsset": "char_426_billro/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Careful! Don't let me tear you to shreds so quickly!",
      "voiceAsset": "char_426_billro/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "My oh my, what a pitiful sight. Why are you covered in blood all over?",
      "voiceAsset": "char_426_billro/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Nothing to worry about then. That was easy enough for you.",
      "voiceAsset": "char_426_billro/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Okay, that concludes the mission, and right on time, too... Are you hurt, Doctor?",
      "voiceAsset": "char_426_billro/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Calm down. Just leave the rest to me. They won't get away.",
      "voiceAsset": "char_426_billro/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Fall back, now! Don't panic. As long as I'm still standing, no one will touch you!",
      "voiceAsset": "char_426_billro/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Just as I thought. I can relax better in a room without much decoration.",
      "voiceAsset": "char_426_billro/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Oh... Watch out. My horns could get you.",
      "voiceAsset": "char_426_billro/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "What's wrong? Are you tired? Get some rest. You've worked hard enough already.",
      "voiceAsset": "char_426_billro/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_426_billro/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "My horns look especially good today? Thank you. It was my sister who insisted on giving me horn care. I might as well assume that such things bring good luck for the new year. Having experienced a variety of customs, people's feelings when praying for new beginnings are always similar.",
      "voiceAsset": "char_426_billro/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "More work today? Don't spend the whole day sitting, Doctor.",
      "voiceAsset": "char_426_billro/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Happy birthday, Doctor. I am not one to play the sycophant on such occasions, but I'm willing to offer you a gift as a friend. This gramophone is for you, and when next I travel between Rhodes Island and Leithanien, I'll be sure to back some records.",
      "voiceAsset": "char_426_billro/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "Rhodes Island is a partner that keeps its promises, but true partners need connections deeper than contracts. No, Beeswax has grown up, and her relationship with Rhodes Island is her own business. What we are discussing now is between you and me.",
      "voiceAsset": "char_426_billro/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "train_spd&profession[050]",
      "buffName": "Caster Expert α",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, <@cc.kw>Caster</> Operators' Specialization training speed <@cc.vup>+30%</>",
      "skillIcon": "bskill_train_caster1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "train_spd&profession[150]",
      "buffName": "Within One's Grasp",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, <@cc.kw>Caster</> Operators' Specialization training speed <@cc.vup>+60%</>",
      "skillIcon": "bskill_train_caster3",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}