{
  "id": "char_4015_spuria",
  "meta_info": {
    "name": "Spuria",
    "appellation": " ",
    "voiceActor": {
      "en": "Kelly Baskin",
      "jp": "Yuuri Miyamoto",
      "kr": "Park I-seo",
      "cn": "Ziyi Qin"
    },
    "rarity": 5,
    "profession": "Specialist",
    "subProfessionId": "Geek",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "Support",
      "DPS"
    ],
    "nationId": "Laterano",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Spuria\n[Gender] Female\n[Combat Experience] 1 year\n[Place of Birth] Laterano\n[Date of Birth] Aug 20\n[Race] Sankta\n[Height] 159 cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Normal\n[Mobility] Excellent\n[Physical Resilience] Standard\n[Tactical Acumen] Standard\n[Combat Skill] Excellent\n[Originium Arts Assimilation] Normal",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "A native of Laterano, real name Serpilia. Spuria was dispatched to Rhodes Island alongside Executor Richele by the Sixth Tribunal of the Lateran Curia following the Ambrosii Incident.\nShe is an expert in firearms technology, and proficient in communications and mechanical engineering. She is currently a visiting associate of the Engineering Department.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Spuria shows no signs of Originium infection.\n\n[Blood Originium-Crystal Density] 0.11u/L\nOperator Spuria has a strong sense of safety awareness. Her blood Originium-Crystal density is so low one suspects she does not leave home at all.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Based on her training data, Operator Spuria demonstrates well-above average shooting accuracy, adaptability, and proficiency at firing on the move against other moving targets. However, she seems to consciously avoid overreliance on firearms, unlike most Sankta operators from Laterano. Instead, she actively employs drones and information warfare in combat.\nAlthough she has declined to explain why she prefers not to rely entirely on guns, she is happy to demonstrate her proficiency in engineering and firearms technology. She often spends her free time in her room, working on drones and other gadgets. At Closure's recommendation, she began to visit Rhodes Island's workshop, sharing her knowledge with other engineers. Today, she is considered a trusted partner by both our Sankta operators and the Engineering Department, and their go-to if the engineers of Repair Workshop 3 are absent—which they often are. In case Spuria declines—perhaps claiming to be too tired to visit the workshop or that she has not washed her hair—operators are advised to promise to sign-in for her at the next regular meeting, and to bring the equipment in need of repairs directly to her room. Operators should also note, however, that her modifications have been known to cause other 'issues' from time to time.\nIt took considerable time for Spuria to build up her good relationships with others by repairing their equipment. She began by accepting online or phone commissions, and drones could often be spotted delivering broken equipment to her room, or repaired equipment back to their owners. As no one had seen her in person at the time, rumors began to spread that she was too overweight to leave her room.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Audio Log]\n'Hey, did you hear about how a bunch of operators in Medical called in sick?'\n'A pathogen leak? Or just overwork from having too many patients?'\n'No, I heard there was something involving some rarely used medical equipment in the old storage room...'\n'Old storage room? You don't mean the one that used to...'\n'Exactly, which is why no one's been in there for ages. Anyway, it was bad enough to have to go into that dark, scary place, but then they started hearing strange voices.'\n'What?'\n'Not only that, the white cloth covering the equipment started swaying eerily. One of them even saw a semi-transparent figure in a corner!'\n\n[Announcement from the Medical Department]\nThe Medical Department has completed its preliminary investigation into the rumors surrounding the so-called 'Mystery of the Storage Room.' To protect the privacy of those involved, no public report will be issued. However, in order to prevent similar incidents in the future, the Medical Department hereby announces the following regulations:\n1. Without express permission, no drones or other appliances with voice or holographic projection functions are permitted into restricted areas, including surgery rooms, intensive care units, and equipment storage rooms.\n2. Non-Medical personnel who wish to study the medical equipment may submit a request to Dr. Kal'tsit in writing. Or just come to the surgery room. Don't use hacking and drones for this sort of thing!\n3. Don't use 'studying medical equipment' as an excuse to scare people with drones!\n4. Don't deliver your written request via drone! Come in person!",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Operator Spuria previously worked as a communications engineer at the Laterano Municipal Office. She currently works for the Sixth Tribunal, which is responsible for civic matters, education, and health. Although she is known to be eccentric even by the standards of our other Lateran operators, she is quite willing to use her tech skills to help people solve small issues in exchange for repayment, such as rescuing trapped pets, manipulating traffic signals and school bells, or other 'interesting' problems.\nWhile she was a student, she was repeatedly disciplined for hacking the school bells. In one case, a sociology teacher showed signs of dehydration after lecturing for five hours straight, without a bell to signal the end of the period. Investigations revealed that Spuria had disabled the school's timekeeping system. When questioned, she answered, 'I just wanted him to take up the classroom a little while longer so I wouldn't have to go to tech ethics class. How was I supposed to know he could talk that long?'\nDespite numerous incidents, Spuria was never expelled. While she rarely attended class, she helped the school develop a highly efficient system for teaching and administration, greatly reducing administrative workload. This is also why she was able to remove any disciplinary action from her record. The headmaster even waived her attendance requirements after she secured him the best seats at a popular singer's concert. While the school may have turned a blind eye to her eccentricities, she did receive 'discipline' from other sources, such as Lemuen, the head prefect of the student council. While no record remains of their interactions as students, the two of them are known to be close, even now.\nInterestingly, Spuria was recommended to the Curia not long after Lemuen recovered from her injuries and joined the Seventh Tribunal, responsible for intelligence, foreign affairs, and national defense. Spuria was first offered a post at the Seventh Tribunal as well, but surprisingly she declined, preferring to work at the civic-focused Sixth Tribunal.\n'Technology exists to be used. It's only fitting that my drone goes to class in my place!'\n'You want to skip class, and I want you to attend.\n'So how about this: Either you get up in the next 10 minutes, or I give your teacher and classmates a call, and let you explain to them the little drone you invented.'",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Inquiries with Operators Spuria, Insider, and Executor have helped us piece together a picture of what happened at the Sanctilaminium Ambrosii. After expressing our condolences for what the inhabitants had been through, we determined that the tragedy could not have been averted by the efforts of a few, and that Spuria and the others present would benefit from moving on. While we do not believe that she is responsible for Fortuna's fall, it was apparent that she continues to feel guilt over it.\nWe were concerned that, after witnessing the fall of a Sankta from up close, Spuria would associate what happened with the 'unusual choice' she made. However, from what we've observed, she is not trying to shoulder responsibility for the entire incident herself. Indeed, her feelings of guilt have actually had a positive influence on her.\nSince her student days, Operator Spuria has devoted her full attention to the study of precision technology, but only out of curiosity and laziness. Lemuen helped her realize that the technology she knew had little practical application, which led her to join the civic-focused Sixth Tribunal. Then, the fall of Fortuna made her rethink her responsibility towards guns as a Sankta, and she realized that her expertise in firearms technology could help more Sankta fulfill their own responsibilities and prevent future tragedies. This was the practical value of technology she had sought.\nOperator Spuria takes regular shore leaves, revealing little about the purpose of these trips other than that she is helping out the Sixth Tribunal. We have strong reason to believe, however, that she is visiting Fortuna and carrying out her 'duty of oversight.'",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[System Log]\nWelcome to the Rhodes Island human resources database. Authenticating...\nAuthentication successful. You have full access permissions.\nWhat may I help you with?\nParsing request...\nRequest: Operator Spuria's field mission records\nTotal records: 22\nRated as 'exceeded expectations': 19 times\nOperator Spuria's mission performance has been excellent. Although she has indicated that she prefers not to take field missions, when she does, she performs at a high level.\n......\nRequest: Operator Spuria's regular meeting attendance\nTotal instances: 54\nPersonal attendance: No data found\nDrone attendance: 36\nSign-ins identified to be by proxy: 14\nDespite her lack of attendance at regular meetings, Operator Spuria downloads and reviews all meeting minutes and conforms to all resolutions.\n......\nRequest: Operator Spuria's shore leave requests\nTotal requests: 10\nShortest: 6 minutes\nLongest: 73 days\nOperator Spuria's recent shore leaves have gradually increased in length, and she has requested sick leave upon returning each time, citing leg pains. Increased attention to her physical condition is recommended.\n\n'A health checkup? No, I don't need one, really, I've just been walking a lot.\n'Fortuna has actually settled in with those Sarkaz, so I can finally take my eyes off her for a while. Taking a walk around their new home and eliminating any potential threats is a kind of oversight, right?'",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1514,
      "atk": 549,
      "def": 110,
      "magicResistance": 10,
      "blockCnt": 1,
      "baseAttackTime": 1.3,
      "respawnTime": 70,
      "cost": 12
    }
  },
  "trait": [
    {
      "unlockCondition": {
        "phase": "PHASE_0",
        "level": 1
      },
      "requiredPotentialRank": 0,
      "blackboard": [
        {
          "key": "hp_ratio",
          "value": 0.03
        }
      ],
      "overrideDescription": "",
      "prefabKey": "",
      "rangeId": null
    }
  ],
  "skins": [
    {
      "skinId": "char_4015_spuria#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_4015_spuria",
      "portraitId": "char_4015_spuria_1",
      "illustId": "illust_char_4015_spuria_1",
      "modelName": "Spuria",
      "drawerList": [
        "おぐち"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_4015_spuria#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_4015_spuria_2",
      "portraitId": "char_4015_spuria_2",
      "illustId": "illust_char_4015_spuria_2",
      "modelName": "Spuria",
      "drawerList": [
        "おぐち"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "3-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 805,
            "atk": 233,
            "def": 53,
            "magicResistance": 10,
            "cost": 10,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1150,
            "atk": 389,
            "def": 82,
            "magicResistance": 10,
            "cost": 10,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 70,
      "rangeId": "3-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1150,
            "atk": 389,
            "def": 82,
            "magicResistance": 10,
            "cost": 12,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 1514,
            "atk": 549,
            "def": 110,
            "magicResistance": 10,
            "cost": 12,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3281",
          "count": 4,
          "type": "MATERIAL",
          "name": "Specialist Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_SPC1"
        },
        {
          "id": "30032",
          "count": 5,
          "type": "MATERIAL",
          "name": "Polyester",
          "rarity": 2,
          "iconId": "MTL_SL_RUSH2"
        },
        {
          "id": "30052",
          "count": 2,
          "type": "MATERIAL",
          "name": "Polyketon",
          "rarity": 2,
          "iconId": "MTL_SL_KETONE2"
        }
      ]
    },
    {
      "maxLevel": 80,
      "rangeId": "3-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1514,
            "atk": 549,
            "def": 110,
            "magicResistance": 10,
            "cost": 12,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1893,
            "atk": 662,
            "def": 138,
            "magicResistance": 10,
            "cost": 12,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.3,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3283",
          "count": 3,
          "type": "MATERIAL",
          "name": "Specialist Dualchip",
          "rarity": 5,
          "iconId": "MTL_ASC_SPC3"
        },
        {
          "id": "31034",
          "count": 7,
          "type": "MATERIAL",
          "name": "Crystalline Circuit",
          "rarity": 4,
          "iconId": "MTL_SL_OC4"
        },
        {
          "id": "31053",
          "count": 9,
          "type": "MATERIAL",
          "name": "Compound Cutting Fluid",
          "rarity": 3,
          "iconId": "MTL_SL_CCF"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_spuria_1",
      "skillName": "Seize the Moment",
      "desc": "After deployment, ASPD <@ba.vup>+{attack_speed}</>",
      "iconId": "skchr_spuria_1",
      "spCost": 0,
      "initSp": 0,
      "duration": 24,
      "blackboard": [
        {
          "key": "attack_speed",
          "value": 100
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31023",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_spuria_2",
      "skillName": "On-the-Fly Weapon Modding",
      "desc": "Grants ATK <@ba.vup>+{atk:0%}</> and ASPD <@ba.vup>+{attack_speed}</> to this unit and the closest <@ba.rem>Sniper</> Operator in front of this unit (prioritizes the tile directly in front); when attacking, this unit and the <@ba.rem>Sniper</> Operator have a <@ba.vup>{prob:0%}</> chance to <@ba.vdown><$ba.stun>Stun</> themselves for {stun_time:0.0} seconds</>",
      "iconId": "skchr_spuria_2",
      "spCost": 40,
      "initSp": 30,
      "duration": 20,
      "blackboard": [
        {
          "key": "atk",
          "value": 0.3
        },
        {
          "key": "attack_speed",
          "value": 40
        },
        {
          "key": "stun_time",
          "value": 1.8
        },
        {
          "key": "prob",
          "value": 0.2
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 2,
              "type": "MATERIAL"
            },
            {
              "id": "31013",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "potentialRanks": [
    {
      "type": "BUFF",
      "description": "DP Cost -1",
      "buff": {
        "attributes": {
          "attributeModifiers": [
            {
              "attributeType": "COST",
              "formulaItem": "ADDITION",
              "value": -1,
              "loadFromBlackboard": false,
              "fetchBaseValueFromSourceEntity": false
            }
          ]
        }
      }
    },
    {
      "type": "BUFF",
      "description": "Redeployment Time -4 sec",
      "buff": {
        "attributes": {
          "attributeModifiers": [
            {
              "attributeType": "RESPAWN_TIME",
              "formulaItem": "ADDITION",
              "value": -4,
              "loadFromBlackboard": false,
              "fetchBaseValueFromSourceEntity": false
            }
          ]
        }
      }
    },
    {
      "type": "BUFF",
      "description": "ATK +24",
      "buff": {
        "attributes": {
          "attributeModifiers": [
            {
              "attributeType": "ATK",
              "formulaItem": "ADDITION",
              "value": 24,
              "loadFromBlackboard": false,
              "fetchBaseValueFromSourceEntity": false
            }
          ]
        }
      }
    },
    {
      "type": "BUFF",
      "description": "Redeployment Time -6 sec",
      "buff": {
        "attributes": {
          "attributeModifiers": [
            {
              "attributeType": "RESPAWN_TIME",
              "formulaItem": "ADDITION",
              "value": -6,
              "loadFromBlackboard": false,
              "fetchBaseValueFromSourceEntity": false
            }
          ]
        }
      }
    },
    {
      "type": "BUFF",
      "description": "DP Cost -1",
      "buff": {
        "attributes": {
          "attributeModifiers": [
            {
              "attributeType": "COST",
              "formulaItem": "ADDITION",
              "value": -1,
              "loadFromBlackboard": false,
              "fetchBaseValueFromSourceEntity": false
            }
          ]
        }
      }
    }
  ],
  "favorKeyFrames": [
    {
      "level": 0,
      "data": {
        "maxHp": 0,
        "atk": 0,
        "def": 0,
        "magicResistance": 0,
        "cost": 0,
        "blockCnt": 0,
        "moveSpeed": 0,
        "attackSpeed": 0,
        "baseAttackTime": 0,
        "respawnTime": 0,
        "hpRecoveryPerSec": 0,
        "spRecoveryPerSec": 0,
        "maxDeployCount": 0,
        "maxDeckStackCnt": 0,
        "tauntLevel": 0,
        "massLevel": 0,
        "baseForceLevel": 0,
        "stunImmune": false,
        "silenceImmune": false,
        "sleepImmune": false,
        "frozenImmune": false,
        "levitateImmune": false,
        "disarmedCombatImmune": false,
        "fearedImmune": false
      }
    },
    {
      "level": 50,
      "data": {
        "maxHp": 200,
        "atk": 45,
        "def": 0,
        "magicResistance": 0,
        "cost": 0,
        "blockCnt": 0,
        "moveSpeed": 0,
        "attackSpeed": 0,
        "baseAttackTime": 0,
        "respawnTime": 0,
        "hpRecoveryPerSec": 0,
        "spRecoveryPerSec": 0,
        "maxDeployCount": 0,
        "maxDeckStackCnt": 0,
        "tauntLevel": 0,
        "massLevel": 0,
        "baseForceLevel": 0,
        "stunImmune": false,
        "silenceImmune": false,
        "sleepImmune": false,
        "frozenImmune": false,
        "levitateImmune": false,
        "disarmedCombatImmune": false,
        "fearedImmune": false
      }
    }
  ],
  "talents": [
    {
      "candidates": [
        {
          "unlockCondition": {
            "phase": "PHASE_0",
            "level": 1
          },
          "requiredPotentialRank": 0,
          "prefabKey": "1",
          "name": "Differential Reloading Experiment",
          "description": "Each attack has a 30% chance to trigger one of the following effects: the attack instead hits twice; the target is <$ba.stun>Stunned</> for 0.5 seconds; the attack ignores 60% of the target's DEF",
          "blackboard": {
            "prob": 0.3,
            "stun": 0.5,
            "def_penetrate": 0.6
          },
          "tokenKey": null,
          "isHideTalent": false
        },
        {
          "unlockCondition": {
            "phase": "PHASE_1",
            "level": 1
          },
          "requiredPotentialRank": 0,
          "prefabKey": "1",
          "name": "Differential Reloading Experiment",
          "description": "Each attack has a 50% chance to trigger one of the following effects: the attack instead hits twice; the target is <$ba.stun>Stunned</> for 1 second; the attack ignores 60% of the target's DEF",
          "blackboard": {
            "prob": 0.5,
            "stun": 1,
            "def_penetrate": 0.6
          },
          "tokenKey": null,
          "isHideTalent": false
        },
        {
          "unlockCondition": {
            "phase": "PHASE_2",
            "level": 1
          },
          "requiredPotentialRank": 0,
          "prefabKey": "1",
          "name": "Differential Reloading Experiment",
          "description": "Each attack has a 70% chance to trigger one of the following effects: the attack instead hits twice; the target is <$ba.stun>Stunned</> for 1 second; the attack ignores 80% of the target's DEF",
          "blackboard": {
            "prob": 0.7,
            "stun": 1,
            "def_penetrate": 0.8
          },
          "tokenKey": null,
          "isHideTalent": false
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_spuria",
      "moduleName": "Spuria's Badge",
      "desc": "Operator Spuria has demonstrated a remarkable aptitude for combat via entirely unconventional means.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Specialist Operator during field operations to exercise Geek responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named.",
      "typeIcon": "original",
      "uniEquipIcon": "uniequip_001_spuria",
      "typeName1": "ORIGINAL",
      "typeName2": "",
      "showEvolvePhase": "PHASE_2",
      "unlockLevel": 0,
      "missionList": [],
      "unlockFavors": {},
      "itemCost": {},
      "module_upgrades": []
    },
    {
      "moduleId": "uniequip_002_spuria",
      "moduleName": "Drone Spraying Kit",
      "desc": "There's a strange noise to her six. Lemuen pivots and points, gun aimed at the source.\nIt's a drone. The instant she sees the 'precision instruments' mounted on it, Lemuen surmises its owner. The drone buzzes and hangs in the airflow.\n'What's the joke this time?' she says, her sigh tinted with frustration. Eyeing the lens of the drone, Lemuen puts her gun down.\n'You didn't come for me today. That's my win.\n'It looks like after ninety-nine days, you've hit your limit, Lemuen.' There's a hint of playfulness in the voice carried by the drone.\n'Time's a limited resource. I don't have enough to keep wasting on keeping a problem girl entertained.\n'Anyway, is this little cutie attending class for you again today, Lia?' Lemuen continues to head for the school building. Having the drone she calls the 'little cutie' tag along behind her is something she's all but used to by now.\nThrough the drone's video cam, Serpilia surveys the pink-tinged, long-haired Sankta. Once the headmaster and teaching faculty had given up on urging her to attend classes, this pink-haired Sankta was left to tackle the dumb matter of 'telling Serpilia to come to class' all alone.\nIt's, well, how to put it? Real amusing. Worth watching closely.\nStaring at the transmitted image with all the patience in the land, Serpilia is an observer to the pink-hair's every move, to how she'll try and find Serpilia today, or maybe the little 'gift' Serpilia's prepared for her.\nShe loses herself for just an instant when a 'thump' comes through, and she realizes the pink-hair's wrecked another of her drones.\n'That drone just now was a holographic image. This one's the real 'cutie,' isn't it? You can't waste good technology like this.\n'Enough hiding. If you want to observe me, there's no better way than standing in front of me and taking a good long look. Very, very, carefully.'\n'Auuugh, guess that wouldn't fool you after all...' Serpilia hops down from the roof, totally deflated, and flops over on a bench near Lemuen.\n'Still, it's my win.\n'And you doubled your loss. Once for giving up on making me come to class, and again for using your gun to shoot down the little gift I gave you.'\n'Oh?\n'Well, why not take another look around you?' Right on cue, there's a shrill whistle, then an orderly formation of students, each head topped with seven or eight scoops of ice cream, comes rushing past. Serpilia's face is the picture of bewilderment.\n'It's time for class, Lia. Today's Social Activities will be about escorting desserts outdoors.' The pink-haired Sankta props herself up on the bench. Serpilia turns her head away, wanting to avoid Lemuen's line of sight, but is blinded by the fierce sunlight.\nIn all the commotion of the street, all Serpilia can catch is Lemuen's murmur.\n'Send me your 'little cutie' once you fix her up, and don't forget to spray it a color I like.'",
      "typeIcon": "gee-x",
      "uniEquipIcon": "uniequip_002_spuria",
      "typeName1": "GEE",
      "typeName2": "X",
      "showEvolvePhase": "PHASE_2",
      "unlockLevel": 50,
      "missionList": [
        "uniequip_002_spuria_1",
        "uniequip_002_spuria_2"
      ],
      "unlockFavors": {
        "1": 0,
        "2": 2732,
        "3": 10070
      },
      "itemCost": {
        "1": [
          {
            "id": "mod_unlock_token",
            "count": 2,
            "type": "MATERIAL"
          },
          {
            "id": "30094",
            "count": 3,
            "type": "MATERIAL"
          },
          {
            "id": "4001",
            "count": 40000,
            "type": "GOLD"
          }
        ],
        "2": [
          {
            "id": "mod_unlock_token",
            "count": 2,
            "type": "MATERIAL"
          },
          {
            "id": "mod_update_token_1",
            "count": 20,
            "type": "MATERIAL"
          },
          {
            "id": "31044",
            "count": 4,
            "type": "MATERIAL"
          },
          {
            "id": "4001",
            "count": 50000,
            "type": "GOLD"
          }
        ],
        "3": [
          {
            "id": "mod_unlock_token",
            "count": 2,
            "type": "MATERIAL"
          },
          {
            "id": "mod_update_token_2",
            "count": 8,
            "type": "MATERIAL"
          },
          {
            "id": "31054",
            "count": 5,
            "type": "MATERIAL"
          },
          {
            "id": "4001",
            "count": 60000,
            "type": "GOLD"
          }
        ]
      },
      "module_upgrades": [
        {
          "equipLevel": 1,
          "attributeBlackboard": [
            {
              "key": "atk",
              "value": 25,
              "valueStr": null
            },
            {
              "key": "def",
              "value": 23,
              "valueStr": null
            }
          ],
          "tokenAttributeBlackboard": {},
          "parts": [
            {
              "target": "DISPLAY",
              "isToken": false,
              "talents": [],
              "trait": [
                {
                  "additionalDescription": "Increases SP recovery rate by +0.25/second while above 80% HP",
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "blackboard": [],
                  "overrideDescripton": null,
                  "prefabKey": null,
                  "rangeId": null
                }
              ]
            },
            {
              "target": "TALENT",
              "isToken": false,
              "talents": [
                {
                  "displayRangeId": false,
                  "upgradeDescription": "",
                  "talentIndex": -1,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "prefabKey": "10",
                  "name": null,
                  "description": null,
                  "rangeId": null,
                  "blackboard": [
                    {
                      "key": "sp_recovery_per_sec",
                      "value": 0.25,
                      "valueStr": null
                    }
                  ],
                  "tokenKey": null,
                  "isHideTalent": true
                }
              ],
              "trait": []
            }
          ]
        },
        {
          "equipLevel": 2,
          "attributeBlackboard": [
            {
              "key": "atk",
              "value": 35,
              "valueStr": null
            },
            {
              "key": "def",
              "value": 31,
              "valueStr": null
            }
          ],
          "tokenAttributeBlackboard": {},
          "parts": [
            {
              "target": "DISPLAY",
              "isToken": false,
              "talents": [],
              "trait": [
                {
                  "additionalDescription": "Increases SP recovery rate by +0.25/second while above 80% HP",
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "blackboard": [],
                  "overrideDescripton": null,
                  "prefabKey": null,
                  "rangeId": null
                }
              ]
            },
            {
              "target": "TALENT",
              "isToken": false,
              "talents": [
                {
                  "displayRangeId": false,
                  "upgradeDescription": "",
                  "talentIndex": -1,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "prefabKey": "10",
                  "name": null,
                  "description": null,
                  "rangeId": null,
                  "blackboard": [
                    {
                      "key": "sp_recovery_per_sec",
                      "value": 0.25,
                      "valueStr": null
                    }
                  ],
                  "tokenKey": null,
                  "isHideTalent": true
                }
              ],
              "trait": []
            },
            {
              "target": "TALENT",
              "isToken": false,
              "talents": [
                {
                  "displayRangeId": false,
                  "upgradeDescription": "Each attack has a 70% chance to trigger one of the following effects: the attack instead hits twice, the target is Stunned for 1 second, or the attack ignores 80% of the target's DEF; when this effect is triggered, the attack deals 110% damage",
                  "talentIndex": 0,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "prefabKey": "1",
                  "name": "Differential Reloading Experiment",
                  "description": null,
                  "rangeId": null,
                  "blackboard": [
                    {
                      "key": "prob",
                      "value": 0.7,
                      "valueStr": null
                    },
                    {
                      "key": "stun",
                      "value": 1,
                      "valueStr": null
                    },
                    {
                      "key": "def_penetrate",
                      "value": 0.8,
                      "valueStr": null
                    },
                    {
                      "key": "atk_scale",
                      "value": 1.1,
                      "valueStr": null
                    }
                  ],
                  "tokenKey": null,
                  "isHideTalent": false
                }
              ],
              "trait": []
            }
          ]
        },
        {
          "equipLevel": 3,
          "attributeBlackboard": [
            {
              "key": "atk",
              "value": 40,
              "valueStr": null
            },
            {
              "key": "def",
              "value": 38,
              "valueStr": null
            }
          ],
          "tokenAttributeBlackboard": {},
          "parts": [
            {
              "target": "DISPLAY",
              "isToken": false,
              "talents": [],
              "trait": [
                {
                  "additionalDescription": "Increases SP recovery rate by +0.25/second while above 80% HP",
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "blackboard": [],
                  "overrideDescripton": null,
                  "prefabKey": null,
                  "rangeId": null
                }
              ]
            },
            {
              "target": "TALENT",
              "isToken": false,
              "talents": [
                {
                  "displayRangeId": false,
                  "upgradeDescription": "",
                  "talentIndex": -1,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "prefabKey": "10",
                  "name": null,
                  "description": null,
                  "rangeId": null,
                  "blackboard": [
                    {
                      "key": "sp_recovery_per_sec",
                      "value": 0.25,
                      "valueStr": null
                    }
                  ],
                  "tokenKey": null,
                  "isHideTalent": true
                }
              ],
              "trait": []
            },
            {
              "target": "TALENT",
              "isToken": false,
              "talents": [
                {
                  "displayRangeId": false,
                  "upgradeDescription": "Each attack has a 70% chance to trigger one of the following effects: the attack instead hits twice, the target is Stunned for 1 second, or the attack ignores 80% of the target's DEF; when this effect is triggered, the attack deals 115% damage",
                  "talentIndex": 0,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "prefabKey": "1",
                  "name": "Differential Reloading Experiment",
                  "description": null,
                  "rangeId": null,
                  "blackboard": [
                    {
                      "key": "prob",
                      "value": 0.7,
                      "valueStr": null
                    },
                    {
                      "key": "stun",
                      "value": 1,
                      "valueStr": null
                    },
                    {
                      "key": "def_penetrate",
                      "value": 0.8,
                      "valueStr": null
                    },
                    {
                      "key": "atk_scale",
                      "value": 1.15,
                      "valueStr": null
                    }
                  ],
                  "tokenKey": null,
                  "isHideTalent": false
                }
              ],
              "trait": []
            }
          ]
        }
      ]
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "No problem. Just leave the documents here, and I'll filter out anything that isn't worth you reading... Can't do it that way? We have to take each one seriously? Fine, fine, whatever you say.",
      "voiceAsset": "char_4015_spuria/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "I guarantee that field op will be cleared without a hitch, so— I can't dump it on another operator? Come on, It was a long trip for me to come here, and I'm better off spending my time in the workshop while I'm on the ship. Work with me here, will you？",
      "voiceAsset": "char_4015_spuria/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "How's my stay? So far so good. Here I can focus on reviewing my designs without headphones on my head. No need to block everything out with music. Feels kinda refreshing. Still, I haven't modded any of the equipment in the dorm myself, so it does feel kinda like we're missing some features here. For example, something that automatically orders cactus tarts takeout at preset times.",
      "voiceAsset": "char_4015_spuria/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Do me a favor and tell me when Lemuen shows up, Doctor. I help maintain her sister's gun every now and then, so my guess is she wants to have a few words with me. Why don't I just go see her? Uhmm... The way I put it, one can't be so proactive with everybody. Sometimes, you need to keep a certain distance. You know what I mean?",
      "voiceAsset": "char_4015_spuria/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "Laterano has tons of magazines covering the combat attire of other countries. Their designs seem to have drawn inspiration from a variety of sources, all of which I'd like to try out. Oh, just so you know, I'm more of an order-by-phone kind of girl. I don't go shopping unless I'm invited by some <i>very</i>  specific people. So, you gonna ask me out?",
      "voiceAsset": "char_4015_spuria/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "I'm more willing to go on field ops than before? That's because I'm after inspiration for firearms upgrades. When I stand in war-torn ruins, where there's none of the ear-rending ruckus of Laterano, I get this weird sense of fear. I have to find a way to use my technology to combat that somehow.",
      "voiceAsset": "char_4015_spuria/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "If the Lateran Curia ever asks for me, make an excuse and turn them down, will you? I don't wanna go back to listen to my boss nag about faith and standing. She thinks she can talk me into recognizing my mistakes, but I don't ever think that much when I do stuff.",
      "voiceAsset": "char_4015_spuria/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "I study firearm assistive technologies, but I don't fundamentally understand what a gun means to a Sankta... Hm? Oh, nothing. Just a friend of mine who told me she's starting to use a gun again. Anyway, I'll be going on a trip soon. Be sure to approve my disembarkation when the time comes, Doctor.",
      "voiceAsset": "char_4015_spuria/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "You look like you're in a bad mood, so I grabbed you a snack from— Hey, what's that surprised look for? Yes, you're no Sankta and I can't feel your emotion, but that doesn't mean I can't care about you. Alright, eat up now. I wanna see if this is from the tainted batch.",
      "voiceAsset": "char_4015_spuria/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "You asleep...? Hehe... Well, well, seems like a good chance to release a drone in the hallway and stream someone's sleep-talking... No response? Looks like you're actually asleep.",
      "voiceAsset": "char_4015_spuria/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Spuria, liaison from the Sixth Tribunal of the Lateran Curia, here for cultural exchange. Oh, right. To prevent any safety inspections, my luggage has a self-destruct mechanism. Yep, the stuff inside isn't necessarily all safe.",
      "voiceAsset": "char_4015_spuria/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "You want to watch combat records together? You aren't gonna complain that I'm not serious enough when I watch the videos, right?",
      "voiceAsset": "char_4015_spuria/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "If you're giving me more permissions, I won't have to check with you the next time I want to do something, right?",
      "voiceAsset": "char_4015_spuria/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "We Sankta know how to shoot just by the instincts we were born with. Then, after seven years of schooling, we've mastered advanced shooting techniques and learned the basics of maintenance and retrofitting. After that, we may spend our <i>entire</i> lifetimes without ever realizing... guns hurt people.",
      "voiceAsset": "char_4015_spuria/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Yep, no problem. I've got the objectives all memorized.",
      "voiceAsset": "char_4015_spuria/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Relax, just leave it to me. What kind of havoc can I wreak?",
      "voiceAsset": "char_4015_spuria/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Aww, I prefer combat strategies without so many twists and turns.",
      "voiceAsset": "char_4015_spuria/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Perfect opportunity to observe the battlefield.",
      "voiceAsset": "char_4015_spuria/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Comms online and stable.",
      "voiceAsset": "char_4015_spuria/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Go ahead. Tell me your plan.",
      "voiceAsset": "char_4015_spuria/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Hello, on-site service.",
      "voiceAsset": "char_4015_spuria/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "It's about time we switched to a frontal assault, no?",
      "voiceAsset": "char_4015_spuria/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Come on, don't be such a drag.",
      "voiceAsset": "char_4015_spuria/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Just a smaaaall test.",
      "voiceAsset": "char_4015_spuria/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Take a guess. Am I holding my gun to pray?",
      "voiceAsset": "char_4015_spuria/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Uh-oh, you got it wrong.",
      "voiceAsset": "char_4015_spuria/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "What a surprise. It's been a while since I had so many casings at my feet. You really know how to put on a show.",
      "voiceAsset": "char_4015_spuria/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Just as promised, the mission's a success. What was I doing? Whoa, whoa, whoa, that's hurting. Nobody likes a Doctor who pries too much, yes?",
      "voiceAsset": "char_4015_spuria/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "No worries, it's not a big deal. Just act like you're all remorseful, and nobody will press it too hard. But I still saw every mistake you made with my own eyes, better keep that in mind.",
      "voiceAsset": "char_4015_spuria/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Uh, you're not gonna fix the part of the perimeter that got blown up? That wouldn't fly in Laterano.",
      "voiceAsset": "char_4015_spuria/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Woo, I love this icy, modern feel.",
      "voiceAsset": "char_4015_spuria/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Careful. My gun might go off.",
      "voiceAsset": "char_4015_spuria/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "How much do you know about Sankta guns? There's no way you'd ever be able to fire one, but I don't mind explaining things to you.",
      "voiceAsset": "char_4015_spuria/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_4015_spuria/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "If this was Laterano, I would probably be helping maintain order right about now. The communications center gets affected by explosions pretty easily, and they need my tech repair to mend things... Was it tough? Come on, when everyone else's partying hard, would you really be such a killjoy?",
      "voiceAsset": "char_4015_spuria/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Hey, Doctor, you're finally here. While you were gone, <i>absolutely</i> nothing happened.",
      "voiceAsset": "char_4015_spuria/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Your birthday? Uh, you never told me. How'd I know? You didn't bring this up because you want a present, right? Haha... I really like that look on your face right now. Here, this instant photo's your gift. The first one I just took is mine, though.",
      "voiceAsset": "char_4015_spuria/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "At first, I came to Rhodes Island just to check the place out and learn some new skills. I never expected to stay here and run so many field operations for you. You really know how to order people around, Doctor. That said, I've seen lots of sights I would never have seen in Laterano, so I guess it was all worth it.",
      "voiceAsset": "char_4015_spuria/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "power_rec_spd&addition[000]",
      "buffName": "Technology Exchange α",
      "desc": "When this Operator is assigned to a Power Plant, drone recovery rate is <@cc.vup>+10%</> in the first hour and thereafter <@cc.vup>+1%</> per hour, up to <@cc.vup>+15%</>",
      "skillIcon": "bskill_power_rec_spd&addition1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "power_rec_spd&addition[001]",
      "buffName": "Technology Exchange β",
      "desc": "When this Operator is assigned to a Power Plant, drone recovery rate is <@cc.vup>+15%</> in the first hour and thereafter <@cc.vup>+1%</> per hour, up to <@cc.vup>+20%</>",
      "skillIcon": "bskill_power_rec_spd&addition2",
      "phase": "PHASE_2",
      "level": 1
    },
    {
      "buffId": "power_rec_spd&cost[010]",
      "buffName": "Take-Away Fruit Tarts",
      "desc": "When this Operator is assigned to a Power Plant, reduces the Morale consumed each hour by <@cc.vup>-0.3</>",
      "skillIcon": "bskill_pow_spd&cost",
      "phase": "PHASE_0",
      "level": 1
    }
  ],
  "tokens": [],
  "patch_info": {}
}