{
  "id": "char_4121_zuole",
  "meta_info": {
    "name": "Zuo Le",
    "appellation": " ",
    "voiceActor": {
      "en": "Vincent Tong",
      "jp": "Toshiyuki Toyonaga",
      "kr": "Kim Daol",
      "cn": "Li Jiaxiang"
    },
    "rarity": 6,
    "profession": "Guard",
    "subProfessionId": "Musha",
    "position": "MELEE",
    "team": "",
    "tagList": [
      "DPS",
      "Survival"
    ],
    "nationId": "Yan",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Zuo Le\n[Gender] Male\n[Combat Experience] 2 years\n[Place of Birth] Yan\n[Date of Birth] Apr 30\n[Race] Phidia\n[Height] 175cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Standard\n[Mobility] Outstanding\n[Physical Resilience] Standard\n[Tactical Acumen] Excellent\n[Combat Skill] Standard\n[Originium Arts Assimilation] Standard",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Zuo Le, a 'Candleholder' of the Sui Regulator, the secret agency handling Yan's Feranmut problem. Currently stationed at Rhodes Island on supervisory duty, he regularly reports back to Yan. Sometimes participates in missions for Rhodes Island as a part-time field operator.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Zuo Le shows no signs of Originium infection.\n\n[Blood Originium-Crystal Density] 0.13u/L\nDespite extensive time in the field, Operator Zuo Le's training allows him to avoid risks of Infection.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Report 1]\nRhodes Island's situation is consistent with existing intel. The company maintains a regular armed presence for escorting supplies and resolving small-scale Infected conflicts. There is currently no indication that they have borrowed the power of the Sui proxies in such conflicts.\nNumerous persons of interest from various countries have been spotted on Rhodes Island. Minister of the Judicial Review Office Lin Qingyan's association with the organization was known, but that of Lady Ch'en, niece of Lord Wei, was not. I confess to being surprised to find her at an Oripathy pharmaceutical company after she resigned from the L.G.D.\nShe presently shows no signs of associating with the Sui proxies.\n\n[Report 4]\nJul 9: \nAt 0900 hours, Nian entered an Engineering Department workshop, exiting at 1700 hours. Further investigation indicated that three engineering operators were in the same workshop, engaging in games of Mahjong with her. The three of them lost 121.5, 76, and 59 Lungmen Dollars to her respectively. The amount wagered was legal under Yanese law.\nNote from Nian: The kid sat down with me and played two rounds under the pretext of questioning. Since when was he so bold? And is the Sui Regulator gonna cover the 130 LMD he lost to me?\n\n[Report 11]\nI discovered that Ling is a regular at a 'bar' on Rhodes Island that only opens at night. Chongyue teaches hand-to-hand combat to field operators, Shu tends to plants in the greenhouse, while Nian and Dusk have attempted to influence the cafeteria's menu to no avail... In other words, no different from last month.\nIt seems the investigation has run into an impasse.\n......\n......\n'Caught this guy trying to sneak into the archives.'\nWhen Jieyun apprehended Zuo Le and brought him to us, we praised her for her vigilance, and decided to sit down and have a good talk with him.\nNian and her siblings are here as guests of Rhodes Island. While they rarely show up together, their unique position means that any movement by any one of them is bound to draw attention. We have become accustomed to dealing with important people from important factions, and the fact that the Sui Regulator has opted to send just a single Candleholder should be taken as a sign of friendship—or, at the very least, non-hostility.\nUltimately, we tacitly permitted Zuo Le to keep an eye on our Yanese VIPs, provided that he does not provoke them. We believe that he has the professional knowledge to act appropriately.\nA little bit of peace and quiet is always a good thing, in times like these. We hope that he will successfully adjust to life on Rhodes Island.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Classified Log]\nFeramuts played a major role in early Yanese history. The Yanese people broke from the ancient beliefs in gods very early on, giving rise to the conceptual equivalent of the Feranmut.\nYanese scholars discovered a site believed to be the remains of a god. Carcass-shaped mountains reached the clouds, along with broken arches filled with holes. Countless smaller creatures lived within, their bones weaving a complex structure in these holes. Underneath the carcass was withered vegetation and decayed remains, but that decay gave birth to new life. That was the turning point, when the country's scholars came to understand the Feranmuts not as gods, but as living creatures that could be studied and understood. This gave rise to the position of Candleholder and their motto: 'Carry the fire that drives out the shadows of the Feranmut, and travel amongst the people to learn their troubles.' The imagery of the Candleholder may have originated from the scholars walking into the remains of the Feranmut with their lanterns, and the connotation of seeking truth and understanding.\n\n[Classified Log 2]\nRecord of a secret operation in October of 1087: \nTracks of the Feranmut ■, believed to have departed Yan one thousand years ago, were detected 40km to the northwest of Yumen. The reason for its return is unknown. Yumen entered a state of alert, and five battleship squadrons were deployed, supported by two additional squadrons from Lungmen. Through the blinding dust and sand kicked up by the battleships and the nomadic city, the silhouettes of 'mountains' could be seen on the horizon. After two days of standoff, the Feranmut began moving towards the south, away from Yanese territory.\nThe scene was witnessed from atop the core city by garrison commander Zuo Xuanliao, dozens of veteran Tianshis, and a four year-old child.\n'What is that?'\n'The enemy.'",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Zuo Le has spent almost all his free time honing his combat skills. He eagerly talks to operators hailing from different regions, learning about different styles and techniques for various situations. He also regularly asks other operators to spar with him, showing no frustration whether he's getting knocked down by Waai Fu or losing a footrace to Grani, instead asking them for advice. He appears to have little interest in winning or losing, seemingly training for its own sake. Isn't he a little young to have that sort of mentality? His daily schedule has started to look a lot like Chongyue's...\n'I now understand that the martial arts are like farming, permitting neither complacency nor impatience. I need merely complete the task before me, one step at a time... I had been chasing after something or other ever since the day I first learned qinggong, whether it be bandits, fugitives, my father's expectations, or my seniors... Dahuang was the first time I chased a stockbeast, though. You see different things, on the farmlands.'\nZuo Le speaks fondly of his 'punishment' at Dahuang. He learned about agriculture, planted crops himself, and harvested alongside the Tianshis and farmers. Aside from Yumen and Baizao, it is the place he has the most vivid memories of.\n'Every martial artist runs into a wall at some point. Overcome it. It's just about putting in the work over time... There isn't much I can teach him. He's more talented than I am.'\n - Qiubai\n\n[Classified Log]\n'I heard about Dahuang. The Central Judicial Office will intervene if necessary.'\n'No, this is a matter for the Sui Regulator. Things are still under control.'\n'The sinner, the merchant he is in cahoots with, and the Shanhaizhong... are you not anxious?'\n'And what would being anxious accomplish? If it rains, you bring an umbrella. Besides, I've made my own preparations. This file will reach the right people at the right time.'",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Zuo Le has spoken of his upbringing in Yumen, a stronghold in northern Yan. He grew up living as a soldier, just like his father and all the defenders of Yumen before him. In his youth he often climbed the city walls in defiance of the rules, for which he was duly punished, but the Grandmaster took notice, and started teaching qingong. Zuo Le would compete against other soldiers in mounted archery, and sneak out with the patrols just to see the sun set in the valley. Standing atop Yumen, one sees nothing but desert to the west, and scattered villages and nomadic cities to the east. When his father told him to 'Protect the people's well-being' for the first time, it left a deep impression on the young Zuo Le. Soon after, he was sent to live with his mother, who had stayed behind in the capital, and studied in the academies of Baizao.\n'I thought Father wanted me to become a soldier like him. I thought I was ready to spend my life fighting, or die trying. I thought it would be glorious. But Father's attitude was firmer than I had ever seen him when he sent me back to the capital. My luggage and my ride were already waiting for me when I returned from the barracks, and he practically stuffed me into the car... Life with Mother was very different.'\nZuo Le described Baizao, the capital of Yan, as a solemn and dignified city. The City of Countless Stoves is more impressive than any other nomadic city roaming this land: towers reaching to the heavens, majestic academies, walls that stretch as far as the eye can see... The city itself is the very embodiment of law and order, and this was impressed upon Zuo Le the day he arrived. Perhaps he could have finished his education quietly and become an official like Liang Xun, a position that certainly has its share of responsibilities and restrictions, but one that is much safer than being on the frontlines of Yumen. The reason he chose the path of a Candleholder, a life hardly less dangerous than a soldier's, can be traced back to the day he encountered an old man while browsing through history books in the academy's library...\nBut enough idle chatter.\nFrom the battlefields of Yumen, to the academies of Baizao, to the tireless travels of a Candleholder, Zuo Le has seen much more than his age would imply. Rhodes Island's first encounter with him can be traced to Operator Kroos's trip to Shangshu. Since then, we have learned much about the conflicts in Shangshu, the Catastrophe at Yumen, and the Dahuang Crisis through operators involved in the events. While Zuo Le was not necessarily at the center of these events, he did consistently brave the dangers on the frontlines, and just from hearing the accounts I could not help but respect the young man. He has always stood tall and shouldered heavy responsibilities with a fire in his eyes... But enough sentimentality. I cannot help but hope for further cooperation with him, even though formally speaking he is only here as an observer from Yan. Idealists always walk similar paths, and he has already started helping the Logistics Department by using his skills to transport supplies.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "March 1102\n...Repairs at the Sword Forge are complete. I saw a funeral service being held there. I didn't go in.\nI remember the old man. I saw him in the barracks before I left Yumen to study in Baizao. He gave me a sword. I still don't know why...\n......\nMay 1102\n'Scribbled picture'\nWheat\n'Scribbled picture'\nMillet\n......\nWielding a scythe is very different from wielding a sword. The Record of Martial Combat is of little help.\n'See and think.'\n......\nJune 1102\nThey say millions of crops are harvested each year, but each must be cared for individually. Same, then, for 'all the people.'\nI think I understand better now.\n\nZuo Le's keeps a clean and tidy journal, recording the details of his missions each month, ever since he became a Candleholder. At some point, however, things started to change.\nHe has allowed you to read it.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 2893,
      "atk": 647,
      "def": 267,
      "magicResistance": 0,
      "blockCnt": 1,
      "baseAttackTime": 1.2,
      "respawnTime": 70,
      "cost": 26
    }
  },
  "trait": [
    {
      "unlockCondition": {
        "phase": "PHASE_0",
        "level": 1
      },
      "requiredPotentialRank": 0,
      "blackboard": [
        {
          "key": "value",
          "value": 30
        }
      ],
      "overrideDescription": "Can't be healed by other units. Recovers <@ba.kw>{value}</> self HP every time this operator attacks an enemy (Upgraded after reaching Elite 1)",
      "prefabKey": "",
      "rangeId": null
    },
    {
      "unlockCondition": {
        "phase": "PHASE_1",
        "level": 1
      },
      "requiredPotentialRank": 0,
      "blackboard": [
        {
          "key": "value",
          "value": 50
        }
      ],
      "overrideDescription": "Can't be healed by other units. Recovers <@ba.kw>{value}</> self HP every time this operator attacks an enemy (Upgraded after reaching Elite 2)",
      "prefabKey": "",
      "rangeId": null
    },
    {
      "unlockCondition": {
        "phase": "PHASE_2",
        "level": 1
      },
      "requiredPotentialRank": 0,
      "blackboard": [
        {
          "key": "value",
          "value": 70
        }
      ],
      "overrideDescription": "Can't be healed by other units. Recovers <@ba.kw>{value}</> self HP every time this operator attacks an enemy",
      "prefabKey": "",
      "rangeId": null
    }
  ],
  "skins": [
    {
      "skinId": "char_4121_zuole#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_4121_zuole",
      "portraitId": "char_4121_zuole_1",
      "illustId": "illust_char_4121_zuole_1",
      "modelName": "Zuo Le",
      "drawerList": [
        "九日九号"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_4121_zuole#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_4121_zuole_2",
      "portraitId": "char_4121_zuole_2",
      "illustId": "illust_char_4121_zuole_2",
      "modelName": "Zuo Le",
      "drawerList": [
        "九日九号"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1582,
            "atk": 348,
            "def": 151,
            "magicResistance": 0,
            "cost": 22,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 2198,
            "atk": 498,
            "def": 208,
            "magicResistance": 0,
            "cost": 22,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 2198,
            "atk": 498,
            "def": 208,
            "magicResistance": 0,
            "cost": 24,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 2893,
            "atk": 647,
            "def": 267,
            "magicResistance": 0,
            "cost": 24,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3221",
          "count": 5,
          "type": "MATERIAL",
          "name": "Guard Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_GRD1"
        },
        {
          "id": "30052",
          "count": 7,
          "type": "MATERIAL",
          "name": "Polyketon",
          "rarity": 2,
          "iconId": "MTL_SL_KETONE2"
        },
        {
          "id": "30062",
          "count": 3,
          "type": "MATERIAL",
          "name": "Device",
          "rarity": 2,
          "iconId": "MTL_SL_BOSS2"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "1-1",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 2893,
            "atk": 647,
            "def": 267,
            "magicResistance": 0,
            "cost": 26,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 3858,
            "atk": 780,
            "def": 315,
            "magicResistance": 0,
            "cost": 26,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.2,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3223",
          "count": 4,
          "type": "MATERIAL",
          "name": "Guard Dualchip",
          "rarity": 5,
          "iconId": "MTL_ASC_GRD3"
        },
        {
          "id": "30115",
          "count": 4,
          "type": "MATERIAL",
          "name": "Polymerization Preparation",
          "rarity": 5,
          "iconId": "MTL_SL_PP"
        },
        {
          "id": "30074",
          "count": 8,
          "type": "MATERIAL",
          "name": "White Horse Kohl",
          "rarity": 4,
          "iconId": "MTL_SL_ALCOHOL2"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_zuole_1",
      "skillName": "Fiendslayer",
      "desc": "Next attack's ATK increases to <@ba.vup>{atk_scale:0%}</>; When this unit's HP is lower than <@ba.vup>{hp_ratio_double:0%}</>, this attack strikes <@ba.vup>1</> additional time; when lower than <@ba.vup>{hp_ratio_tripple:0%}</>, this attack strikes <@ba.vup>2</> additional times\n<@ba.rem>Can store 3 charges</>",
      "iconId": "skchr_zuole_1",
      "spCost": 4,
      "initSp": 6,
      "duration": 0,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 2
        },
        {
          "key": "hp_ratio_double",
          "value": 0.8
        },
        {
          "key": "hp_ratio_tripple",
          "value": 0.5
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31074",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30103",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_zuole_2",
      "skillName": "Risktaker",
      "desc": "Immediately loses <@ba.vdown>{hp_ratio:0%}</> of current HP and gains a <$ba.barrier>Barrier</> equal to <@ba.vup>{scale:0%}</> Max HP; ATK <@ba.vup>+{atk:0%}</>, Block <@ba.vup>+{block_cnt}</>, and attacks all blocked enemies\n<@ba.rem>The <$ba.barrier>Barrier</> can stack up to {max_scale}x Max HP, and gradually depletes after the skill ends</>",
      "iconId": "skchr_zuole_2",
      "spCost": 20,
      "initSp": 13,
      "duration": 12,
      "blackboard": [
        {
          "key": "atk",
          "value": 1.7
        },
        {
          "key": "hp_ratio",
          "value": 0.5
        },
        {
          "key": "scale",
          "value": 1.2
        },
        {
          "key": "block_cnt",
          "value": 1
        },
        {
          "key": "max_scale",
          "value": 2
        },
        {
          "key": "shield_decrease",
          "value": -200
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31064",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30013",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31064",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31084",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_zuole_3",
      "skillName": "Blessings Unto Yan",
      "desc": "Immediately performs <@ba.vup>{times}</> frontal slashes, with each slash dealing <@ba.vup>{atk_scale:0%}</> ATK as Physical damage to up to <@ba.vup>3</> enemies (the last strike has a doubled damage multiplier, and <$ba.stun>Stuns</> targets for <@ba.vup>{stun}</>s); During this time, the HP recovery effect of this unit's Trait is changed to granting a <$ba.barrier>Barrier</> equal to <@ba.vup>{shield_scale}</> times the recovery amount\n<@ba.rem>The <$ba.barrier>Barrier</> can stack up to {max_scale}x Max HP, and lasts for {shield_duration}s</>",
      "iconId": "skchr_zuole_3",
      "spCost": 25,
      "initSp": 10,
      "duration": 0,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 2.45
        },
        {
          "key": "times",
          "value": 7
        },
        {
          "key": "stun",
          "value": 5
        },
        {
          "key": "last_atk_bonus",
          "value": 2
        },
        {
          "key": "shield_scale",
          "value": 3
        },
        {
          "key": "shield_duration",
          "value": 15
        },
        {
          "key": "max_scale",
          "value": 2
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31083",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31084",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "potentialRanks": [
    {
      "type": "BUFF",
      "description": "DP Cost -1",
      "buff": {
        "attributes": {
          "attributeModifiers": [
            {
              "attributeType": "COST",
              "formulaItem": "ADDITION",
              "value": -1,
              "loadFromBlackboard": false,
              "fetchBaseValueFromSourceEntity": false
            }
          ]
        }
      }
    },
    {
      "type": "BUFF",
      "description": "Redeployment Time -4 sec",
      "buff": {
        "attributes": {
          "attributeModifiers": [
            {
              "attributeType": "RESPAWN_TIME",
              "formulaItem": "ADDITION",
              "value": -4,
              "loadFromBlackboard": false,
              "fetchBaseValueFromSourceEntity": false
            }
          ]
        }
      }
    },
    {
      "type": "BUFF",
      "description": "ATK +26",
      "buff": {
        "attributes": {
          "attributeModifiers": [
            {
              "attributeType": "ATK",
              "formulaItem": "ADDITION",
              "value": 26,
              "loadFromBlackboard": false,
              "fetchBaseValueFromSourceEntity": false
            }
          ]
        }
      }
    },
    {
      "type": "CUSTOM",
      "description": "Improves Second Talent",
      "buff": {}
    },
    {
      "type": "BUFF",
      "description": "DP Cost -1",
      "buff": {
        "attributes": {
          "attributeModifiers": [
            {
              "attributeType": "COST",
              "formulaItem": "ADDITION",
              "value": -1,
              "loadFromBlackboard": false,
              "fetchBaseValueFromSourceEntity": false
            }
          ]
        }
      }
    }
  ],
  "favorKeyFrames": [
    {
      "level": 0,
      "data": {
        "maxHp": 0,
        "atk": 0,
        "def": 0,
        "magicResistance": 0,
        "cost": 0,
        "blockCnt": 0,
        "moveSpeed": 0,
        "attackSpeed": 0,
        "baseAttackTime": 0,
        "respawnTime": 0,
        "hpRecoveryPerSec": 0,
        "spRecoveryPerSec": 0,
        "maxDeployCount": 0,
        "maxDeckStackCnt": 0,
        "tauntLevel": 0,
        "massLevel": 0,
        "baseForceLevel": 0,
        "stunImmune": false,
        "silenceImmune": false,
        "sleepImmune": false,
        "frozenImmune": false,
        "levitateImmune": false,
        "disarmedCombatImmune": false,
        "fearedImmune": false
      }
    },
    {
      "level": 50,
      "data": {
        "maxHp": 340,
        "atk": 40,
        "def": 40,
        "magicResistance": 0,
        "cost": 0,
        "blockCnt": 0,
        "moveSpeed": 0,
        "attackSpeed": 0,
        "baseAttackTime": 0,
        "respawnTime": 0,
        "hpRecoveryPerSec": 0,
        "spRecoveryPerSec": 0,
        "maxDeployCount": 0,
        "maxDeckStackCnt": 0,
        "tauntLevel": 0,
        "massLevel": 0,
        "baseForceLevel": 0,
        "stunImmune": false,
        "silenceImmune": false,
        "sleepImmune": false,
        "frozenImmune": false,
        "levitateImmune": false,
        "disarmedCombatImmune": false,
        "fearedImmune": false
      }
    }
  ],
  "talents": [
    {
      "candidates": [
        {
          "unlockCondition": {
            "phase": "PHASE_0",
            "level": 1
          },
          "requiredPotentialRank": 0,
          "prefabKey": "1",
          "name": "Candlelight's Shadow",
          "description": "Gains up to +30 ASPD and SP recovery rate +0.5/s <$ba.berserk>Tenacity</> (reaches maximum bonus when losing 50% Max HP)",
          "blackboard": {
            "min_attack_speed": 30,
            "min_hp_ratio": 0.5,
            "min_sp_recovery_per_sec": 0.5
          },
          "tokenKey": null,
          "isHideTalent": false
        },
        {
          "unlockCondition": {
            "phase": "PHASE_1",
            "level": 1
          },
          "requiredPotentialRank": 0,
          "prefabKey": "1",
          "name": "Candlelight's Shadow",
          "description": "Gains up to +40 ASPD and SP recovery rate +1/s <$ba.berserk>Tenacity</> (reaches maximum bonus when losing 60% Max HP)",
          "blackboard": {
            "min_attack_speed": 40,
            "min_hp_ratio": 0.4,
            "min_sp_recovery_per_sec": 1
          },
          "tokenKey": null,
          "isHideTalent": false
        },
        {
          "unlockCondition": {
            "phase": "PHASE_2",
            "level": 1
          },
          "requiredPotentialRank": 0,
          "prefabKey": "1",
          "name": "Candlelight's Shadow",
          "description": "Gains up to +50 ASPD and SP recovery rate +2/s <$ba.berserk>Tenacity</> (reaches maximum bonus when losing 70% Max HP)",
          "blackboard": {
            "min_attack_speed": 50,
            "min_hp_ratio": 0.3,
            "min_sp_recovery_per_sec": 2
          },
          "tokenKey": null,
          "isHideTalent": false
        }
      ]
    },
    {
      "candidates": [
        {
          "unlockCondition": {
            "phase": "PHASE_2",
            "level": 1
          },
          "requiredPotentialRank": 0,
          "prefabKey": "2",
          "name": "Self-Evident Virtue",
          "description": "Attacks have a 20% chance to restore 1 SP, increased to a 70% chance if below 50% HP",
          "blackboard": {
            "prob_1": 0.2,
            "sp": 1,
            "prob_2": 0.7,
            "hp_ratio": 0.5
          },
          "tokenKey": null,
          "isHideTalent": false
        },
        {
          "unlockCondition": {
            "phase": "PHASE_2",
            "level": 1
          },
          "requiredPotentialRank": 4,
          "prefabKey": "2",
          "name": "Self-Evident Virtue",
          "description": "Attacks have a 23% <@ba.talpu>(+3%)</> chance to restore 1 SP, increased to a 75% <@ba.talpu>(+5%)</> chance if below 50% HP",
          "blackboard": {
            "prob_1": 0.23,
            "sp": 1,
            "prob_2": 0.75,
            "hp_ratio": 0.5
          },
          "tokenKey": null,
          "isHideTalent": false
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_zuole",
      "moduleName": "Zuo Le's Badge",
      "desc": "Operator Zuo Le has demonstrated a remarkable aptitude for solo confrontation with the enemy while far removed from support lines.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Guard Operator during field operations to exercise Soloblade responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named.",
      "typeIcon": "original",
      "uniEquipIcon": "uniequip_001_zuole",
      "typeName1": "ORIGINAL",
      "typeName2": "",
      "showEvolvePhase": "PHASE_2",
      "unlockLevel": 0,
      "missionList": [],
      "unlockFavors": {},
      "itemCost": {},
      "module_upgrades": []
    },
    {
      "moduleId": "uniequip_002_zuole",
      "moduleName": "'You Night, Be Fleeting'",
      "desc": "Zhan Yan has realized that he is on the brink of falling and turning into mincemeat.\nHe had been arguing with his fellow Shanhaizhong fugitives a moment ago, when in the blink of an eye, they faded away one by one into the forest's faint shadows. All he could remember was that a spear had embedded itself into a tree trunk, and then he was bound by a rope that had suddenly dropped out of the sky, after which he found himself suspended above a riverside cliff.\n'Zhan Yan, male, Feline, from the eastern side of Jiangqi.'\nUpon hearing these words, the trussed-up villain stares at the young man who said them. All he sees is a Phidia youth clad in black, carrying a long box and walking alone atop the precipice.\n'You have collaborated with the Shanhaizhong, gathering in the wilderness as part of your sinister schemes... As chief among them, are you aware of which of Yan's laws you have broken?'\n'Pah! You think a limp-wristed bureaucrat like you with hardly a hair on his chest can scare me? I'll kill you, right here, right now!'\nThe river mist scatters, and the moonlight shines upon the 'bureaucrat's' iron mask.\n'Son of a-! You-You're a Sui Regulator Candleholder!' Zhan Yan's entire body breaks out into a cold sweat.\n'Since you are aware of the Sui Regulators, then you must also be aware that...' The youth takes a single step forward. 'While colluding with the Shanhaizhong, you have committed no small number of grisly and violent murders. A Candleholder has the authority to act as a substitute for a formal trial under the Three Organs of Justice, and may render their judgement on the spot.'\nThe wind blows—\nZhan Yan too was no ordinary man, and grits his teeth in defiance, waiting for the opportune moment when the Candleholder approached to hoist his body up, throwing out a fierce and mighty 'Daogua Jinzhong' kick! His dagger-like toe claw lets out a howling wind, coming dangerously close to the youth's throat while slicing apart the rope holding him aloft. The imposing villain shrugs off his tattered bonds, leaping down into a passing fishing boat below the cliff and grabbing the steersman by the arm.\n'Get this boat moving! Faster, dammit!' The boat's engine sputters to life, picking up speed as it leaves the riverbank. Thanks to his daring escape from a summary execution by the Sui Regulator, Zhan Yan can't help but proudly look back at the clifftop.\nWith the aid of the boat's aft lanterns, he clearly sees the black-clad youth take a deep breath before using the momentum of kicking off from the cliff edge to fly midair for twenty-odd zhang in a flash. The waves of the river are dotted with a multitude of white flowers, and he looks to all the world like an onyx leaf blown by a great gale, quietly landing aboard the boat.\nThe box opens, and the youth lightly clasps his scabbard.\n'This is Sui Regulator business. You will be compensated as per the law once I am done here.'\n'You—'\nZhan Yan begins to open his mouth, but is quickly shut up by the lanterns on either side of the boat being neatly sliced off by the youth's sword. The straight and sharp longsword stirs up fragments of glass in the dark, causing Zhan Yan's heart, still leaping wildly from his daring escape, to calm into icy terror. The cutting edge has not yet descended. Instead, like a lance, the youth kicks past the steersman's shoulder, his foot implanting itself into the villain's throat. Zhan Yan feels all the strength leave his body and he slams backwards onto the boat's deck, a warm river of fear between his thighs. Just before losing consciousness, he finally clearly sees the deep green eyes behind the iron mask, dark as the new moon, alongside the golden words inscribed on the inside of the box, only seen when fetching the sword—\n'Candle Bright, Stay Shining. You Night, Be Fleeting.'",
      "typeIcon": "sbl-x",
      "uniEquipIcon": "uniequip_002_zuole",
      "typeName1": "SBL",
      "typeName2": "X",
      "showEvolvePhase": "PHASE_2",
      "unlockLevel": 60,
      "missionList": [
        "uniequip_002_zuole_1",
        "uniequip_002_zuole_2"
      ],
      "unlockFavors": {
        "1": 0,
        "2": 2732,
        "3": 10070
      },
      "itemCost": {
        "1": [
          {
            "id": "mod_unlock_token",
            "count": 4,
            "type": "MATERIAL"
          },
          {
            "id": "30115",
            "count": 2,
            "type": "MATERIAL"
          },
          {
            "id": "4001",
            "count": 80000,
            "type": "GOLD"
          }
        ],
        "2": [
          {
            "id": "mod_unlock_token",
            "count": 4,
            "type": "MATERIAL"
          },
          {
            "id": "mod_update_token_1",
            "count": 60,
            "type": "MATERIAL"
          },
          {
            "id": "30125",
            "count": 3,
            "type": "MATERIAL"
          },
          {
            "id": "4001",
            "count": 100000,
            "type": "GOLD"
          }
        ],
        "3": [
          {
            "id": "mod_unlock_token",
            "count": 4,
            "type": "MATERIAL"
          },
          {
            "id": "mod_update_token_2",
            "count": 20,
            "type": "MATERIAL"
          },
          {
            "id": "30135",
            "count": 4,
            "type": "MATERIAL"
          },
          {
            "id": "4001",
            "count": 120000,
            "type": "GOLD"
          }
        ]
      },
      "module_upgrades": [
        {
          "equipLevel": 1,
          "attributeBlackboard": [
            {
              "key": "atk",
              "value": 55,
              "valueStr": null
            },
            {
              "key": "def",
              "value": 40,
              "valueStr": null
            }
          ],
          "tokenAttributeBlackboard": {},
          "parts": [
            {
              "target": "TRAIT_DATA_ONLY",
              "isToken": false,
              "talents": [],
              "trait": [
                {
                  "additionalDescription": "Gain 25% <$ba.protect>Sanctuary</> when HP is below 50%",
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 60
                  },
                  "requiredPotentialRank": 0,
                  "blackboard": [
                    {
                      "key": "value",
                      "value": 70,
                      "valueStr": null
                    }
                  ],
                  "overrideDescripton": null,
                  "prefabKey": null,
                  "rangeId": null
                }
              ]
            },
            {
              "target": "TALENT",
              "isToken": false,
              "talents": [
                {
                  "displayRangeId": false,
                  "upgradeDescription": "",
                  "talentIndex": 0,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 60
                  },
                  "requiredPotentialRank": 0,
                  "prefabKey": "10",
                  "name": null,
                  "description": null,
                  "rangeId": null,
                  "blackboard": [
                    {
                      "key": "hp_ratio",
                      "value": 0.5,
                      "valueStr": null
                    },
                    {
                      "key": "damage_resistance",
                      "value": 0.25,
                      "valueStr": null
                    }
                  ],
                  "tokenKey": null,
                  "isHideTalent": true
                }
              ],
              "trait": []
            }
          ]
        },
        {
          "equipLevel": 2,
          "attributeBlackboard": [
            {
              "key": "atk",
              "value": 75,
              "valueStr": null
            },
            {
              "key": "def",
              "value": 50,
              "valueStr": null
            }
          ],
          "tokenAttributeBlackboard": {},
          "parts": [
            {
              "target": "TRAIT_DATA_ONLY",
              "isToken": false,
              "talents": [],
              "trait": [
                {
                  "additionalDescription": "Gain 25% <$ba.protect>Sanctuary</> when HP is below 50%",
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 60
                  },
                  "requiredPotentialRank": 0,
                  "blackboard": [
                    {
                      "key": "value",
                      "value": 70,
                      "valueStr": null
                    }
                  ],
                  "overrideDescripton": null,
                  "prefabKey": null,
                  "rangeId": null
                }
              ]
            },
            {
              "target": "TALENT",
              "isToken": false,
              "talents": [
                {
                  "displayRangeId": false,
                  "upgradeDescription": "",
                  "talentIndex": 0,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 60
                  },
                  "requiredPotentialRank": 0,
                  "prefabKey": "10",
                  "name": null,
                  "description": null,
                  "rangeId": null,
                  "blackboard": [
                    {
                      "key": "hp_ratio",
                      "value": 0.5,
                      "valueStr": null
                    },
                    {
                      "key": "damage_resistance",
                      "value": 0.25,
                      "valueStr": null
                    }
                  ],
                  "tokenKey": null,
                  "isHideTalent": true
                }
              ],
              "trait": []
            },
            {
              "target": "TALENT_DATA_ONLY",
              "isToken": false,
              "talents": [
                {
                  "displayRangeId": false,
                  "upgradeDescription": "Gains up to +60 ASPD and SP recovery rate +2.2/s <$ba.berserk>Tenacity</> (reaches maximum bonus when losing 60% Max HP)",
                  "talentIndex": 0,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 60
                  },
                  "requiredPotentialRank": 0,
                  "prefabKey": "1",
                  "name": "Candlelight's Shadow",
                  "description": null,
                  "rangeId": null,
                  "blackboard": [
                    {
                      "key": "min_hp_ratio",
                      "value": 0.4,
                      "valueStr": null
                    },
                    {
                      "key": "min_attack_speed",
                      "value": 60,
                      "valueStr": null
                    },
                    {
                      "key": "min_sp_recovery_per_sec",
                      "value": 2.2,
                      "valueStr": null
                    }
                  ],
                  "tokenKey": null,
                  "isHideTalent": false
                }
              ],
              "trait": []
            }
          ]
        },
        {
          "equipLevel": 3,
          "attributeBlackboard": [
            {
              "key": "atk",
              "value": 90,
              "valueStr": null
            },
            {
              "key": "def",
              "value": 60,
              "valueStr": null
            }
          ],
          "tokenAttributeBlackboard": {},
          "parts": [
            {
              "target": "TRAIT_DATA_ONLY",
              "isToken": false,
              "talents": [],
              "trait": [
                {
                  "additionalDescription": "Gain 25% <$ba.protect>Sanctuary</> when HP is below 50%",
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 60
                  },
                  "requiredPotentialRank": 0,
                  "blackboard": [
                    {
                      "key": "value",
                      "value": 70,
                      "valueStr": null
                    }
                  ],
                  "overrideDescripton": null,
                  "prefabKey": null,
                  "rangeId": null
                }
              ]
            },
            {
              "target": "TALENT",
              "isToken": false,
              "talents": [
                {
                  "displayRangeId": false,
                  "upgradeDescription": "",
                  "talentIndex": 0,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 60
                  },
                  "requiredPotentialRank": 0,
                  "prefabKey": "10",
                  "name": null,
                  "description": null,
                  "rangeId": null,
                  "blackboard": [
                    {
                      "key": "hp_ratio",
                      "value": 0.5,
                      "valueStr": null
                    },
                    {
                      "key": "damage_resistance",
                      "value": 0.25,
                      "valueStr": null
                    }
                  ],
                  "tokenKey": null,
                  "isHideTalent": true
                }
              ],
              "trait": []
            },
            {
              "target": "TALENT_DATA_ONLY",
              "isToken": false,
              "talents": [
                {
                  "displayRangeId": false,
                  "upgradeDescription": "Gains up to +70 ASPD and SP recovery rate +2.3/s <$ba.berserk>Tenacity</> (reaches maximum bonus when losing 50% Max HP)",
                  "talentIndex": 0,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 60
                  },
                  "requiredPotentialRank": 0,
                  "prefabKey": "1",
                  "name": "Candlelight's Shadow",
                  "description": null,
                  "rangeId": null,
                  "blackboard": [
                    {
                      "key": "min_hp_ratio",
                      "value": 0.5,
                      "valueStr": null
                    },
                    {
                      "key": "min_attack_speed",
                      "value": 70,
                      "valueStr": null
                    },
                    {
                      "key": "min_sp_recovery_per_sec",
                      "value": 2.3,
                      "valueStr": null
                    }
                  ],
                  "tokenKey": null,
                  "isHideTalent": false
                }
              ],
              "trait": []
            }
          ]
        }
      ]
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "When I first became a Candleholder, it took me three whole months to finish reading all the literature in the Sui Regulator's library. The paperwork you have piled up here... is no less impressive in size. I will have time to familiarize myself with my duties, right?",
      "voiceAsset": "char_4121_zuole/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Doctor? Let me join you for a walk... Oh, it's just Kroos and Mr. Nothing said they would take me around to introduce myself to all the operators on the landship. They've been very warm, much more so than when we first met... Wait, what? You're inspecting the entire ship today?",
      "voiceAsset": "char_4121_zuole/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "My father forged these blades for me. 'Drive out the shadows of the Feranmut and all the people's troubles.' A Candleholder's work is not so simple that we can manage it with force alone... Um, of course, I've also been practicing my kung fu every day!",
      "voiceAsset": "char_4121_zuole/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Yes, I do know Lin Qingyan. We held different titles, serving the Sui Regulator and the Central Judicial Office respectively. I've had my doubts about Rhodes Island before I arrived, and my time spent here has only doubled those suspicions. That being said, I shan't pry into the matters that 'Operator Leizi' is investigating.",
      "voiceAsset": "char_4121_zuole/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "That Operator just now... was that Lord Wei's niece? No, I don't know her, but when I was little, my father told me to learn from her example. Not long ago, we discovered that Miss Ch'en resigned her position with the Lungmen Guard Department. Father did not say anything to me that day. Thinking back, I indeed find her admirable.",
      "voiceAsset": "char_4121_zuole/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "My father sent me to Dahuang in hopes that I would reflect upon my mistakes and improve as a man. Indeed, one should avoid deviating from the proper path. But perhaps my father's meaning runs deeper... Decades ago, he and the Grandmaster worked all night on a blade at the Sword Forge, making them late for work the following morning. Hmm... It may be that Father hates to see the flame in my heart snuff out.",
      "voiceAsset": "char_4121_zuole/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "I'll keep an eye on the siblings, but I can't simply stand by and watch as Nian plays mahjong. Doctor, you've seen those exaggerated metal casts of hers. She conjures them as effortlessly as she blinks. Don't you think she's... just a little obnoxious? I can tell you're not playing dumb. That's the trickiest part.",
      "voiceAsset": "char_4121_zuole/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "On-deck capture the flag is no doubt a competition of athletic ability. I was the first to climb onto the bridge, but the Vulpo lady riding her staff breezed past me to snatch the flag. That is blatant cheating, Doctor. How could you accuse me of being too competitive and unsportsmanlike?",
      "voiceAsset": "char_4121_zuole/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "This is a handbook that all Candleholders keep on their person. I did record some observations about you, Doctor. I'm very sorry. But for what it's worth, I am now sure of one thing: You are the guiding post of this ship, and you are indeed ordinary. I will shred those pages, and I will ensure your safety.",
      "voiceAsset": "char_4121_zuole/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "The Feranmuts breathe with this vast land, and the Candleholder walks into the long night.",
      "voiceAsset": "char_4121_zuole/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Doctor, I am Zuo Le. The number of proxies aboard Rhodes Island has almost exceeded that of those in Yan. The Sui Regulator should have sent someone here long ago. In fact, it has been some time since we sent you an official notice, but it would seem your company may have forgotten to reply?",
      "voiceAsset": "char_4121_zuole/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "For a pharmaceutical company to have so competently recorded and analyzed battle records… This is nigh unimaginable.",
      "voiceAsset": "char_4121_zuole/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "My sincerest apologies, in my capacity as the mandarin, I'm afraid I cannot accept any form of 'promotion' from Rhodes Island... Ahem, what I mean is... we will forgo the titles, but I can accept the other benefits.",
      "voiceAsset": "char_4121_zuole/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "Each megastructure coursing through Catastrophes has a meaning unique to itself. Shangshu transferred its mountains and waterscapes to its nomadic cities, while Yumen fends off sandstorms with its Wind Aegis. And so, what of Rhodes Island? On what convictions do you sail?",
      "voiceAsset": "char_4121_zuole/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "I hope my meager assistance will prove fruitful.",
      "voiceAsset": "char_4121_zuole/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "To the right men, give the right jobs, enlist the talent, and forsake the snobs. I, Zuo Le, shall do my very best.",
      "voiceAsset": "char_4121_zuole/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "The arrow has been nocked. Do not hesitate.",
      "voiceAsset": "char_4121_zuole/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "The thrust of a blade takes no shape, take no comfort that it lies sheathed.",
      "voiceAsset": "char_4121_zuole/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "From here on, your words are my command.",
      "voiceAsset": "char_4121_zuole/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "The situation is complicated, I shall improvise and adapt.",
      "voiceAsset": "char_4121_zuole/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "When chaos abounds, tugging a single thread can pull the entire net.",
      "voiceAsset": "char_4121_zuole/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Not even a stirring of grass will go overlooked.",
      "voiceAsset": "char_4121_zuole/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Go no further, this road is closed.",
      "voiceAsset": "char_4121_zuole/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Such violence will not be tolerated!",
      "voiceAsset": "char_4121_zuole/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "All balance held by the orders of Yan. All beasts hunted by the sons of man!",
      "voiceAsset": "char_4121_zuole/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Tiny may a candle be, it shall drive out the darkest night!",
      "voiceAsset": "char_4121_zuole/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Seeking total victory in peril. You are truly of extraordinary talent and courage.",
      "voiceAsset": "char_4121_zuole/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "A unit never takes the same formation, as water never takes the same shape. Such extraordinary planning and execution... Doctor, I cannot fathom your past.",
      "voiceAsset": "char_4121_zuole/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Man strives for perfection, yet flaws remain in every plan. Doctor, the deed is done. Let's not dwell on it further.",
      "voiceAsset": "char_4121_zuole/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "The Sui Regulator has contingencies for all possible outcomes. Leave the cleanup to me. Don't worry, my qinggong is good. I'll catch up.",
      "voiceAsset": "char_4121_zuole/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "I've lived in tents, and I've slept in fields. I'm not particularly demanding.",
      "voiceAsset": "char_4121_zuole/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "You must have urgent need of assistance?",
      "voiceAsset": "char_4121_zuole/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Doctor, how about a game of weiqi? Or perhaps a capture-the-flag rematch?",
      "voiceAsset": "char_4121_zuole/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_4121_zuole/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "The northern mandarins are busy, just as farmers have little time for leisure... My duties have me traveling all across Yan. The Yanese are always busy, but this time of year, they come together to eat, to beat the drums, and to enjoy their reunions... The shadows have yet to fade, but likewise, the fireworks will never cease.",
      "voiceAsset": "char_4121_zuole/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Good timing. You must have something to discuss with me. Yes and no?",
      "voiceAsset": "char_4121_zuole/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "I was a fairly mischievous boy. I once leapt into a sand wheel in Yumen, nearly costing me my life. It was my birthday, so my father had me wear this mask for the entire day. Happy birthday, Doctor. Rhodes Island won't be stopping, but would you like to hop off for a look? Don't worry, I'll fly you back.",
      "voiceAsset": "char_4121_zuole/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "Londinium, Gran Faro, Trimounts... Rhodes Island has played a role in many crises. The Sui Regulator knows that you are not a simple pharmaceutical company, of course, but you have been doing everything in your power to prevent invisible disasters. And so you may stand shoulder-to-shoulder with us.",
      "voiceAsset": "char_4121_zuole/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "train_spd[001]",
      "buffName": "Master of Everything α",
      "desc": "When this Operator is assigned to be the Trainer in the Training Room, Operators' Specialization training speed <@cc.vup>+25%</>",
      "skillIcon": "bskill_train_all",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "train_spd_bd&reduceTime[000]",
      "buffName": "Think Before Acting",
      "desc": "When this Operator is assigned to be the Trainer of the Training Room, for every 1 Specialization training session completed, <$cc.t.accmuguard1><@cc.rem>Martial Arts</></> is accumulated. When <$cc.t.accmuguard1><@cc.rem>Martial Arts</></> reaches its cap, the next <@cc.kw>Guard</> Operator's skill Specialization training to level <@cc.kw>1</> is completed immediately, and all <$cc.t.accmuguard1><@cc.rem>Martial Arts</></> is removed.",
      "skillIcon": "bskill_train_accmu_guard1",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "tokens": [],
  "patch_info": {}
}