{
  "id": "char_4141_marcil",
  "meta_info": {
    "name": "Marcille",
    "appellation": " ",
    "voiceActor": {
      "en": "",
      "jp": "",
      "kr": "",
      "cn": ""
    },
    "rarity": 6,
    "profession": "Caster",
    "subProfessionId": "Splash Caster",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "AoE",
      "Healing",
      "Crowd-Control"
    ],
    "nationId": "",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Marcille\n[Gender] Female\n[Dungeoneering Experience] 2 years\n[Place of Birth] Northern Continent (Self-declared)\n[Date of Birth] Apr 19\n[Race] Elf\n[Height] 160cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Normal\n[Mobility] Normal\n[Physical Resilience] Normal\n[Tactical Acumen] Standard\n[Combat Skill] Excellent\n[Originium Arts Assimilation] ■■",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Marcille, the mage of Laios's party.\nShe claims to have unexpectedly arrived on Terra while trying to rescue her friend Falin in a dungeon. Now on Rhodes Island seeking a way home while providing medical and magic assistance.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nMarcille shows no sign of Originium infection.\n\n[Blood Originium-Crystal Density] Undisclosed\nThe Medical Department has agreed not to disclose the relevant data.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Marcille is a mage from Laios's party. Terra is home to many adventurers, but we are curious about these few calling themselves 'dungeon adventurers'. She herself makes it clear that a strong physique is not a requirement: Marcille often tires herself out before the others when on long field missions, and has barely passed most of our physical exams. By contrast, the 'magic' she uses (which could be understood as a form of Originium Arts) is quite powerful, and during missions, no matter what the task requires, she will often raise her hand, saying 'I can do this! Let me do it!' before beautifully casting a suitable magic spell.\nCompared to most operators who specialize only in one type of Arts, Marcille's repertoire of magic is quite diverse. Explosions or blinding light spells for offense, healing or barriers for support, summoning 'familiars', the ability to walk on water, and so on. In comparison, her lack of physical strength seems trivial.\nHowever, we must add a strange asterisk to this: while she is well known for her poor physical fitness, operators fond of hanging out or exercising on the streets have recently reported sightings of Marcille executing difficult-to-perform maneuvers while shouting things like 'Not eating that! No way!' Aciddrop has evaluated her to 'possibly have a talent for street dancing' and has invited her to join in street events, so perhaps we will see a new side of Marcille in the near future.",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "The Rhodes Island library boasts a huge range of books, and operators who enjoy reading spend lots of time there, Marcille included. In just a few weeks, she seems to have already finished every theoretical work on Originium Arts, compiling a thick collection of personal notes. Operator Skyfire, who was substitute teaching a class for reserve operators, was shown her notes and commented that 'they're so easy to understand that everyone in class ought to read them too.'\nMarcille only smiled at this evaluation and said: 'I did pretty good back in my magic school after all.' She also mentioned that she strove not only to advance healing magic, but has also studied the creation of harmless dungeons. Every spell she uses in the dungeon was something she studied, and it is a pity that no one in her party understands the vast knowledge required for such a feat, or realizes how powerful she actually is. Regardless, she is currently very excited at the prospect of studying a new system of magic, and is happy to share her notes on dungeon magic with our operators, hoping that everyone can learn from each other and find their own breakthroughs. Naturally, her notes were also recommended to the reserve operators as reference materials.\nSoon after, the 'Marcille's drafts incident' was all everyone talked about.\nA reserve operator reportedly found a page crammed with dense writing among Marcille's notes, and thought it could help her understand Arts, but after scrutinizing it she handed it to her teacher Skyfire, red-faced. Skyfire read it, then brought it to Orchid, who called over Midnight and the rest of Team A6 to discuss it until the sun rose. What exactly did Midnight do that could have informed Marcille of his past identity as the 'Devil of the Eastern Night' in Higashi, and also caused her to weave him and more than a dozen operators, including the Doctor, into a complex web of relationships, full of jealousy, hope, respect, control, exploitation, as well as love and hate?\nRegardless, Marcille's desire for knowledge and her skills at both theory and practice make her a role model for all operators.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "For some reason, Marcille has recently immersed herself in hobbies one could say are completely unrelated to returning to the dungeon.\nFor example, she has joined the handicraft club and learned to weave grasshoppers from straw, followed veteran operators into the wilderness to identify various fruits on Terra while gathering all kinds of berries for everyone, and learned to use a camera as she spent a whole day sitting beside Scene and capturing the sights while out on field missions, ultimately taking group shots of Laios's party along with other operators.\nWhen an operator from HR brought her recommendation letters from Leithanian universities and Columbian research institutes, they found her on the deck carefully weaving a grasshopper from straw, next to a small plate of raspberries and a bunch of previous grasshoppers that weren't quite as good as the one in her hands. She gladly accepted HR's suggestion to rely on her 'mage' identity and her outstanding abilities to enter those institutes and receive more help on their quest to return home, and explained to the somewhat puzzled operator that her recent obsession with these unrelated hobbies was because she wanted to share what she encountered on Terra with Falin. When they finally rescue her, she intends to present them all one by one and talk about what they experienced here.\n'Laios is actually more anxious than he looks. And Chilchuck won't say it, but he's already planned and optimized all our routes for the dungeon... So instead of being depressed and worried, I'm hoping to make some beautiful plans for our future too.'\nMarcille checks her freshly weaved grasshopper as she speaks, and then shows the HR operator her progress. 'The first attempt was totally unrecognizable, but now it really looks like a grasshopper. I can teach Falin how to make one too, when the day comes... I can't wait to see her again!'",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Joining the Rhodes Island Medical Department requires not only ample physiological know-how, but more importantly, a kind heart. Marcille passed this strict test and became one of the department's cooperating operators. She's also conducted comparative studies on her own healing magic and Terra's restorative Arts, to both enrich her knowledge of medical theory and help our Medic operators reach breakthroughs in curing various ailments.\nThis has taken quite a lot of her time.\nWe are extremely grateful to her for proactively participating in our tests and using the time she could have spent finding a way home instead assisting us in our research of various diseases. We are grateful to her for creating all kinds of adorable familiars to cheer up the children's ward, while paying special attention to Ceobe's condition.\nWe once asked her why she does all this, and she replied simply that she had already been studying diseases and trauma in her magic school and was used to developing new healing techniques. As Rhodes Island is helping them find a way home, she wants to return the favor by helping our patients.\nThat said, what she does for us goes far beyond 'returning the favor'.\nOur guess is that, when Laios's party first met Ceobe in the wastes, perhaps Marcille was not yet aware of Oripathy and its consequences. And once she was, she chose to help us as much as she could, even making us a promise: If we could find a way for them to travel to and from Terra, she would definitely return to continue helping us study Oripathy. She wishes to see Ceobe and the other patients on Rhodes Island for as long as she can.",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "The fortune teller at the Sami market took Marcille's hand and said a lot of baffling things, before discovering she had no money on her and turning to the next tourist. Chilchuck scoffed at this and mocked her for being an easy mark.\nLater that night, Laios's party decides to huddle up for the warmth to sleep through the freezing cold. Half-awake, Marcille seems to see a figure under the moonlight, appearing to be foolishly digging up the soil, with a filthy face, leaves stuck in their hair, and a small pile of berries picked from the Myrkwood on hand, as if right about to taste them.\nMarcille was about to quickly shout a reminder not to eat unknown fruits found in the forest, only to realize that there is nothing there but her companions fast asleep, the figure from before nowhere to be found.\nA gust of cold wind blows into the tree hollow and Marcille wraps her blanket tightly around her as she prepares to return to sleep. A small snowflake appears before her, carried by the wind, and it stays for a long time before melting.\nShe suddenly recalls something the fortune teller said, in-between their wild ramblings: if you see a snowflake in Sami that does not melt, it is the person you wanted to see the most, talking to you.",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1407,
      "atk": 767,
      "def": 109,
      "magicResistance": 20,
      "blockCnt": 1,
      "baseAttackTime": 2.9,
      "respawnTime": 70,
      "cost": 34
    }
  },
  "skins": [
    {
      "skinId": "char_4141_marcil#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_4141_marcil",
      "portraitId": "char_4141_marcil_1",
      "illustId": "illust_char_4141_marcil_1",
      "modelName": "Marcille",
      "drawerList": [
        "Studio Montagne"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_4141_marcil#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_4141_marcil_2",
      "portraitId": "char_4141_marcil_2",
      "illustId": "illust_char_4141_marcil_2",
      "modelName": "Marcille",
      "drawerList": [
        "Studio Montagne"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_4141_marcil@dungeon#1",
      "skinName": "Terra & Traveller",
      "skinGroupName": "Delicious in Dungeon",
      "skinGroupId": "2024#deliciousInDungeon",
      "avatarId": "char_4141_marcil_dungeon#1",
      "portraitId": "char_4141_marcil_dungeon#1",
      "illustId": "illust_char_4141_marcil_dungeon#1",
      "modelName": "Marcille",
      "drawerList": [
        "Studio Montagne"
      ],
      "description": "<color name=#ffffff>Brand Collaborative Series/Terra & Traveller. Clothes Marcille wears when telling stories of her adventures aboard Rhodes Island. She acts as she imagines the Lunatic Magician would, summoning several familiars with a wave of her hand. Some of them even look like our operators!</color>",
      "rarity": 175
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "2-3",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 810,
            "atk": 424,
            "def": 52,
            "magicResistance": 10,
            "cost": 31,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1125,
            "atk": 598,
            "def": 79,
            "magicResistance": 10,
            "cost": 31,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 80,
      "rangeId": "3-6",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1125,
            "atk": 598,
            "def": 79,
            "magicResistance": 15,
            "cost": 34,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1407,
            "atk": 767,
            "def": 109,
            "magicResistance": 15,
            "cost": 34,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3251",
          "count": 5,
          "type": "MATERIAL",
          "name": "Caster Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_CST1"
        },
        {
          "id": "30062",
          "count": 5,
          "type": "MATERIAL",
          "name": "Device",
          "rarity": 2,
          "iconId": "MTL_SL_BOSS2"
        },
        {
          "id": "30052",
          "count": 4,
          "type": "MATERIAL",
          "name": "Polyketon",
          "rarity": 2,
          "iconId": "MTL_SL_KETONE2"
        }
      ]
    },
    {
      "maxLevel": 90,
      "rangeId": "3-6",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1407,
            "atk": 767,
            "def": 109,
            "magicResistance": 20,
            "cost": 34,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 90,
          "data": {
            "maxHp": 1805,
            "atk": 914,
            "def": 130,
            "magicResistance": 20,
            "cost": 34,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 2.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3253",
          "count": 4,
          "type": "MATERIAL",
          "name": "Caster Dualchip",
          "rarity": 5,
          "iconId": "MTL_ASC_CST3"
        },
        {
          "id": "30155",
          "count": 4,
          "type": "MATERIAL",
          "name": "Nucleic Crystal Sinter",
          "rarity": 5,
          "iconId": "MTL_SL_SHJ"
        },
        {
          "id": "30094",
          "count": 2,
          "type": "MATERIAL",
          "name": "Grindstone Pentahydrate",
          "rarity": 4,
          "iconId": "MTL_SL_PG2"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_marcil_1",
      "skillName": "A Top Student's Abilities",
      "desc": "After <$ba.chant>Chanting</> for a short time, activates the skill. Consumes <@ba.vdown>{sp_cost}</> <$ba.magicpoint>Mana</> every attack, and ATK <@ba.vup>+{atk:0%}</>. If there are no enemies within range, heals allied operators instead\n<@ba.rem>Skill can be manually deactivated</>",
      "iconId": "skchr_marcil_1",
      "spCost": 80,
      "initSp": 25,
      "duration": -1,
      "blackboard": [
        {
          "key": "chant_duration",
          "value": 1.5
        },
        {
          "key": "skill_cost_min_sp",
          "value": 2
        },
        {
          "key": "mana_init",
          "value": 25
        },
        {
          "key": "atk",
          "value": 1.4
        },
        {
          "key": "sp_cost",
          "value": 2
        },
        {
          "key": "mana_max",
          "value": 80
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30103",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31054",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_marcil_2",
      "skillName": "Summon Familiar",
      "desc": "After <$ba.chant>Chanting</> for <@ba.vdown>{chant_duration}</>s, consumes <@ba.vdown>{sp_cost}</> <$ba.magicpoint>Mana</> to create a familiar to attack; ATK <@ba.vup>+{atk:0%}</>, attacks <$ba.sluggish>Slow</> all targets for <@ba.vup>{attack@sluggish}</>s.\nSkill can be activated again to upgrade the familiar; attack range <@ba.vup>+1</>, ASPD <@ba.vup>+{attack_speed}</>, attacks <$ba.stun>Stun</> the main target for <@ba.vup>{attack@stun}</>s\n<@ba.rem>Unlimited duration. Skill can be manually deactivated during first activation</>",
      "iconId": "skchr_marcil_2",
      "spCost": 80,
      "initSp": 10,
      "duration": -1,
      "blackboard": [
        {
          "key": "chant_duration",
          "value": 11
        },
        {
          "key": "skill_cost_min_sp",
          "value": 35
        },
        {
          "key": "mana_init",
          "value": 10
        },
        {
          "key": "atk",
          "value": 1
        },
        {
          "key": "attack@sluggish",
          "value": 0.5
        },
        {
          "key": "attack_speed",
          "value": 60
        },
        {
          "key": "attack@stun",
          "value": 0.5
        },
        {
          "key": "sp_cost",
          "value": 35
        },
        {
          "key": "mana_max",
          "value": 80
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "30064",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31043",
              "count": 1,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "31074",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31034",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30125",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30054",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_marcil_3",
      "skillName": "Explosion Magic",
      "desc": "After <$ba.chant>Chanting</> for <@ba.vdown>{chant_duration}</>s, consumes <@ba.vdown>{skill_cost_min_sp}</> <$ba.magicpoint>Mana</> to create an explosion in front of the unit at max range; explosion deals <@ba.vup>{atk_scale:0%}</> ATK as Arts damage to surrounding enemies and causes high ground tiles to collapse, <$ba.stun>Stunning</> them for <@ba.vup>{stun}</>s\n<$ba.chant>Chanting</> can be extended for <@ba.vdown>{extra_chant_duration}</>s; upon completion, consumes <@ba.vdown>all remaining</> <$ba.magicpoint>Mana</>; for every <@ba.vdown>{sp_cost_extra}</> additional <$ba.magicpoint>Mana</> consumed, create 1 additional explosion\n<@ba.rem>Extended chanting can be manually deactivated</>",
      "iconId": "skchr_marcil_3",
      "spCost": 80,
      "initSp": 40,
      "duration": -1,
      "blackboard": [
        {
          "key": "chant_duration",
          "value": 5
        },
        {
          "key": "extra_chant_duration",
          "value": 10
        },
        {
          "key": "skill_cost_min_sp",
          "value": 8
        },
        {
          "key": "mana_max",
          "value": 80
        },
        {
          "key": "mana_init",
          "value": 40
        },
        {
          "key": "sp_cost_extra",
          "value": 8
        },
        {
          "key": "atk_scale",
          "value": 3.9
        },
        {
          "key": "interval",
          "value": 0.45
        },
        {
          "key": "stun",
          "value": 4
        },
        {
          "key": "trig_cnt",
          "value": 49
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 8,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30023",
              "count": 10,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 12,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 8,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 15,
              "type": "MATERIAL"
            },
            {
              "id": "30155",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31064",
              "count": 2,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_marcil",
      "moduleName": "Marcille's Badge",
      "desc": "Operator Marcille has demonstrated a remarkable magic-based aptitude for inflicting Arts casualties on multitudes of enemies.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Caster Operator during field operations to exercise Splash Caster responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_marcil",
      "moduleName": "Book Collection of the Best Magician",
      "desc": "From Marcille's reading notes...\nI sat in on some 'Originium Arts' lectures. It's what they call magic here, and there are several different schools of it—my explosion magic falls under the School of Evocation. When it was Skyfire's turn to demonstrate, the class suggested we compare the differences between our magic. Afterwards, I caught the whiff of barbecue—they shared a skewer with me and made me swear not to tell Skyfire. I think she knew anyway, because the temperature around her shot up noticeably. Not to mention, it was cold that day, to the point Mint invited me to tag-team hug Skyfire. She was wonderfully warm at first, but quickly got a little too toasty!\nFamiliar summoning falls under the School of Transmutation, which is where Originium energy is used to alter something's physical composition. The class was dying to see my familiars against Mudrock's Colossi in a tug-of-war, which we refused. However, someone mentioned a game called 'beast arenas', which aren't contests of brute strength, but a magician's wisdom and skill—now this we couldn't refuse. After eventually bringing a box into the room, we made our miniature familiar and 'rockbeast' respectively. Still, Mudrock didn't even need to lift a finger to control hers! I worked my butt off trying to win!\n......\nWhile listening to them chat after class, I discovered that Yan's Chief of Lungmen is reputedly extremely handsome, and his wife is the princess of a neighboring country. Not only does she ride motorbikes, but she also has a personal ninja maid! With love blossoming amidst the intricacies of politics, they must have faced countless challenges to be together. The family head even dispatched a ninja to capture the princess. The sight of the chief and the princess together in love moved the stoic and loyal ninja, prompting her to aid them, even if it meant sacrificing herself. On a dark and stormy night, the chief carved a bloody path with his sword to reach the captive princess's chambers. They dashed to her motorbike and screeched away from their pursuers into the night. The ninja, gravely injured while covering for them, faintly smiled as she watched them ride away and then closed her eyes... There's no doubt about it—that's exactly how it happened! And obviously, the chief and the princess went back later to save the ninja!\nI know the bookstall here has a tale of their love in stock. I'm going to get my hands on it!\n......\nI was only expecting a casual read. I had no idea of the truth... I'm noting down their profiles while I can!\nWei Yenwu: The elder brother of Yan's Lung. Carries a red longsword on him. No one expected he'd fall in love at first sight with a foreign lady.\nFumizuki: The Princess of Higashi. A free soul determined to rule her own life.\nShirayuki: Loyal ninja. Would do anything for her princess.\nI'm bringing Falin this novel along with all the books on Arts theory! I just know she'll love it!"
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "I did this all the time back in magic school, and I've mastered how to use all your magical tools, so you can leave everything to me! ...Someone blew up that Originium flashlight? *ahem* Well, it wasn't me!",
      "voiceAsset": "char_4141_marcil/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Canned sandworm? Lemon fin-mint noon tea? Sea Terror jerky?... NOOO! NO, NO, ABSOLUTELY NOT! ABSOLUTELY NOT!",
      "voiceAsset": "char_4141_marcil/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Here, your summary on healing magic compared to restorative Arts. What? You thought I'd take longer to finish? Heh-heh! Back in school, when I was developing a new healing magic, I'd read through tons of papers like that every day. So the next time you have any work like this, just let me handle it!",
      "voiceAsset": "char_4141_marcil/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Seventh Night's Awakened'? 'Fiend of the Night'? Do you really have members with such titles? Sounds like they walked straight out of some ancient legend. Awakened in a banquet of blood and darkness, a lonely moon glimmering in his blood-red pupils, surrounded by countless... Huh? Who was that man being dragged away by the ear?",
      "voiceAsset": "char_4141_marcil/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "My gosh, these vegetables are so fresh! No soil at all, just water? I never knew you could garden with such devices! Having one of these in the dungeon would solve everything! ...You need electricity to run it...? Well, I'll pedal a whole generator if that's what it takes!",
      "voiceAsset": "char_4141_marcil/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "It's true Familiar Creation is a dangerous magic, but I saw those children in the Medical Department and... They saw me as a mighty sorceress from the dungeon! And the one who can summon these little things to play with them! Aww, look how much they love it.",
      "voiceAsset": "char_4141_marcil/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Just a moment ago, I saw Laios eating yet another monster I've never seen. It was tall as a half-foot, covered in thorns, and it squirted poison. Doctor, how long until food poisoning symptoms show? Never mind, I'll just pay a visit to the Medical Department and get prepared beforehand...",
      "voiceAsset": "char_4141_marcil/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "I learned how to make this straw grasshopper in a handicraft class. When we go back, I'll give it to Falin. The first time we hanged out together, she caught a grasshopper live, and she took me to see a real dungeon, and we ate raspberries... That was the day we became friends. I'll always remember it.",
      "voiceAsset": "char_4141_marcil/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "Doctor, can you show me how you use that thing you call a camera? I want to take a photograph of us—you, Laios and everyone. When we go back, I'll show it to Falin and tell her about each one of you. Am—am I doing it right? Laios, huddle up a little more. Three, two, one,  cheese—",
      "voiceAsset": "char_4141_marcil/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "...I wonder if my sleeping bag's still on the fifth floor... and the really valuable soap... *snzzz*... *snzzz*...",
      "voiceAsset": "char_4141_marcil/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Thank you for helping us in finding a way back! Oh, yes, and my party may not look it but they're all wonderful people, and if they do anything strange, er, please try and forgive them...",
      "voiceAsset": "char_4141_marcil/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "Is this really the time rewind magic which allows you to relive the past? On a scale this big? How is it done? Can you teach me?",
      "voiceAsset": "char_4141_marcil/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "So in other words, I have the permissions now to borrow all the books on advanced Originium Arts theory? Wow! Thank you!",
      "voiceAsset": "char_4141_marcil/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "When I tell Falin about everything that's happened to us, she's sure to be excited... And that's just one more reason we have to make it back, and save her!",
      "voiceAsset": "char_4141_marcil/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "Magic tome, staff, repair tools... Done. Everything's packed and I'm ready to go.",
      "voiceAsset": "char_4141_marcil/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Huh? Wait a moment, our leader's always been Laios.",
      "voiceAsset": "char_4141_marcil/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "Let's go. As long we have a battle plan, I can make it work.",
      "voiceAsset": "char_4141_marcil/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "Don't worry, I just ate my fill. My mana is in tip-top shape.",
      "voiceAsset": "char_4141_marcil/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "Take it easy. Just leave it to me.",
      "voiceAsset": "char_4141_marcil/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Do you want me to ready a magic circle?",
      "voiceAsset": "char_4141_marcil/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "I've never seen all these monsters before...",
      "voiceAsset": "char_4141_marcil/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Over there, right?",
      "voiceAsset": "char_4141_marcil/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Ever since my last familiar channeling, my arm's been sore...",
      "voiceAsset": "char_4141_marcil/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Fall back, let me handle this! I'll wipe them all out!",
      "voiceAsset": "char_4141_marcil/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Exhausting your mana is dangerous. Be careful how you plan your tactics, you know.",
      "voiceAsset": "char_4141_marcil/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "I can see the monsters! Just give me a moment to aim...!",
      "voiceAsset": "char_4141_marcil/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Heh-heh! And THAT'S why I was top of my class.",
      "voiceAsset": "char_4141_marcil/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "I know for a fact Rhodes Island has regular cuisine! Why are Laios and Senshi still rushing to cook up the monsters we defeat?!",
      "voiceAsset": "char_4141_marcil/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Phew, still alive. I almost ended up a full-course meal for the monsters...",
      "voiceAsset": "char_4141_marcil/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "AHHHHHH! RUN FOR IT!!",
      "voiceAsset": "char_4141_marcil/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "I have to say, it's just like a dungeon in here...",
      "voiceAsset": "char_4141_marcil/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "EYAARGH! ...Oh, thank heavens, I thought you were a man-eating plant!",
      "voiceAsset": "char_4141_marcil/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Are you heading to the Library too? Excellent, let's go together!",
      "voiceAsset": "char_4141_marcil/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_4141_marcil/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "It feels like it was just yesterday that we got here. I've already gotten the hang of that camera you showed me how to use! Right, we should take another photo today, with all my new friends—a big group photo altogether. Falin will love hearing all our stories!",
      "voiceAsset": "char_4141_marcil/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Doctor, how did you sleep last night? If you've been having bad dreams, then you want to check for Nightmares in your pillow—that's what we do before sleeping in the dungeon!",
      "voiceAsset": "char_4141_marcil/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "It took me forever to pick out your gift. As a huge, huge fan of The Daltian Clan, this one hits all the same notes, and the narrative and writing style are superb. Promise me this, Doctor, you WILL read it! Very well, it's yours—the classic romance tale, <i>Love on Terra!</i>",
      "voiceAsset": "char_4141_marcil/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "I studied the theory of maladies and injuries in magic school, and took up developing healing magic as well. I know just how excruciating it is to battle with a seemingly incurable disease. Doctor, if you're ever in need, I'll be there to give all the help I can.",
      "voiceAsset": "char_4141_marcil/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "manu_prod_spd[004]",
      "buffName": "Familiar Dispatch α",
      "desc": "When this Operator is assigned to a Factory, productivity <@cc.vup>+20%</>",
      "skillIcon": "bskill_man_marcille1",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "manu_prod_spd[014]",
      "buffName": "Familiar Dispatch β",
      "desc": "When this Operator is assigned to a Factory, productivity <@cc.vup>+30%</>",
      "skillIcon": "bskill_man_marcille2",
      "phase": "PHASE_2",
      "level": 1
    },
    {
      "buffId": "manu_prod_spd_bd[400]",
      "buffName": "Unexpectedly Delicious",
      "desc": "When this Operator is assigned to a Factory, <@cc.vup>+1%</> productivity for every <@cc.vup>1</> <$cc.bd_dungeon><@cc.rem>Monster Meal</></>",
      "skillIcon": "bskill_man_spd_bd_dungeon",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}