{
  "id": "char_4032_provs",
  "meta_info": {
    "name": "Proviso",
    "appellation": " ",
    "voiceActor": {
      "en": "Allegra Clark",
      "jp": "Madoka Yonezawa",
      "kr": "Kim Chae-rin",
      "cn": "Ying Xie"
    },
    "rarity": 5,
    "profession": "Supporter",
    "subProfessionId": "Decel Binder",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "Debuff",
      "Slow"
    ],
    "nationId": "Kazimierz",
    "isNotObtainable": false,
    "itemObtainApproach": "Recruitment & Headhunting",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Proviso\n[Gender] Female\n[Combat Experience] None\n[Place of Birth] Kazimierz\n[Date of Birth] Oct 30\n[Race] Kuranta\n[Height] 165cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Normal\n[Mobility] Standard\n[Physical Resilience] Normal\n[Tactical Acumen] Standard\n[Combat Skill] Normal\n[Originium Arts Assimilation] Normal",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Proviso, real name Deszcz, former attorney of Longrein Law Firm in Kazimierz. Now working in Rhodes Island's Logistics Department as a legal consultant.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Proviso shows no signs of Originium infection.\n\n[Blood Originium-Crystal Density] 0.12u/L\nOperator Proviso rarely comes into contact with Originium.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Proviso left a deep impression on our HR operators the day she reported in. After all, not many new hires take the time to review each and every word in their contract, and then go on to lament with an extremely disappointed and slightly complimentary tone, 'I couldn't find any mistakes...'\nEven before her arrival, the HR Department was already hesitant about hiring Ms. Deszcz, now known as Operator Proviso, after reviewing her resume and conducting a routine background check.\nProviso previously worked as a lawyer at the Longrein Law Firm, Kazimierz's top firm, in both litigation and non-litigation. She's had an impressive track record over the years, with a considerable number of cases under her belt and an unbroken streak of victories in the courtroom. When we reviewed the relevant case records, we found that Operator Proviso was never concerned with whether the results were just or not. She focused solely on earning victory for her clients, and there were many questionable aspects in the way she handled her cases.\nEven though we can find no flaw in her abilities, we were concerned whether a lawyer with her values would fulfill our requirements.\nOperator Proviso provided detailed answers to all of our questions. She assured us that her previous affairs had been wrapped up and would not create a conflict of interest. In addition, she mentioned she was very interested in our actions during the Major. That is also the reason she chose to join Rhodes Island: it seemed to be a company that was actually trying to do good. And she chose to give up her old job because, as she put it, she 'saw the stars.'",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Many young people find it difficult to adjust during the transition from student to employee, and Proviso was no exception.\nWhen she worked her first case as a fresh lawyer, her mentor asked if she wanted to win. When she answered affirmatively, she was told that they would hide a key piece of evidence until the hearing was halfway through. She was then to claim that 'the inspection agency has just finished analyzing the data,' at which point her mentor would enter the courtroom and deliver the new piece of evidence: a repaired recording of a conversation. With it, Proviso was able to discredit the witness's testimony and place responsibility on the secretary, who had been blinded by the huge amount of money involved. He was found guilty and sentenced to prison.\n'A beautiful first win.' That's what everyone at the law firm said about her performance.\nLater, while in prison, the secretary was apparently able to suddenly prove his innocence. Supposedly, it was done with a note written in his own blood. His mother is said to have committed suicide not long after. Proviso had heard many of these alleged events. At the time, she was responsible for helping a high-ranking executive clear himself of bribery charges, and among his many transactions, one of the most frequent recipients was the secretary's superior. She realized at that point that there may have been more to her first case, so she suggested to her mentor that they should get the case retried.\nBut her mentor simply sat behind his desk and looked at her coldly without saying a word.\nShe remembered that when she was still a student filled with admiration, she would head to the courtroom to watch him work. Even though he was the executive defendant's defense attorney, he argued <i>for</i> the staff member plaintiff, and in the end bowed deeply to everyone in the stands. 'Whatever is necessary to uphold justice,' he said at the time.\nProviso said nothing more. She did absolutely everything she could to get the executive's charges thrown out, and earned a huge sum of money. Later, she anonymously sent the full amount to the prisoner's wife and never again brought it up again.",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "'The ice-cold Mr. Młynar.' That's what Proviso always calls Operator Młynar. However, she often tells us that he isn't actually as cold and indifferent as he seems, and in fact they had a short conversation when they first met.\nThey had run into each other by chance on their way to Twierdza, and while crossing a simple wooden bridge on the way to the village they came across an old man carrying heavy firewood on his back. As the old man slowly made his way to the other side of the bridge, Proviso stretched her ankles and looked around for a place to rest. She quietly said to herself, 'I wonder how much he'll make from that bundle of firewood?'\nProviso said she kept zoning out afterwards. A few days prior, she had just won a case for a certain executive and received a huge sum of money for her services. She knew she had seen plenty of things she shouldn't have while collecting evidence, and her payment was greater than previously agreed on. In other words, she was being paid to keep her mouth shut, and she had assured her discretion. However, after celebrating at a pub, and despite the security features installed in her home, she returned to find a torn business suit hung from the ceiling. She panicked, but also felt a bit relieved, as it meant that was as far as the executive's threat went. At the very least, it was her clothes hanging from the ceiling, not her. She had already experienced similar incidents more than a dozen times, and so when she looked over the rural landscape on the way to Twierdza, all she had on her mind was whether she should purchase a home there to lay low, and how she would have to change the wording in her contracts to keep anyone from finding it.\nProviso paused for a moment, then continued to talk about her journey.\nAs she was zoning out, she paid little attention to the question she had posed on a whim, but after a brief silence, Młynar suddenly gave her a number. Proviso said she was flabbergasted. She could only see his fed up, sorrowful expression after he spoke, and did not understand why he would suddenly answer her question. But after the day's work, she spotted a man in the fields. It was the same old man, having finally traversed the endless rural paths and made it back to his village before dark. He had a small amount of change in his hands, worth roughly the same as the number Młynar gave her.\nShe was holding her terminal in her hand at the time, and just about to answer a phone call from her employer, yet for whatever reason, she did not press the button to pick up the call until the old man had slowly gone back inside his home. According to Proviso, she shuddered when she heard the voice on the other end of the line.",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "A 'letter of intent' instead of a 'services agreement,' incomplete bidding documents, and no thorough assessment of the workload... You have all these mistakes laid out in front of me, but won't let me seek damages. That just makes me sad, you know?\nYes, I understand. A few other lawyers have already told me about Rhodes Island's standards. But it is a serious error for a commercial corporation not to closely review the contracts it signs. As Rhodes Island's lawyer, I'm on your side, of course.\nBut what if I worked for a company we were fighting in court?\nNaturally, it'd be to my benefit to sniff out every mistake Rhodes Island has ever made—who's to say what would happen if I actually filed a lawsuit?\nYes, I'm a lawyer.\nBut I'm <i>just</i> a lawyer. If both sides present strong evidence in their favor, the side whose evidence is lacking will lose. The law is just that straightforward.\nMy beliefs? What about my beliefs?\nHey!\nTake a closer look at these lawsuits. These companies aren't the good guys you're making them out to be. This one had news break out a couple years ago about them abusing their Infected employees, while this one once fired a huge number of company veterans. And this one. I have proof that they've covered up their workers' deaths.\nNow that I'm working for Rhodes Island, of course I know what it is you guys are trying to do— Besides, the new Infected laws they introduced these past few years are riddled with holes. Compared to all the commercial laws everyone's poured over for ages, and come up with countless interpretations for every single word, this couldn't be any easier!\nThat's why you have to trust me, and I'll do my best to help you within the bounds of what you'll allow.\nHow about it? Can you let me give it a try?\nI'll hit 'em right where it hurts: the bank account!",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "After a round of mediation, the self-satisfied client leans back into the sofa, swirls the wine in his glass, and asks the lawyer in front of him, 'Miss Deszcz, with someone like you on our side, it's like the law is our own personal protective talisman.'\nHe waits for a compliment.\n'Maybe you should off that director and take over the company, then?\n'You aren't going to tell me you don't have the heart to, are you? You just swallowed an entire business, and I'm sure we'll be seeing the shriveled faces of plenty of bankrupt executives on the news tomorrow morning.'\nThe client is flabbergasted.\n'What I'm saying is the law ensures that this is the best you can manage.' Deszcz swirls the wine in her glass as well. 'Perhaps this might offend you, but at the very least, you have to take into consideration that the law exists, no?'\n'This way, at least their lawyers can earn them some damages for them to survive on. The law helps you win, it keeps them alive, and the worst case scenario doesn't come to pass.\n'What's more, I make loads of money every step of the way.'",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1038,
      "atk": 425,
      "def": 85,
      "magicResistance": 20,
      "blockCnt": 1,
      "baseAttackTime": 1.9,
      "respawnTime": 70,
      "cost": 15
    }
  },
  "skins": [
    {
      "skinId": "char_4032_provs#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_4032_provs",
      "portraitId": "char_4032_provs_1",
      "illustId": "illust_char_4032_provs_1",
      "modelName": "Proviso",
      "drawerList": [
        "せんむ"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_4032_provs#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_4032_provs_2",
      "portraitId": "char_4032_provs_2",
      "illustId": "illust_char_4032_provs_2",
      "modelName": "Proviso",
      "drawerList": [
        "せんむ"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_4032_provs@summer#17",
      "skinName": "Holiday HD78",
      "skinGroupName": "Coral Coast/XVII",
      "skinGroupId": "2024#summer#2",
      "avatarId": "char_4032_provs_summer#17",
      "portraitId": "char_4032_provs_summer#17",
      "illustId": "illust_char_4032_provs_summer#17",
      "modelName": "Proviso",
      "drawerList": [
        "せんむ"
      ],
      "description": "<color name=#ffffff>MARTHE [Coral Coast] Holiday Series HD78. Comfortable, relaxed, breathable, and lightweight. Allows you to enjoy a perfect beach experience in absolute relaxation.</color>",
      "rarity": 95
    },
    {
      "skinId": "char_4032_provs@wild#7",
      "skinName": "High Autumn",
      "skinGroupName": "Vitafield/VII",
      "skinGroupId": "2023#wild",
      "avatarId": "char_4032_provs_wild#7",
      "portraitId": "char_4032_provs_wild#7",
      "illustId": "illust_char_4032_provs_wild#7",
      "modelName": "Proviso",
      "drawerList": [
        "せんむ"
      ],
      "description": "<color name=#ffffff>Vitafield [Camper] Series Classics/High Autumn. Designed for outdoor activities, providing extra support for the body. The comfortable and breathable fabric dries quickly.</color>",
      "rarity": 127
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "y-2",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 606,
            "atk": 216,
            "def": 46,
            "magicResistance": 10,
            "cost": 13,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 820,
            "atk": 318,
            "def": 66,
            "magicResistance": 10,
            "cost": 13,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 70,
      "rangeId": "y-2",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 820,
            "atk": 318,
            "def": 66,
            "magicResistance": 15,
            "cost": 15,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 1038,
            "atk": 425,
            "def": 85,
            "magicResistance": 15,
            "cost": 15,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3271",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30062",
          "count": 4,
          "type": "MATERIAL"
        },
        {
          "id": "30042",
          "count": 4,
          "type": "MATERIAL"
        }
      ]
    },
    {
      "maxLevel": 80,
      "rangeId": "y-2",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1038,
            "atk": 425,
            "def": 85,
            "magicResistance": 20,
            "cost": 15,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1298,
            "atk": 513,
            "def": 102,
            "magicResistance": 20,
            "cost": 15,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.9,
            "respawnTime": 70,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3273",
          "count": 3,
          "type": "MATERIAL"
        },
        {
          "id": "30044",
          "count": 7,
          "type": "MATERIAL"
        },
        {
          "id": "30083",
          "count": 12,
          "type": "MATERIAL"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skchr_provs_1",
      "skillName": "Dispute Litigation",
      "desc": "The next attack deals <@ba.vup>{atk_scale:0%}</> ATK as Arts damage, and slightly increases the Trait's <$ba.sluggish>Slow</> duration\n<@ba.rem>Can store {ct} charges</>",
      "iconId": "skchr_provs_1",
      "spCost": 5,
      "initSp": 0,
      "duration": -1,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 3
        },
        {
          "key": "sluggish",
          "value": 1.6
        },
        {
          "key": "ct",
          "value": 3
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30053",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 7,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30115",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_provs_2",
      "skillName": "Prevailing Argument",
      "desc": "Deal <@ba.vup>{atk_scale:0%}</> ATK as Arts damage to all units within range, causing them to become <$ba.sluggish>Slowed</> and silenced for <@ba.vup>{sluggish} sec</>, then reduce own attack interval significantly",
      "iconId": "skchr_provs_2",
      "spCost": 25,
      "initSp": 15,
      "duration": 10,
      "blackboard": [
        {
          "key": "atk_scale",
          "value": 3.5
        },
        {
          "key": "sluggish",
          "value": 10
        },
        {
          "key": "silence",
          "value": 10
        },
        {
          "key": "base_attack_time",
          "value": -1.1
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30084",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "31053",
              "count": 2,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30104",
              "count": 5,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31014",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_provs",
      "moduleName": "Proviso's Badge",
      "desc": "Operator Proviso has demonstrated a remarkable aptitude for impeding the enemy.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Supporter Operator during field operations to exercise Decel Binder responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named."
    },
    {
      "moduleId": "uniequip_002_provs",
      "moduleName": "Deszcz's Graduate Memento",
      "desc": "Deszcz's 'The Conflict, Reconciliation, and Imagined Future of Kazimierz's Present Legislature with Regards to Trade Capital' is an incisively opined piece, fully and flawlessly expounded on, and combines depth of theory with practical value. It is, with no room for doubt, a superlatively written essay. But conferring on her the law school's honor of Outstanding Graduate was a decision I had to vie with some other teachers over.\nHaving taught for decades, we often see students with aspiration in their hearts, their hands faintly trembling against the cover of the Code they swear their oath on, their anticipation and resolution a burning light in their eyes. We also often see students who change course or lose their bearings midway; they ask why a prompt as absurd as 'A thief lacerates a victim's arm intending to intimidate; however, the victim suffers from aplastic anemia and soon passes away from blood loss. What criminal charges and sentencing would be appropriate?' would appear on the bar exam, and soon after are taken aback to find that in Kazimierz, what one learns, what is tested, and what one uses all stand completely on their own. Every clause in the code is well-defined yet unfortunately narrow, and cannot keep pace with the speed at which the arena and the commercial streets develop. The dispute between 'the means justify the ends' and 'the ends justify the means' exists only in the classroom, and in reality, practical law is much more dependent on interpretation, supplementation, and guidance by precedent-setting cases... its form in a vacuum being the true face of Kazimierz law. It's not an easy pill to swallow for us old-timers, to say nothing of the youth.\nDeszcz is a reasonably excellent student. I once advised her to remain at the school to further her studies; perhaps the additional knowledge and dialectical thought would polish her acute mind to possess greater wisdom. However, she was all but itching to unleash her ferocity in true combat. She'd already obtained a formal job offer from the Longrein Law Firm prior to writing this thesis. Before she went into the field, I went and greeted the fine lawyer who took her on, begging him to take care of this student did not yet understand a thing. But he said Deszcz had 'adapted' very well to the firm, had suggested a number of improvements that hit the nail on the head, and spurred headway on their lawsuits, so he exhorted me not to worry too much.\nDeszcz is too clever, and too uncompromising—this is the greatest thing separating her from most students. Her dedication to using law to seek the truth has supported her in achieving such excellent grades, but she has yet to prepare herself for 'being unable to find an answer.' As we all know, the more devout the believer, the more susceptible they are to falling into an even deeper emptiness when that belief crumbles. As teachers, we have no right to choose our students' paths forward. We can only be there behind them, to send them off and wish them well.\nIt's my hope that she doesn't become simply the next youth to lose their way amidst the Grand Knight Territory's resplendent neons.\n......\n\n—Extracted from a speech made by Deszcz's mentor, Professor Łobacz, at the internal evaluation conference for the school's Outstanding Graduates"
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "These documents won't take me long to take care of. Why don't you show me Rhodes Island's old business contracts? You never know what kind of restitutions there might be hidden in a contract's terms.",
      "voiceAsset": "char_4032_provs/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "Doctor, when you work out your business plans, feel free to put off the legal ramifications till the very end. I've never lost a case as a defense attorney.",
      "voiceAsset": "char_4032_provs/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "Huh? Even that ice-cold Młynar is here? And here I thought he'd want a breather after leaving his job behind in the Grand Knight Territory. Well, Rhodes Island isn't a bad place. At least they don't expect you to wine-and-dine clients here. Otherwise, considering his alcohol tolerance...",
      "voiceAsset": "char_4032_provs/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Is that a Kazimierzian newspaper you're reading, Doctor? 'Despite Conclusive Evidence, Knight Sports Match Fixers Found Innocent'—Oh, I was in charge of that case. What does that mean? Hehe, if they walked away scot-free, then obviously the evidence wasn't conclusive enough.",
      "voiceAsset": "char_4032_provs/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "I've never actually worked for a multinational corporation before, so I've been reading up on other countries' laws, too. But no matter where you are, the lawbooks make it clear as day who benefits under their rules.",
      "voiceAsset": "char_4032_provs/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "The courtroom is a place of victory and defeat. Both sides submit their evidence, and their disputes are arbitrated within the confines of the law. I never expected to find any justice in that process, but when the law can be freely trampled on by capitalism, being a lawyer gets real boring, don't you think?",
      "voiceAsset": "char_4032_provs/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Ugh, my back hurts. I kind of want a massage chair, but money's tight with my current salary. But considering Rhodes Island's revenue, I suppose the pay isn't completely unreasonable—Speaking of which, what do you think of my plan to demand compensation from companies we've worked with? What? How can it be extortion when we're asking for pocket change?!",
      "voiceAsset": "char_4032_provs/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Doctor, I think there are a lot of problems with the medical malpractice liability clauses in Rhodes Island's contracts. In most countries, we as a medical company wouldn't be liable for a lot of the scenarios listed in there—You don't want to fix it? Alright, I'll give it some more thought.",
      "voiceAsset": "char_4032_provs/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "I'm slowly starting to understand that expecting the law be able to judge all disputes fairly isn't just naive, it's intellectually lazy. The law is not perfect, and it will always be riddled with holes that we need to fill with humanity.",
      "voiceAsset": "char_4032_provs/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "So even the Doctor likes to sleep at the desk, just like me. I'll be worried about your spine if this keeps up, though…",
      "voiceAsset": "char_4032_provs/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Hello, my name is Deszcz. I'm your new legal consultant. If you need to call me by a codename, then use Proviso. Let me get this out of the way first, though. The general practice of obfuscating all your employees' identities isn't going to fly with me.",
      "voiceAsset": "char_4032_provs/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "If you're putting me in charge, I can make sure the enemies will be liable for all damages.",
      "voiceAsset": "char_4032_provs/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "A promotion? Let me take a look at the new contract... Alright, everything checks out. My salary did go up. Thanks!",
      "voiceAsset": "char_4032_provs/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "If you're letting me read these high clearance level materials, this is going way beyond a normal partnership, isn't it...? Thanks for your trust, Doctor. I hope I'll be able to accomplish with law what I never could before I came here.",
      "voiceAsset": "char_4032_provs/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "I'm glad to help, but before we get started, can we be more explicit with regards to the terms of compensation?",
      "voiceAsset": "char_4032_provs/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "Everyone, please be sure to handle the work you're assigned. Do not give our opponents any loopholes.",
      "voiceAsset": "char_4032_provs/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "The court is now in session!",
      "voiceAsset": "char_4032_provs/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "I've gathered enough materials on our opponents. They will lose this case.",
      "voiceAsset": "char_4032_provs/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "I never prepare drafts.",
      "voiceAsset": "char_4032_provs/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Ahem. Allow me to present my argument.",
      "voiceAsset": "char_4032_provs/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "If you are not party to this suit, please leave at once.",
      "voiceAsset": "char_4032_provs/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Order! The court will soon reach a verdict.",
      "voiceAsset": "char_4032_provs/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Hold it! The evidence submitted by the opposing party is suspect.",
      "voiceAsset": "char_4032_provs/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Objection! The witness's testimony is self-contradictory.",
      "voiceAsset": "char_4032_provs/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Anything you say can and will be used against you. I suggest you exercise your right to remain silent.",
      "voiceAsset": "char_4032_provs/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Based on the above, you are found guilty.",
      "voiceAsset": "char_4032_provs/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "No surprise there. As long as you understand how to use the system, the results follow naturally.",
      "voiceAsset": "char_4032_provs/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "I take it I met your expectations, Doctor? Now, per our contract, let's discuss legal fees.",
      "voiceAsset": "char_4032_provs/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "Don't worry, we'll get this case thrown out and win the retrial.",
      "voiceAsset": "char_4032_provs/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Something must've gone wrong somewhere... I won't let this kind of failure happen again.",
      "voiceAsset": "char_4032_provs/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Can I apply for a more comfortable chair?",
      "voiceAsset": "char_4032_provs/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "What?",
      "voiceAsset": "char_4032_provs/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Doctor, I took a photo of what you just did as evidence.",
      "voiceAsset": "char_4032_provs/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_4032_provs/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "I wanted to treat myself to a gift at the end of the year, only to find myself completely broke. This would've been unthinkable at my old job... Oh, whatever. It's a new year. Better not dwell on the past. Happy New Year, Doctor!",
      "voiceAsset": "char_4032_provs/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Hello, Doctor. I'm happy to report that Rhodes Island is not currently involved in any legal disputes, for now.",
      "voiceAsset": "char_4032_provs/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Happy birthday, Doctor. These scales of justice are a graduation gift I got from my law school. Take them. Not that I don't want them anymore, but I just thought it would be more meaningful for you to keep them in your room.",
      "voiceAsset": "char_4032_provs/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "Taking in patients with a incurable disease feels just like taking on an unwinnable case... That said, I also believe that the value of doing something isn't determined entirely by the results. Keep it up, Doctor, and let me deal with all those pesky corporate rivals.",
      "voiceAsset": "char_4032_provs/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "trade_ord_law[000]",
      "buffName": "Contract Law",
      "desc": "When this Operator is assigned to a Trading Post, if the amount of <@cc.kw>Pure Gold</> traded is less than <@cc.kw>4</>, it will be considered a <@cc.kw>Defaulted trade</>",
      "skillIcon": "bskill_tra_law",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "trade_ord_against[000]",
      "buffName": "Damages for Breach α",
      "desc": "When this Operator is assigned to a Trading Post, if a <@cc.kw>Pure Gold</> trade is a <@cc.kw>Defaulted trade</>, <@cc.kw>Pure Gold</> traded <@cc.vup>+1</>",
      "skillIcon": "bskill_tra_against",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "trade_ord_against[010]",
      "buffName": "Damages for Breach β",
      "desc": "When this Operator is assigned to a Trading Post, if a <@cc.kw>Pure Gold</> trade is a <@cc.kw>Defaulted trade</>, <@cc.kw>Pure Gold</> traded <@cc.vup>+2</>",
      "skillIcon": "bskill_tra_against2",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "patch_info": {}
}