{
  "id": "char_4104_coldst",
  "meta_info": {
    "name": "Coldshot",
    "appellation": " ",
    "voiceActor": {
      "en": "Stephanie Southerland",
      "jp": "Fuyuka Ono",
      "kr": "Cho Hyun-jung",
      "cn": "Xiangtong Wu"
    },
    "rarity": 5,
    "profession": "Sniper",
    "subProfessionId": "Hunter",
    "position": "RANGED",
    "team": "",
    "tagList": [
      "DPS"
    ],
    "nationId": "Columbia",
    "isNotObtainable": false,
    "itemObtainApproach": "Event Reward",
    "storyTextAudio": [
      {
        "stories": [
          {
            "storyText": "[Code Name] Coldshot\n[Gender] Female\n[Combat Experience] 18 Years\n[Place of Birth] Columbia\n[Date of Birth] Jul 26\n[Race] Elafia\n[Height] 173cm\n[Infection Status]\nMedical tests have confirmed that no infection is present.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Basic Info",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "[Physical Strength] Standard\n[Mobility] Standard\n[Physical Resilience] Standard\n[Tactical Acumen] Standard\n[Combat Skill] Standard\n[Originium Arts Assimilation] Standard",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Physical Exam",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Helena, a collaborating operator introduced to Rhodes Island by Jessica, now assisting with our local office in the frontier.",
            "unLockType": "DIRECT",
            "unLockParam": "",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Profile",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Imaging tests reveal clear, normal outlines of internal organs, and no abnormal shadows have been detected. Originium granules have not been detected in the circulatory system and there is no sign of infection. At this time, this operator is believed to be uninfected.\n\n[Cell-Originium Assimilation] 0%\nOperator Coldshot shows no signs of Originium infection..\n\n[Blood Originium-Crystal Density] 0.18u/L\nOperator Helena frequently comes into contact with Originium in her day-to-day life. Although she demonstrates adequate safety awareness, further attention is still needed.",
            "unLockType": "FAVOR",
            "unLockParam": "25",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Clinical Analysis",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "The day Helena arrived at the landship, she did not immediately report for duty as previously agreed upon. It wasn't until a number of operators reported hearing faint fowlbeast chirps on the bridge that we traced the sound to the deck and found her along with two fowlbeasts perched on the railing. Helena was enjoying her lunch with them, and imitating their chirps.\nAccording to her, that kind of fowlbeast has a peculiar habit: They rest on land on clear, windless days, and take flight only when the storm comes, throwing themselves into the gales without looking back. With the help of the fierce winds, they can fly much greater distances than other fowlbeasts. Of course, it is also a much more dangerous journey. Few of their kind ever reach their destination.\nAside from her remarkable mimicry of animal noises, Helena also counts cooking, bartending, sewing, divination, hunting, forging, transport repair, weapon retrofitting, and more among her skill set. Yet she has never received any professional training, and every last skill she possesses is a result of the hardship she endured on the frontier. Nor does she shy away from teaching the skills she's painstakingly acquired to others. Every time she comes aboard, everyone hears her signature, passionate, and loud voice inviting all the operators to taste her cooking.\n'The raisin shortbread's recipe? No problem. I'll get you a copy in a bit.\n'No one ever taught me. I was on the run from someone and hid in some battlefield ruins. There I found this poor fella. His body was almost all ash, but somehow the recipes in his pocket made it through.\n'Reckoned it'd be a shame to leave 'em, so I brought 'em with me.\n'Not for nothing, of course. Left him a nice bottle of rum.'",
            "unLockType": "FAVOR",
            "unLockParam": "50",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 1",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Never get on the same transport or burdenbeast as Helena—This is common knowledge to all the operators at the frontier office. Her driving skills are unparalleled: she has the transport's speed under her control at all times, and she can accurately make decisions based on her surroundings. Be it the most precipitous terrain of the frontier or a complicated alley, she is able to keep her hand on the gear stick without a change in expression, and speed through as though driving on flat ground.\nWhat separates her from other excellent drivers or riders is that Helena has no actual preferences for a transport or burdenbeast. In her eyes, every last one has its own temperament and personality. So as long as you understand them and drive appropriately, you can unleash speeds that tear through the wind at a moment's notice. When she's holding the reins or a steering wheel, any objective is in reach. The only thing left to pursue are 'limits.'\n'Ms. Helena, did you know that some operators have described your driving as like passing through a windstorm in their mission reports?'\n'Ah, yeah, I can explain that. Had a group of frontier bandits on our tail. So I had to get a little extreme to shake 'em off.'\n'Extreme?'\n'Drove a little faster, took a different path. Nothing special.'\n'Could you be more specific?'\n'See, here's what happened... After a wild chase in the city for a few miles, I drove up onto the roof of a four-story hotel. Did a couple loops up there before finding a path through the air that'd take us across the river. That's how we got the medicine to the other side.'\n'What the hell, lady, what were you thinking?'\n'Oh, just that it'd've been nice if we got a little rain. Or else it'd kick up a cloud of dust when we landed, and the guys out there to meet us would get a mouthful of sand.'",
            "unLockType": "FAVOR",
            "unLockParam": "100",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 2",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "Anna Mitterrand, a tall Elafia woman from Nulaiteburgh. Age 18, with green eyes, pale purplish ankle-length hair, and a small mole at the corner of her mouth. On April 26, 1066, at around 11 PM, she eloped with a man from the frontier she met at the local watering hole, the McCullen Saloon, and she remains missing. She left home wearing a green dress, a pearl necklace, and priceless emerald earrings.\nIf you're reading this, Anna, please come home as soon as you can. Your parents are worried sick, and your family is ashamed of your behavior. If anyone has seen her or has any leads, please immediately contact her father, Charlie Mitterrand, and her fiance Kendall Gould. A reward will be provided. If you can capture her and bring her back, the reward will be doubled.\n—Excerpt from <i>The Nulaiteburgh Evening Post</i>\n\nHelena F■■■■, age 23, Elafia, has a ■■■■ by her mouth, ■■■■ eyes, ■■■■ braided hair tied behind her head. Left ■■ on March 1■, 10■■ and has not returned.\nTook only a few items of clothing and a burdenbeast.\nIf anyone ■■■■ her whereabouts and has any leads, please contact her lover ■■■■.\n—From the missing persons posters stuck to the wall of a certain pub on the frontier. Due to its age, some of the words have faded into illegibility.\n\nMadeline, Elafia, in her 30s, green eyes, purple shoulder-length hair, mole by her mouth, packs a homemade nail gun. Last month, she barged into our hideout, killed our boss, and torched the place.\nIf you know where she is, we got money for ya.\nIf you bring us her corpse, more money than you can count.\nAnyone who covers for her or helps her out is a dead man walking.\n—From the bounty posted by a certain frontier gang\n\nNameless female, estimated to be in her 40s, an Elafia with a fair appearance, green eyes, short purple hair, and a mole at the corner of her mouth.\nYears ago, she avenged my parents by taking down a gang in the frontier, and paid for my ride to Ironforge City. I have since distinguished myself in academia and amassed a small fortune, and would like to repay this kind woman.\nIf anyone knows her whereabouts, please contact Anna Brandt. Huge reward offered.\n—From <i>The Ironforge Evening Post</i>",
            "unLockType": "FAVOR",
            "unLockParam": "150",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 3",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "After wandering the frontier on her own for years, Helena arrived in Davistown and accepted the final request of her old lover before his passing: to take care of the diner he left behind. Later, when Davistown went bankrupt, the platform was bought out by Blacksteel. It was only then that she and the other residents started their new lives on the frontier.\nWhen she first arrived at Davistown, Helena wasn't planning on ending her free-roaming frontier life just yet. She only wanted to find someone dependable to take over the restaurant. However, as the years went by, she remained on the platform to run the eatery. Every time someone asked her about it, she would nonchalantly reply that it was because the residents loved her cooking. Aside from compliments and payment for their meals, her patrons never left her anything unnecessary, and moreover, none of them ever asked her to stay. This made her feel relaxed and unrestrained. From this, it's not hard to see that while Helena is warm and friendly to others, she prefers to keep a certain distance in her interpersonal relations.\nIn theory, dealing with a personality such as hers should be exhausting, but every operator who has been around her agrees that interacting with her is actually very pleasant. She is good at mixing drinks, and even better at listening to people vent about their troubles. However, the most important part is that she respects each and every person's personal space. Never does she cross the line and pry into anyone's innermost thoughts, even if they open up to her themselves.\nWhen operators go to her for advice on interpersonal relationships, she only ever gives them a very simple answer:\n'It ain't complicated. When you're dealing with someone, you just gotta remember that she's first and foremost herself. It's only after that she's someone else's kid, friend, partner, or parent.'",
            "unLockType": "FAVOR",
            "unLockParam": "200",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Archive File 4",
        "unLockorNot": true
      },
      {
        "stories": [
          {
            "storyText": "You can't help but frown when you see the white liquid in your cup, but the woman opposite you seems completely unconcerned by your dissatisfaction as she goes back to cleaning wine glasses.\n'Alright, enough with the face, young man.\n'You can't sleep? Then don't. Drinking ain't a good habit. Keep on downing drink after drink like that, and the whole night'll be chaos. How about a warm glass of milk instead?\n'At first, all you'll feel is helplessness from the darkness and loneliness, but they'll have you cornered soon enough. Then, all you'll feel is tiredness, but don't sleep. Splash some cold water on your face to keep yourself awake.\n'When the lights outside the window start going out one by one in anticipation of the coming morning sun, the red glow'll stab your eyes that have adjusted to the dark. It'll sting, but bear with it. Just a reminder that you got a strange new day ahead of you.\n'By then, you'll have forgotten all the troubles you had the night before, and all the pain you suffered in the past. Because right then, your fear for the future'll trump everything else.\n'It'll have you anxious, for sure. But also excited. You'll find yourself trembling from it.'",
            "unLockType": "AWAKE",
            "unLockParam": "2;1",
            "unLockString": "",
            "patchIdList": null
          }
        ],
        "storyTitle": "Promotion Record",
        "unLockorNot": true
      }
    ],
    "attributes": {
      "maxHp": 1428,
      "atk": 804,
      "def": 179,
      "magicResistance": 0,
      "blockCnt": 1,
      "baseAttackTime": 1.6,
      "respawnTime": 80,
      "cost": 21
    }
  },
  "trait": [
    {
      "unlockCondition": {
        "phase": "PHASE_0",
        "level": 1
      },
      "requiredPotentialRank": 0,
      "blackboard": [
        {
          "key": "value",
          "value": 4
        },
        {
          "key": "atk_scale",
          "value": 1.2
        }
      ],
      "overrideDescription": "Attacks consume Ammo to increase ATK to <@ba.kw>{atk_scale:0%}</>; While not attacking, Ammo will be slowly reloaded (max capacity {value}, improved at Elite 1).",
      "prefabKey": "-1",
      "rangeId": null
    },
    {
      "unlockCondition": {
        "phase": "PHASE_1",
        "level": 1
      },
      "requiredPotentialRank": 0,
      "blackboard": [
        {
          "key": "value",
          "value": 6
        },
        {
          "key": "atk_scale",
          "value": 1.2
        }
      ],
      "overrideDescription": "Attacks consume Ammo to increase ATK to <@ba.kw>{atk_scale:0%}</>; While not attacking, Ammo will be slowly reloaded (max capacity {value}, improved at Elite 2).",
      "prefabKey": "-1",
      "rangeId": null
    },
    {
      "unlockCondition": {
        "phase": "PHASE_2",
        "level": 1
      },
      "requiredPotentialRank": 0,
      "blackboard": [
        {
          "key": "value",
          "value": 8
        },
        {
          "key": "atk_scale",
          "value": 1.2
        }
      ],
      "overrideDescription": "Attacks consume Ammo to increase ATK to <@ba.kw>{atk_scale:0%}</>; While not attacking, Ammo will be slowly reloaded (max capacity {value}).",
      "prefabKey": "-1",
      "rangeId": null
    }
  ],
  "skins": [
    {
      "skinId": "char_4104_coldst#1",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_0",
      "avatarId": "char_4104_coldst",
      "portraitId": "char_4104_coldst_1",
      "illustId": "illust_char_4104_coldst_1",
      "modelName": "Coldshot",
      "drawerList": [
        "Mag42"
      ],
      "description": "An outfit commonly worn by Operators.\nWhile not as practical as a uniform, it's what they find most comfortable.",
      "rarity": -50
    },
    {
      "skinId": "char_4104_coldst#2",
      "skinName": "",
      "skinGroupName": "Default Outfit",
      "skinGroupId": "ILLUST_2",
      "avatarId": "char_4104_coldst_2",
      "portraitId": "char_4104_coldst_2",
      "illustId": "illust_char_4104_coldst_2",
      "modelName": "Coldshot",
      "drawerList": [
        "Mag42"
      ],
      "description": "An outfit that has been improved after the Operator's Promotion.\nCustom-made to suit each Operator's experiences and needs, these outfits are designed to provide them maximum flexibility on any battlefield. Furthermore, this is all done without compromising the comfort that they've come to expect.",
      "rarity": -10
    },
    {
      "skinId": "char_4104_coldst@striker#3",
      "skinName": "Dawnbreak",
      "skinGroupName": "Raythean Striker/III",
      "skinGroupId": "2024#striker",
      "avatarId": "char_4104_coldst_striker#3",
      "portraitId": "char_4104_coldst_striker#3",
      "illustId": "illust_char_4104_coldst_striker#3",
      "modelName": "Coldshot",
      "drawerList": [
        "Mag42"
      ],
      "description": "<color name=#ffffff>Striker Series/Dawnbreak. A product of Raythean Industries, made for mechanized combat, combining fashionable colors with punk style. Multi-purpose bandoliers ensure efficiency even in complex environments, providing absolute freedom.</color>",
      "rarity": 134
    }
  ],
  "phases": [
    {
      "maxLevel": 50,
      "rangeId": "3-12",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 845,
            "atk": 476,
            "def": 105,
            "magicResistance": 0,
            "cost": 17,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 50,
          "data": {
            "maxHp": 1113,
            "atk": 635,
            "def": 141,
            "magicResistance": 0,
            "cost": 17,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": null
    },
    {
      "maxLevel": 70,
      "rangeId": "4-9",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1113,
            "atk": 635,
            "def": 141,
            "magicResistance": 0,
            "cost": 19,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 70,
          "data": {
            "maxHp": 1428,
            "atk": 804,
            "def": 179,
            "magicResistance": 0,
            "cost": 19,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3241",
          "count": 4,
          "type": "MATERIAL",
          "name": "Sniper Chip",
          "rarity": 3,
          "iconId": "MTL_ASC_SNP1"
        },
        {
          "id": "30042",
          "count": 4,
          "type": "MATERIAL",
          "name": "Oriron",
          "rarity": 2,
          "iconId": "MTL_SL_IRON2"
        },
        {
          "id": "30052",
          "count": 2,
          "type": "MATERIAL",
          "name": "Polyketon",
          "rarity": 2,
          "iconId": "MTL_SL_KETONE2"
        }
      ]
    },
    {
      "maxLevel": 80,
      "rangeId": "4-9",
      "attributesKeyFrames": [
        {
          "level": 1,
          "data": {
            "maxHp": 1428,
            "atk": 804,
            "def": 179,
            "magicResistance": 0,
            "cost": 21,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        },
        {
          "level": 80,
          "data": {
            "maxHp": 1855,
            "atk": 958,
            "def": 224,
            "magicResistance": 0,
            "cost": 21,
            "blockCnt": 1,
            "moveSpeed": 1,
            "attackSpeed": 100,
            "baseAttackTime": 1.6,
            "respawnTime": 80,
            "hpRecoveryPerSec": 0,
            "spRecoveryPerSec": 1,
            "maxDeployCount": 1,
            "maxDeckStackCnt": 0,
            "tauntLevel": 0,
            "massLevel": 0,
            "baseForceLevel": 0,
            "stunImmune": false,
            "silenceImmune": false,
            "sleepImmune": false,
            "frozenImmune": false,
            "levitateImmune": false,
            "disarmedCombatImmune": false,
            "fearedImmune": false
          }
        }
      ],
      "evolveCost": [
        {
          "id": "3243",
          "count": 3,
          "type": "MATERIAL",
          "name": "Sniper Dualchip",
          "rarity": 5,
          "iconId": "MTL_ASC_SNP3"
        },
        {
          "id": "30104",
          "count": 8,
          "type": "MATERIAL",
          "name": "RMA70-24",
          "rarity": 4,
          "iconId": "MTL_SL_RMA7024"
        },
        {
          "id": "30043",
          "count": 10,
          "type": "MATERIAL",
          "name": "Oriron Cluster",
          "rarity": 3,
          "iconId": "MTL_SL_IRON3"
        }
      ]
    }
  ],
  "skills": [
    {
      "skillId": "skcom_atk_up[3]",
      "skillName": "ATK Up γ",
      "desc": "ATK <@ba.vup>+{atk:0%}</>",
      "iconId": "skcom_atk_up",
      "spCost": 30,
      "initSp": 15,
      "duration": 30,
      "blackboard": [
        {
          "key": "atk",
          "value": 1
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30013",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "31064",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30074",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30135",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31024",
              "count": 4,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    },
    {
      "skillId": "skchr_coldst_2",
      "skillName": "Party Night",
      "desc": "<@ba.vdown>Increases</> reload interval, ATK <@ba.vup>+{atk:0%}</>, and attacks <$ba.sluggish>Slow</> the target for <@ba.vup>{attack@sluggish}</> second",
      "iconId": "skchr_coldst_2",
      "spCost": 40,
      "initSp": 25,
      "duration": 40,
      "blackboard": [
        {
          "key": "atk",
          "value": 1.4
        },
        {
          "key": "reload_interval",
          "value": 0.8
        },
        {
          "key": "attack@sluggish",
          "value": 1
        }
      ],
      "upgradeCost": [
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 28800,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 5,
              "type": "MATERIAL"
            },
            {
              "id": "31044",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30103",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 57600,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 6,
              "type": "MATERIAL"
            },
            {
              "id": "30094",
              "count": 3,
              "type": "MATERIAL"
            },
            {
              "id": "30014",
              "count": 6,
              "type": "MATERIAL"
            }
          ]
        },
        {
          "phase": "PHASE_2",
          "level": 1,
          "lvlUpTime": 86400,
          "levelUpCost": [
            {
              "id": "3303",
              "count": 10,
              "type": "MATERIAL"
            },
            {
              "id": "30145",
              "count": 4,
              "type": "MATERIAL"
            },
            {
              "id": "31064",
              "count": 3,
              "type": "MATERIAL"
            }
          ]
        }
      ]
    }
  ],
  "potentialRanks": [
    {
      "type": "BUFF",
      "description": "DP Cost -1",
      "buff": {
        "attributes": {
          "attributeModifiers": [
            {
              "attributeType": "COST",
              "formulaItem": "ADDITION",
              "value": -1,
              "loadFromBlackboard": false,
              "fetchBaseValueFromSourceEntity": false
            }
          ]
        }
      }
    },
    {
      "type": "BUFF",
      "description": "Redeployment Time -10 sec",
      "buff": {
        "attributes": {
          "attributeModifiers": [
            {
              "attributeType": "RESPAWN_TIME",
              "formulaItem": "ADDITION",
              "value": -10,
              "loadFromBlackboard": false,
              "fetchBaseValueFromSourceEntity": false
            }
          ]
        }
      }
    },
    {
      "type": "BUFF",
      "description": "DP Cost -1",
      "buff": {
        "attributes": {
          "attributeModifiers": [
            {
              "attributeType": "COST",
              "formulaItem": "ADDITION",
              "value": -1,
              "loadFromBlackboard": false,
              "fetchBaseValueFromSourceEntity": false
            }
          ]
        }
      }
    },
    {
      "type": "CUSTOM",
      "description": "Improves Talent",
      "buff": {}
    },
    {
      "type": "BUFF",
      "description": "DP Cost -1",
      "buff": {
        "attributes": {
          "attributeModifiers": [
            {
              "attributeType": "COST",
              "formulaItem": "ADDITION",
              "value": -1,
              "loadFromBlackboard": false,
              "fetchBaseValueFromSourceEntity": false
            }
          ]
        }
      }
    }
  ],
  "favorKeyFrames": [
    {
      "level": 0,
      "data": {
        "maxHp": 0,
        "atk": 0,
        "def": 0,
        "magicResistance": 0,
        "cost": 0,
        "blockCnt": 0,
        "moveSpeed": 0,
        "attackSpeed": 0,
        "baseAttackTime": 0,
        "respawnTime": 0,
        "hpRecoveryPerSec": 0,
        "spRecoveryPerSec": 0,
        "maxDeployCount": 0,
        "maxDeckStackCnt": 0,
        "tauntLevel": 0,
        "massLevel": 0,
        "baseForceLevel": 0,
        "stunImmune": false,
        "silenceImmune": false,
        "sleepImmune": false,
        "frozenImmune": false,
        "levitateImmune": false,
        "disarmedCombatImmune": false,
        "fearedImmune": false
      }
    },
    {
      "level": 50,
      "data": {
        "maxHp": 0,
        "atk": 105,
        "def": 0,
        "magicResistance": 0,
        "cost": 0,
        "blockCnt": 0,
        "moveSpeed": 0,
        "attackSpeed": 0,
        "baseAttackTime": 0,
        "respawnTime": 0,
        "hpRecoveryPerSec": 0,
        "spRecoveryPerSec": 0,
        "maxDeployCount": 0,
        "maxDeckStackCnt": 0,
        "tauntLevel": 0,
        "massLevel": 0,
        "baseForceLevel": 0,
        "stunImmune": false,
        "silenceImmune": false,
        "sleepImmune": false,
        "frozenImmune": false,
        "levitateImmune": false,
        "disarmedCombatImmune": false,
        "fearedImmune": false
      }
    }
  ],
  "talents": [
    {
      "candidates": [
        {
          "unlockCondition": {
            "phase": "PHASE_1",
            "level": 1
          },
          "requiredPotentialRank": 0,
          "prefabKey": "1",
          "name": "Not to be Outdone",
          "description": "If no attack is made for 2 seconds, the next attack deals 120% ATK as Physical damage",
          "blackboard": {
            "atk_scale": 1.2,
            "attack@delay": 2
          },
          "tokenKey": null,
          "isHideTalent": false
        },
        {
          "unlockCondition": {
            "phase": "PHASE_1",
            "level": 1
          },
          "requiredPotentialRank": 4,
          "prefabKey": "1",
          "name": "Not to be Outdone",
          "description": "If no attack is made for 2 seconds, the next attack deals 123% <@ba.talpu>(+3%)</> ATK as Physical damage",
          "blackboard": {
            "atk_scale": 1.23,
            "attack@delay": 2
          },
          "tokenKey": null,
          "isHideTalent": false
        },
        {
          "unlockCondition": {
            "phase": "PHASE_2",
            "level": 1
          },
          "requiredPotentialRank": 0,
          "prefabKey": "1",
          "name": "Not to be Outdone",
          "description": "If no attack is made for 2 seconds, the next attack deals 130% ATK as Physical damage",
          "blackboard": {
            "atk_scale": 1.3,
            "attack@delay": 2
          },
          "tokenKey": null,
          "isHideTalent": false
        },
        {
          "unlockCondition": {
            "phase": "PHASE_2",
            "level": 1
          },
          "requiredPotentialRank": 4,
          "prefabKey": "1",
          "name": "Not to be Outdone",
          "description": "If no attack is made for 2 seconds, the next attack deals 133% <@ba.talpu>(+3%)</> ATK as Physical damage",
          "blackboard": {
            "atk_scale": 1.33,
            "attack@delay": 2
          },
          "tokenKey": null,
          "isHideTalent": false
        }
      ]
    }
  ],
  "modules": [
    {
      "moduleId": "uniequip_001_coldst",
      "moduleName": "Coldshot's Badge",
      "desc": "Operator Coldshot has demonstrated a remarkable aptitude for storing and unleashing capacitance-based firepower to penetrative ends when facing the enemy.\nThe Field Operations Department has thus passed the following resolution:\nThis operator shall be appointed a Sniper Operator during field operations to exercise Hunter responsibilities.\nIn witness whereof,\nThis badge is hereby conferred upon the above named.",
      "typeIcon": "original",
      "uniEquipIcon": "uniequip_001_coldst",
      "typeName1": "ORIGINAL",
      "typeName2": "",
      "showEvolvePhase": "PHASE_2",
      "unlockLevel": 0,
      "missionList": [],
      "unlockFavors": {},
      "itemCost": {},
      "module_upgrades": []
    },
    {
      "moduleId": "uniequip_002_coldst",
      "moduleName": "'Unbridled'",
      "desc": "'What a fine beast.' When the ranch owner takes Helena to see the burdenbeast that evening, this is the first thought that crosses her mind.\nThe burdenbeast stands proud in the corral, its stocky build much larger than any burdenbeast Helena has ever tamed. Fresh scars mar its face and neck, while a fading name is branded onto the side of its belly by hot iron, making it seem particularly extraordinary.\nExtraordinary—an apt word to describe what the burdenbeast has endured. The ranch owner tells Helena that it took the hunters quite some effort to capture it. Tracking the beast alone took five days, as its tracks led them across mountains and valleys, through forests and creeks, almost straight into a full-on Catastrophe. Only after almost wearing out their boots and exhausting all their tranquilizer arrows did they finally manage to bring this legendary burdenbeast back. Many renowned riders have since tried to tame it, all to no avail.\n'What a fine beast,' Helena exclaims.\n'That's right. That's why you're our last hope at taming it,' the ranch owner responds, sounding slightly defeated. 'If even you can't tame it, I'll have no choice but to send it to the slaughterhouse.'\nHelena takes out the bridle and vaults over the fence.\nShe advances slowly and gently towards the burdenbeast until they are less than half a meter apart. In one hand, she holds the bridle; with the other, she caresses its face, fingers tracing the new and old scars. Before anyone can react, she slips the bridle over its neck, tightens the reins, and effortlessly flips onto the beast's back.\nThe ranch owner's gasp is instantly drowned out by the beast's deafening neighs. Helena quickly steadies herself, holding tightly onto the reins no matter how hard the beast kicks and shakes. Enraged, the beast rears up on its hind legs and lets out a furious cry. Helena leans forward, pressing her body entirely against its back. Despite all these years, even as its mane has hardened and its hide has grown rough, the vigor and life force of the wild still course through its veins.\nHelena recalls the evening of her seventeenth birthday. Her father had given her a burdenbeast as a present and had used a hot iron to brand its name onto the side of its belly. 'Anna.'\n'Anna. What a fine beast.' That was what Helena had thought.\nDiscreetly, Helena takes out a dagger from her pocket and, with a gentle nick, cuts the rein. With all its strength, 'Anna' shakes off the bridle and Helena. For a fleeting moment, Helena feels as if their gazes meet, though she cannot be sure. Half a second later, 'Anna' clears the fence with a single leap.\n'Holy! You nearly had it, Helena!' The ranch owner's tone is a mix of excitement and shame.\n'What a fine beast.' That's all Helena says as she gets back up, pats the dirt off herself, and watches as the burdenbeast gallops back into the wild.",
      "typeIcon": "hun-x",
      "uniEquipIcon": "uniequip_002_coldst",
      "typeName1": "HUN",
      "typeName2": "X",
      "showEvolvePhase": "PHASE_2",
      "unlockLevel": 50,
      "missionList": [
        "uniequip_002_coldst_1",
        "uniequip_002_coldst_2"
      ],
      "unlockFavors": {
        "1": 0,
        "2": 2732,
        "3": 10070
      },
      "itemCost": {
        "1": [
          {
            "id": "mod_unlock_token",
            "count": 2,
            "type": "MATERIAL"
          },
          {
            "id": "30014",
            "count": 3,
            "type": "MATERIAL"
          },
          {
            "id": "4001",
            "count": 40000,
            "type": "GOLD"
          }
        ],
        "2": [
          {
            "id": "mod_unlock_token",
            "count": 2,
            "type": "MATERIAL"
          },
          {
            "id": "mod_update_token_1",
            "count": 20,
            "type": "MATERIAL"
          },
          {
            "id": "30104",
            "count": 4,
            "type": "MATERIAL"
          },
          {
            "id": "4001",
            "count": 50000,
            "type": "GOLD"
          }
        ],
        "3": [
          {
            "id": "mod_unlock_token",
            "count": 2,
            "type": "MATERIAL"
          },
          {
            "id": "mod_update_token_2",
            "count": 8,
            "type": "MATERIAL"
          },
          {
            "id": "31024",
            "count": 5,
            "type": "MATERIAL"
          },
          {
            "id": "4001",
            "count": 60000,
            "type": "GOLD"
          }
        ]
      },
      "module_upgrades": [
        {
          "equipLevel": 1,
          "attributeBlackboard": [
            {
              "key": "max_hp",
              "value": 128,
              "valueStr": null
            },
            {
              "key": "atk",
              "value": 53,
              "valueStr": null
            }
          ],
          "tokenAttributeBlackboard": {},
          "parts": [
            {
              "target": "TRAIT_DATA_ONLY",
              "isToken": false,
              "talents": [],
              "trait": [
                {
                  "additionalDescription": "When Ammo count is empty, the next reload +1 Ammo additionally",
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "blackboard": [
                    {
                      "key": "extra_add",
                      "value": 1,
                      "valueStr": null
                    },
                    {
                      "key": "value",
                      "value": 8,
                      "valueStr": null
                    },
                    {
                      "key": "atk_scale",
                      "value": 1.2,
                      "valueStr": null
                    }
                  ],
                  "overrideDescripton": null,
                  "prefabKey": "-1",
                  "rangeId": null
                }
              ]
            }
          ]
        },
        {
          "equipLevel": 2,
          "attributeBlackboard": [
            {
              "key": "max_hp",
              "value": 168,
              "valueStr": null
            },
            {
              "key": "atk",
              "value": 65,
              "valueStr": null
            }
          ],
          "tokenAttributeBlackboard": {},
          "parts": [
            {
              "target": "TRAIT_DATA_ONLY",
              "isToken": false,
              "talents": [],
              "trait": [
                {
                  "additionalDescription": "When Ammo count is empty, the next reload +1 Ammo additionally",
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "blackboard": [
                    {
                      "key": "extra_add",
                      "value": 1,
                      "valueStr": null
                    },
                    {
                      "key": "value",
                      "value": 8,
                      "valueStr": null
                    },
                    {
                      "key": "atk_scale",
                      "value": 1.2,
                      "valueStr": null
                    }
                  ],
                  "overrideDescripton": null,
                  "prefabKey": "-1",
                  "rangeId": null
                }
              ]
            },
            {
              "target": "TALENT_DATA_ONLY",
              "isToken": false,
              "talents": [
                {
                  "displayRangeId": false,
                  "upgradeDescription": "If no attack is made for 2 seconds, the next attack deals 135% ATK as Physical damage",
                  "talentIndex": 0,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "prefabKey": "1",
                  "name": "Not to be Outdone",
                  "description": null,
                  "rangeId": null,
                  "blackboard": [
                    {
                      "key": "atk_scale",
                      "value": 1.35,
                      "valueStr": null
                    },
                    {
                      "key": "attack@delay",
                      "value": 2,
                      "valueStr": null
                    }
                  ],
                  "tokenKey": null,
                  "isHideTalent": false
                },
                {
                  "displayRangeId": false,
                  "upgradeDescription": "If no attack is made for 2 seconds, the next attack deals 138% <@ba.talpu>(+3%)</> ATK as Physical damage",
                  "talentIndex": 0,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 4,
                  "prefabKey": "1",
                  "name": "Not to be Outdone",
                  "description": null,
                  "rangeId": null,
                  "blackboard": [
                    {
                      "key": "atk_scale",
                      "value": 1.38,
                      "valueStr": null
                    },
                    {
                      "key": "attack@delay",
                      "value": 2,
                      "valueStr": null
                    }
                  ],
                  "tokenKey": null,
                  "isHideTalent": false
                }
              ],
              "trait": []
            }
          ]
        },
        {
          "equipLevel": 3,
          "attributeBlackboard": [
            {
              "key": "max_hp",
              "value": 205,
              "valueStr": null
            },
            {
              "key": "atk",
              "value": 75,
              "valueStr": null
            }
          ],
          "tokenAttributeBlackboard": {},
          "parts": [
            {
              "target": "TRAIT_DATA_ONLY",
              "isToken": false,
              "talents": [],
              "trait": [
                {
                  "additionalDescription": "When Ammo count is empty, the next reload +1 Ammo additionally",
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "blackboard": [
                    {
                      "key": "extra_add",
                      "value": 1,
                      "valueStr": null
                    },
                    {
                      "key": "value",
                      "value": 8,
                      "valueStr": null
                    },
                    {
                      "key": "atk_scale",
                      "value": 1.2,
                      "valueStr": null
                    }
                  ],
                  "overrideDescripton": null,
                  "prefabKey": "-1",
                  "rangeId": null
                }
              ]
            },
            {
              "target": "TALENT_DATA_ONLY",
              "isToken": false,
              "talents": [
                {
                  "displayRangeId": false,
                  "upgradeDescription": "If no attack is made for 2 seconds, the next attack deals 138% ATK as Physical damage",
                  "talentIndex": 0,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 0,
                  "prefabKey": "1",
                  "name": "Not to be Outdone",
                  "description": null,
                  "rangeId": null,
                  "blackboard": [
                    {
                      "key": "atk_scale",
                      "value": 1.38,
                      "valueStr": null
                    },
                    {
                      "key": "attack@delay",
                      "value": 2,
                      "valueStr": null
                    }
                  ],
                  "tokenKey": null,
                  "isHideTalent": false
                },
                {
                  "displayRangeId": false,
                  "upgradeDescription": "If no attack is made for 2 seconds, the next attack deals 141% <@ba.talpu>(+3%)</> ATK as Physical damage",
                  "talentIndex": 0,
                  "unlockCondition": {
                    "phase": "PHASE_2",
                    "level": 50
                  },
                  "requiredPotentialRank": 4,
                  "prefabKey": "1",
                  "name": "Not to be Outdone",
                  "description": null,
                  "rangeId": null,
                  "blackboard": [
                    {
                      "key": "atk_scale",
                      "value": 1.41,
                      "valueStr": null
                    },
                    {
                      "key": "attack@delay",
                      "value": 2,
                      "valueStr": null
                    }
                  ],
                  "tokenKey": null,
                  "isHideTalent": false
                }
              ],
              "trait": []
            }
          ]
        }
      ]
    }
  ],
  "voice_lines": [
    {
      "voiceTitle": "Appointed as Assistant",
      "voiceText": "You have to clear all these documents on your desk? Gosh, that's a lot. How about a short break, honey? Tired as you are, a refreshing drink ought to help.",
      "voiceAsset": "char_4104_coldst/CN_001",
      "voiceId": "CN_001",
      "placeType": "HOME_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 1",
      "voiceText": "What would you like to order tonight? Some ribs, maybe fried fowlbeast? I recommend the ribs with red wine, or the fowl with a glass of sparkling water Hm? You want both? Only if you can finish it all, darlin'. I wouldn't want any to go to waste.",
      "voiceAsset": "char_4104_coldst/CN_002",
      "voiceId": "CN_002",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 2",
      "voiceText": "I met an interesting guy in Tkaronto who claimed to be the president of the Columbian Chiromancy Association. He was all about palm reading, and insisted on teaching me a thing or two. Unfortunately, I'm not a believer —Why not? Heh. Because for all the nonsense that came out of his mouth, his furry paws didn't have a single crease on them!",
      "voiceAsset": "char_4104_coldst/CN_003",
      "voiceId": "CN_003",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk 3",
      "voiceText": "Davistown is a mining platform. It gets really cold in winter, but the warmth of its residents kept my diner open for more than a decade. Unfortunately, social ties alone couldn't save the iron mine, and it eventually became a Blacksteel training platform. Well, nothing I can do but wish them well. Hope they don't tip the whole thing into a ditch.",
      "voiceAsset": "char_4104_coldst/CN_004",
      "voiceId": "CN_004",
      "placeType": "HOME_SHOW",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Talk after Promotion 1",
      "voiceText": "It's in great condition, but I haven't actually used this weapon much in the past few years. A steak knife is enough to settle a dispute. How? Simple, if it's sharp enough to cut a steak, it's sharp enough to cut other things... Wanna see it in action?",
      "voiceAsset": "char_4104_coldst/CN_005",
      "voiceId": "CN_005",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Promotion 2",
      "voiceText": "I've seen automated mining platforms. I know it's just a matter of time until those industrial monsters phase out Davistown. But I still can't forgive the profiteers. They never give it a second thought how they're selling more than just the platform, it comes with the lives of everyone on it.",
      "voiceAsset": "char_4104_coldst/CN_006",
      "voiceId": "CN_006",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 1",
      "voiceText": "Something bothering you? Need a drink? I learned what I know out in the Columbian wilds, so my drinks aren't exactly stylish, but they pack a punch... Don't look at me like that, hon. We can just chat if you don't want to drink.",
      "voiceAsset": "char_4104_coldst/CN_007",
      "voiceId": "CN_007",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 40
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 2",
      "voiceText": "Jessica was so gloomy out on the frontier, but she still worked her hardest, day and night. Poor girl wouldn't even admit she was tired when anybody asked... I'm glad to see she looks so much better now that she's here at Rhodes Island with you by her side—Oh, hold still, hon! Your neck and shoulders are stiff as a board. Of course it's gonna hurt when I press down on them like this.",
      "voiceAsset": "char_4104_coldst/CN_008",
      "voiceId": "CN_008",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 100
        }
      ]
    },
    {
      "voiceTitle": "Talk after Trust Increase 3",
      "voiceText": "I made a bet that I could drive us from the frontier to Tkaronto in one night. Wanna come along? You ride shotgun, I'll drive. Either I win, or we'll just park the car somewhere and watch the sunrise, play it like we spent the night chasing the dawn.",
      "voiceAsset": "char_4104_coldst/CN_009",
      "voiceId": "CN_009",
      "placeType": "HOME_SHOW",
      "voiceType": "ONLY_TEXT",
      "unlockType": "FAVOR",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 200
        }
      ]
    },
    {
      "voiceTitle": "Idle",
      "voiceText": "Doctor, wake up. You'll get a stiff neck if you sleep at your desk. Lay down on the sofa, I already put out a blanket.",
      "voiceAsset": "char_4104_coldst/CN_010",
      "voiceId": "CN_010",
      "placeType": "HOME_WAIT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Onboard",
      "voiceText": "Hello, Doctor. Jessica and I are here to get medical help for our infected Pioneers. She talks about you all the time, so I think we'll be good working together.",
      "voiceAsset": "char_4104_coldst/CN_011",
      "voiceId": "CN_011",
      "placeType": "GACHA",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Watching Battle Record",
      "voiceText": "Hmm… This looks like more trouble than breaking up a fight in the diner...",
      "voiceAsset": "char_4104_coldst/CN_012",
      "voiceId": "CN_012",
      "placeType": "LEVEL_UP",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Promotion 1",
      "voiceText": "A company promotion is a wholly new experience for me... thank you, Doctor.",
      "voiceAsset": "char_4104_coldst/CN_013",
      "voiceId": "CN_013",
      "placeType": "EVOLVE_ONE",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 1
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Promotion 2",
      "voiceText": "I'm not trying to protect anything, I just want to experience as much goodness as I can, leaving no regrets behind. But, if someone were here to do badness, I wouldn't hesitate to empty my magazine.",
      "voiceAsset": "char_4104_coldst/CN_014",
      "voiceId": "CN_014",
      "placeType": "EVOLVE_TWO",
      "voiceType": "ONLY_TEXT",
      "unlockType": "AWAKE",
      "unlockParam": [
        {
          "valueStr": null,
          "valueInt": 2
        },
        {
          "valueStr": null,
          "valueInt": 1
        }
      ]
    },
    {
      "voiceTitle": "Added to Squad",
      "voiceText": "I still prefer the conflicts you can settle with a steak knife.",
      "voiceAsset": "char_4104_coldst/CN_017",
      "voiceId": "CN_017",
      "placeType": "SQUAD",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Appointed as Squad Leader",
      "voiceText": "I'll assign jobs like I would in the kitchen. Everybody okay with that?",
      "voiceAsset": "char_4104_coldst/CN_018",
      "voiceId": "CN_018",
      "placeType": "SQUAD_FIRST",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Depart",
      "voiceText": "If you feel nervous, think about what song you want to sing at the party afterwards.",
      "voiceAsset": "char_4104_coldst/CN_019",
      "voiceId": "CN_019",
      "placeType": "BATTLE_START",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Begin Operation",
      "voiceText": "I smell something unpleasant burning.",
      "voiceAsset": "char_4104_coldst/CN_020",
      "voiceId": "CN_020",
      "placeType": "BATTLE_FACE_ENEMY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 1",
      "voiceText": "What kind of 'drink' can I fix you?",
      "voiceAsset": "char_4104_coldst/CN_021",
      "voiceId": "CN_021",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Selecting Operator 2",
      "voiceText": "Who do you want me to target?",
      "voiceAsset": "char_4104_coldst/CN_022",
      "voiceId": "CN_022",
      "placeType": "BATTLE_SELECT",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 1",
      "voiceText": "Got a clear view here. Hope they don't got the same.",
      "voiceAsset": "char_4104_coldst/CN_023",
      "voiceId": "CN_023",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Deployment 2",
      "voiceText": "Relax, I'm almost done reloading.",
      "voiceAsset": "char_4104_coldst/CN_024",
      "voiceId": "CN_024",
      "placeType": "BATTLE_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 1",
      "voiceText": "Want a drink? It's on me.",
      "voiceAsset": "char_4104_coldst/CN_025",
      "voiceId": "CN_025",
      "placeType": "BATTLE_SKILL_1",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 2",
      "voiceText": "Too bad, I've got you now.",
      "voiceAsset": "char_4104_coldst/CN_026",
      "voiceId": "CN_026",
      "placeType": "BATTLE_SKILL_2",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 3",
      "voiceText": "Ready to surrender? No? Sorry about this, then.",
      "voiceAsset": "char_4104_coldst/CN_027",
      "voiceId": "CN_027",
      "placeType": "BATTLE_SKILL_3",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "In Battle 4",
      "voiceText": "Ever stick a hot knife in butter?",
      "voiceAsset": "char_4104_coldst/CN_028",
      "voiceId": "CN_028",
      "placeType": "BATTLE_SKILL_4",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "4-star Result",
      "voiceText": "Well done, Doctor. This drink is to you.",
      "voiceAsset": "char_4104_coldst/CN_029",
      "voiceId": "CN_029",
      "placeType": "FOUR_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "3-star Result",
      "voiceText": "Mission complete, easy peasy.",
      "voiceAsset": "char_4104_coldst/CN_030",
      "voiceId": "CN_030",
      "placeType": "THREE_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Sub 3-star Result",
      "voiceText": "They're no threat anymore. Just let them wander off into the wilderness.",
      "voiceAsset": "char_4104_coldst/CN_031",
      "voiceId": "CN_031",
      "placeType": "TWO_STAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Operation Failure",
      "voiceText": "Don't worry about me, I'm just covering your retreat. I've seen worse.",
      "voiceAsset": "char_4104_coldst/CN_032",
      "voiceId": "CN_032",
      "placeType": "LOSE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Assigned to Facility",
      "voiceText": "Sometimes I miss the days I spent riding a burdenbeast out into the wilds.",
      "voiceAsset": "char_4104_coldst/CN_033",
      "voiceId": "CN_033",
      "placeType": "BUILDING_PLACE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Tap",
      "voiceText": "Careful, you almost spilled the drink.",
      "voiceAsset": "char_4104_coldst/CN_034",
      "voiceId": "CN_034",
      "placeType": "BUILDING_TOUCHING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Trust Tap",
      "voiceText": "Want a slice of this freshly baked meat pie?",
      "voiceAsset": "char_4104_coldst/CN_036",
      "voiceId": "CN_036",
      "placeType": "BUILDING_FAVOR_BUBBLE",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Title",
      "voiceText": "Arknights.",
      "voiceAsset": "char_4104_coldst/CN_037",
      "voiceId": "CN_037",
      "placeType": "LOADING_PANEL",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "New Year's blessing",
      "voiceText": "I hung up a dartboard in my diner one New Year's Eve. Anybody who beat me could get something on the house, or if they lost they'd to order an extra drink for every extra dart... Wanna guess how quick I sold out of booze that day?",
      "voiceAsset": "char_4104_coldst/CN_038",
      "voiceId": "CN_038",
      "placeType": "NEW_YEAR",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Greeting",
      "voiceText": "Hello, Doctor. What can I get you today?",
      "voiceAsset": "char_4104_coldst/CN_042",
      "voiceId": "CN_042",
      "placeType": "GREETING",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Birthday",
      "voiceText": "Remember the bet I told you about? That's your birthday present, if you're down for it. But in the meantime... enjoy this glass of 'Wild Sunrise'. Happy birthday, Doctor.",
      "voiceAsset": "char_4104_coldst/CN_043",
      "voiceId": "CN_043",
      "placeType": "BIRTHDAY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    },
    {
      "voiceTitle": "Anniversary Celebration",
      "voiceText": "I've been looking around, seeking out all kinds of scenery since I left the city I was born in. There are only two places that have made me consider stopping, Davistown and Rhodes Island.",
      "voiceAsset": "char_4104_coldst/CN_044",
      "voiceId": "CN_044",
      "placeType": "ANNIVERSARY",
      "voiceType": "ENUM",
      "unlockType": "DIRECT",
      "unlockParam": []
    }
  ],
  "building_skills": [
    {
      "buffId": "control_mp_cost[009]",
      "buffName": "Million Dollar Smile",
      "desc": "When this Operator is assigned to the Control Center, increases Morale of all Operators in the Control Center by <@cc.vup>+0.05</> per hour.",
      "skillIcon": "bskill_ctrl_cost",
      "phase": "PHASE_0",
      "level": 1
    },
    {
      "buffId": "dorm_rec_all&single[000]",
      "buffName": "Wet Your Whistles",
      "desc": "When this Operator is assigned to a Dormitory, restores <@cc.vup>+0.8</> Morale per hour distributed evenly to Operators assigned to that Dormitory whose Morale is not full (When this skill is in effect on a single or multiple Operators, only the strongest effect of this type respectively applies)",
      "skillIcon": "bskill_dorm_all&single",
      "phase": "PHASE_2",
      "level": 1
    }
  ],
  "tokens": [],
  "patch_info": {}
}